/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

/// Package Characters.

/// Class /Game/Characters/Customization/ABP_Eyewear.ABP_Eyewear_C
/// Size: 0x0380 (0x000450 - 0x0007D0)
class UABP_Eyewear_C : public UTigerEyewearAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0450   (0x0008)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0458   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0560   (0x0108)  
	FAnimNode_MeshSpaceRefPose                         AnimGraphNode_MeshRefPose;                                  // 0x0668   (0x0010)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0678   (0x0020)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0698   (0x0108)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x07A0   (0x0030)  


	/// Functions
	// Function /Game/Characters/Customization/ABP_Eyewear.ABP_Eyewear_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Customization/ABP_Eyewear.ABP_Eyewear_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Eyewear_AnimGraphNode_ModifyBone_75CEAA9341A2E5F5BEDC008475ECB15D
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Eyewear_AnimGraphNode_ModifyBone_75CEAA9341A2E5F5BEDC008475ECB15D(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/ABP_Eyewear.ABP_Eyewear_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Eyewear_AnimGraphNode_ModifyBone_CA255A0D46EF5803406ADD9DD0BAF21D
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Eyewear_AnimGraphNode_ModifyBone_CA255A0D46EF5803406ADD9DD0BAF21D(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/ABP_Eyewear.ABP_Eyewear_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Eyewear_AnimGraphNode_ModifyBone_9030559C422CA45A834828A0869B1D21
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Eyewear_AnimGraphNode_ModifyBone_9030559C422CA45A834828A0869B1D21(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/ABP_Eyewear.ABP_Eyewear_C.ExecuteUbergraph_ABP_Eyewear
	void ExecuteUbergraph_ABP_Eyewear(int32_t EntryPoint);                                                                   // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Brujah/Female/Hair/10/ABP_SKM_V_HAIR_05_POS.ABP_SKM_V_HAIR_05_POS_C
/// Size: 0x1780 (0x000330 - 0x001AB0)
class UABP_SKM_V_HAIR_05_POS_C : public UTigerCharacterPoseableMeshAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0330   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0338   (0x0030)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0368   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0470   (0x0020)  
	FAnimNode_MeshSpaceRefPose                         AnimGraphNode_MeshRefPose;                                  // 0x0490   (0x0010)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x04A0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x05A8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x06B0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x07B8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x08C0   (0x0108)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x09C8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x09D0   (0x0440)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0E10   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0F18   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1020   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1128   (0x0108)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1230   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1670   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/10/ABP_SKM_V_HAIR_05_POS.ABP_SKM_V_HAIR_05_POS_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/10/ABP_SKM_V_HAIR_05_POS.ABP_SKM_V_HAIR_05_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_05_POS_AnimGraphNode_ModifyBone_9BE87CF14344F5E65BF1D092A7023431
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_05_POS_AnimGraphNode_ModifyBone_9BE87CF14344F5E65BF1D092A7023431(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/10/ABP_SKM_V_HAIR_05_POS.ABP_SKM_V_HAIR_05_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_05_POS_AnimGraphNode_ModifyBone_A7637CDC40811D52DB475B8077EF7AE7
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_05_POS_AnimGraphNode_ModifyBone_A7637CDC40811D52DB475B8077EF7AE7(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/10/ABP_SKM_V_HAIR_05_POS.ABP_SKM_V_HAIR_05_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_05_POS_AnimGraphNode_ModifyBone_D39B15FC45DC89C49D59B38F5E22BDF9
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_05_POS_AnimGraphNode_ModifyBone_D39B15FC45DC89C49D59B38F5E22BDF9(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/10/ABP_SKM_V_HAIR_05_POS.ABP_SKM_V_HAIR_05_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_05_POS_AnimGraphNode_ModifyBone_1DE1CB4345E371692166B88CD4B7AA44
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_05_POS_AnimGraphNode_ModifyBone_1DE1CB4345E371692166B88CD4B7AA44(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/10/ABP_SKM_V_HAIR_05_POS.ABP_SKM_V_HAIR_05_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_05_POS_AnimGraphNode_ModifyBone_2C2E46C34FDB390CF6169AB3F9F9CD80
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_05_POS_AnimGraphNode_ModifyBone_2C2E46C34FDB390CF6169AB3F9F9CD80(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/10/ABP_SKM_V_HAIR_05_POS.ABP_SKM_V_HAIR_05_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_05_POS_AnimGraphNode_ModifyBone_E83E21B848472D6F3DA375BABB7D6AA4
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_05_POS_AnimGraphNode_ModifyBone_E83E21B848472D6F3DA375BABB7D6AA4(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/10/ABP_SKM_V_HAIR_05_POS.ABP_SKM_V_HAIR_05_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_05_POS_AnimGraphNode_ModifyBone_35D5F7AE4FF90D19C00754A60E4BC313
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_05_POS_AnimGraphNode_ModifyBone_35D5F7AE4FF90D19C00754A60E4BC313(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/10/ABP_SKM_V_HAIR_05_POS.ABP_SKM_V_HAIR_05_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_05_POS_AnimGraphNode_ModifyBone_E130E5E64DEA6981D288ECA1CE71741F
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_05_POS_AnimGraphNode_ModifyBone_E130E5E64DEA6981D288ECA1CE71741F(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/10/ABP_SKM_V_HAIR_05_POS.ABP_SKM_V_HAIR_05_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_05_POS_AnimGraphNode_ModifyBone_D2D1D2874476541796EA7384AA562ACD
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_05_POS_AnimGraphNode_ModifyBone_D2D1D2874476541796EA7384AA562ACD(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/10/ABP_SKM_V_HAIR_05_POS.ABP_SKM_V_HAIR_05_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_05_POS_AnimGraphNode_ModifyBone_67542B7B4DE488426672E1A3B21922A4
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_05_POS_AnimGraphNode_ModifyBone_67542B7B4DE488426672E1A3B21922A4(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/10/ABP_SKM_V_HAIR_05_POS.ABP_SKM_V_HAIR_05_POS_C.ExecuteUbergraph_ABP_SKM_V_HAIR_05_POS
	void ExecuteUbergraph_ABP_SKM_V_HAIR_05_POS(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Brujah/Female/Hair/10/ABP_VMP_BRU_F_HAIR.ABP_VMP_BRU_F_HAIR_10_C
/// Size: 0x1180 (0x0002C0 - 0x001440)
class UABP_VMP_BRU_F_HAIR_10_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02F8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0300   (0x0440)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0740   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0760   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0BA0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0FE0   (0x0440)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x1420   (0x0020)  


	/// Functions
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/10/ABP_VMP_BRU_F_HAIR.ABP_VMP_BRU_F_HAIR_10_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/10/ABP_VMP_BRU_F_HAIR.ABP_VMP_BRU_F_HAIR_10_C.ExecuteUbergraph_ABP_VMP_BRU_F_HAIR
	void ExecuteUbergraph_ABP_VMP_BRU_F_HAIR(int32_t EntryPoint);                                                            // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Brujah/Male/Hair/07/ABP_SKM_V_HAIR_09_POS.ABP_SKM_V_HAIR_09_POS_C
/// Size: 0x1340 (0x000330 - 0x001670)
class UABP_SKM_V_HAIR_09_POS_C : public UTigerCharacterPoseableMeshAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0330   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0338   (0x0030)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0368   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0470   (0x0020)  
	FAnimNode_MeshSpaceRefPose                         AnimGraphNode_MeshRefPose;                                  // 0x0490   (0x0010)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x04A0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x05A8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x06B0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x07B8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x08C0   (0x0108)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x09C8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x09D0   (0x0440)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0E10   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0F18   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1020   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1128   (0x0108)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1230   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/07/ABP_SKM_V_HAIR_09_POS.ABP_SKM_V_HAIR_09_POS_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/07/ABP_SKM_V_HAIR_09_POS.ABP_SKM_V_HAIR_09_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_09_POS_AnimGraphNode_ModifyBone_EFD12ADF49E32838461053B4B1FF22DE
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_09_POS_AnimGraphNode_ModifyBone_EFD12ADF49E32838461053B4B1FF22DE(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/07/ABP_SKM_V_HAIR_09_POS.ABP_SKM_V_HAIR_09_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_09_POS_AnimGraphNode_ModifyBone_7344903F481565B1CA44CAB9FF28CD66
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_09_POS_AnimGraphNode_ModifyBone_7344903F481565B1CA44CAB9FF28CD66(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/07/ABP_SKM_V_HAIR_09_POS.ABP_SKM_V_HAIR_09_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_09_POS_AnimGraphNode_ModifyBone_799C084949D8094B7EAA09B5AB72B8B1
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_09_POS_AnimGraphNode_ModifyBone_799C084949D8094B7EAA09B5AB72B8B1(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/07/ABP_SKM_V_HAIR_09_POS.ABP_SKM_V_HAIR_09_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_09_POS_AnimGraphNode_ModifyBone_6CBFE9B240574DD164E18DBD49CECBA7
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_09_POS_AnimGraphNode_ModifyBone_6CBFE9B240574DD164E18DBD49CECBA7(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/07/ABP_SKM_V_HAIR_09_POS.ABP_SKM_V_HAIR_09_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_09_POS_AnimGraphNode_ModifyBone_228273734E5C2DBEA1BBF6BD91D8B7CB
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_09_POS_AnimGraphNode_ModifyBone_228273734E5C2DBEA1BBF6BD91D8B7CB(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/07/ABP_SKM_V_HAIR_09_POS.ABP_SKM_V_HAIR_09_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_09_POS_AnimGraphNode_ModifyBone_5AA4A56247409F1CAD04E68D95D7E4B2
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_09_POS_AnimGraphNode_ModifyBone_5AA4A56247409F1CAD04E68D95D7E4B2(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/07/ABP_SKM_V_HAIR_09_POS.ABP_SKM_V_HAIR_09_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_09_POS_AnimGraphNode_ModifyBone_6189D55140D6BCCEFAF5C9BA7205200B
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_09_POS_AnimGraphNode_ModifyBone_6189D55140D6BCCEFAF5C9BA7205200B(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/07/ABP_SKM_V_HAIR_09_POS.ABP_SKM_V_HAIR_09_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_09_POS_AnimGraphNode_ModifyBone_661E6A5C4058630A5317E7B847B8E699
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_09_POS_AnimGraphNode_ModifyBone_661E6A5C4058630A5317E7B847B8E699(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/07/ABP_SKM_V_HAIR_09_POS.ABP_SKM_V_HAIR_09_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_09_POS_AnimGraphNode_ModifyBone_B30C5DAE49A06DB2E91F20862F2D7DD9
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_09_POS_AnimGraphNode_ModifyBone_B30C5DAE49A06DB2E91F20862F2D7DD9(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/07/ABP_SKM_V_HAIR_09_POS.ABP_SKM_V_HAIR_09_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_09_POS_AnimGraphNode_ModifyBone_6D0618B14423CAD7CEEC808FC5EDCBA1
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_09_POS_AnimGraphNode_ModifyBone_6D0618B14423CAD7CEEC808FC5EDCBA1(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/07/ABP_SKM_V_HAIR_09_POS.ABP_SKM_V_HAIR_09_POS_C.ExecuteUbergraph_ABP_SKM_V_HAIR_09_POS
	void ExecuteUbergraph_ABP_SKM_V_HAIR_09_POS(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Toreador/Female/Hair/04/ABP_VMP_TOR_F_HAIR_04.ABP_VMP_TOR_F_HAIR_04_C
/// Size: 0x1180 (0x0002C0 - 0x001440)
class UABP_VMP_TOR_F_HAIR_04_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x02C8   (0x0020)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02E8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x02F0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0730   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0B70   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0FB0   (0x0440)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x13F0   (0x0030)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x1420   (0x0020)  


	/// Functions
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/04/ABP_VMP_TOR_F_HAIR_04.ABP_VMP_TOR_F_HAIR_04_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/04/ABP_VMP_TOR_F_HAIR_04.ABP_VMP_TOR_F_HAIR_04_C.ExecuteUbergraph_ABP_VMP_TOR_F_HAIR_04
	void ExecuteUbergraph_ABP_VMP_TOR_F_HAIR_04(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Toreador/Female/Hair/04/ABP_SKM_V_HAIR_16_POS.ABP_SKM_V_HAIR_16_POS_C
/// Size: 0x0AB8 (0x000330 - 0x000DE8)
class UABP_SKM_V_HAIR_16_POS_C : public UTigerCharacterPoseableMeshAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0330   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0338   (0x0030)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0368   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0470   (0x0020)  
	FAnimNode_MeshSpaceRefPose                         AnimGraphNode_MeshRefPose;                                  // 0x0490   (0x0010)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x04A0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x05A8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x06B0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x07B8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x08C0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x09C8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0AD0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0BD8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0CE0   (0x0108)  


	/// Functions
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/04/ABP_SKM_V_HAIR_16_POS.ABP_SKM_V_HAIR_16_POS_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/04/ABP_SKM_V_HAIR_16_POS.ABP_SKM_V_HAIR_16_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_16_POS_AnimGraphNode_ModifyBone_CCD24F2045CBADB9D82D1599E03B84A9
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_16_POS_AnimGraphNode_ModifyBone_CCD24F2045CBADB9D82D1599E03B84A9(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/04/ABP_SKM_V_HAIR_16_POS.ABP_SKM_V_HAIR_16_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_16_POS_AnimGraphNode_ModifyBone_0CFF928D45E9B9A4C12CA29B8541F42E
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_16_POS_AnimGraphNode_ModifyBone_0CFF928D45E9B9A4C12CA29B8541F42E(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/04/ABP_SKM_V_HAIR_16_POS.ABP_SKM_V_HAIR_16_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_16_POS_AnimGraphNode_ModifyBone_66E2D79E46A077AD36390B98A4B46A8B
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_16_POS_AnimGraphNode_ModifyBone_66E2D79E46A077AD36390B98A4B46A8B(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/04/ABP_SKM_V_HAIR_16_POS.ABP_SKM_V_HAIR_16_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_16_POS_AnimGraphNode_ModifyBone_CE4AF84747FD941BE22328A21CB6A3A0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_16_POS_AnimGraphNode_ModifyBone_CE4AF84747FD941BE22328A21CB6A3A0(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/04/ABP_SKM_V_HAIR_16_POS.ABP_SKM_V_HAIR_16_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_16_POS_AnimGraphNode_ModifyBone_8761D4CF4131EF4E031D9AB9BD082D79
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_16_POS_AnimGraphNode_ModifyBone_8761D4CF4131EF4E031D9AB9BD082D79(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/04/ABP_SKM_V_HAIR_16_POS.ABP_SKM_V_HAIR_16_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_16_POS_AnimGraphNode_ModifyBone_FFE8F40B4CFD25981DE2A4AC9387FE92
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_16_POS_AnimGraphNode_ModifyBone_FFE8F40B4CFD25981DE2A4AC9387FE92(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/04/ABP_SKM_V_HAIR_16_POS.ABP_SKM_V_HAIR_16_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_16_POS_AnimGraphNode_ModifyBone_219EFFF5403A76FF5A0ACFBB4D6B12E2
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_16_POS_AnimGraphNode_ModifyBone_219EFFF5403A76FF5A0ACFBB4D6B12E2(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/04/ABP_SKM_V_HAIR_16_POS.ABP_SKM_V_HAIR_16_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_16_POS_AnimGraphNode_ModifyBone_7BA1C9A144E22FB57D6B2299B4E30CED
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_16_POS_AnimGraphNode_ModifyBone_7BA1C9A144E22FB57D6B2299B4E30CED(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/04/ABP_SKM_V_HAIR_16_POS.ABP_SKM_V_HAIR_16_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_16_POS_AnimGraphNode_ModifyBone_B6489567490504A2D0F7DABC651E14E5
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_16_POS_AnimGraphNode_ModifyBone_B6489567490504A2D0F7DABC651E14E5(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/04/ABP_SKM_V_HAIR_16_POS.ABP_SKM_V_HAIR_16_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_16_POS_AnimGraphNode_ModifyBone_A398A79B4C3FBF0B6BCAC0B051327ECC
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_16_POS_AnimGraphNode_ModifyBone_A398A79B4C3FBF0B6BCAC0B051327ECC(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/04/ABP_SKM_V_HAIR_16_POS.ABP_SKM_V_HAIR_16_POS_C.ExecuteUbergraph_ABP_SKM_V_HAIR_16_POS
	void ExecuteUbergraph_ABP_SKM_V_HAIR_16_POS(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Toreador/Male/Hair/03/ABP_VMP_TOR_M_HAIR_03.ABP_VMP_TOR_M_HAIR_03_C
/// Size: 0x1180 (0x0002C0 - 0x001440)
class UABP_VMP_TOR_M_HAIR_03_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x02C8   (0x0020)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02E8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x02F0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0730   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0B70   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0FB0   (0x0440)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x13F0   (0x0030)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x1420   (0x0020)  


	/// Functions
	// Function /Game/Characters/Vampire/Toreador/Male/Hair/03/ABP_VMP_TOR_M_HAIR_03.ABP_VMP_TOR_M_HAIR_03_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Toreador/Male/Hair/03/ABP_VMP_TOR_M_HAIR_03.ABP_VMP_TOR_M_HAIR_03_C.ExecuteUbergraph_ABP_VMP_TOR_M_HAIR_03
	void ExecuteUbergraph_ABP_VMP_TOR_M_HAIR_03(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Ventrue/Female/HAIR/04/ABP_SKM_V_HAIR_22_POS.ABP_SKM_V_HAIR_22_POS_C
/// Size: 0x1780 (0x000330 - 0x001AB0)
class UABP_SKM_V_HAIR_22_POS_C : public UTigerCharacterPoseableMeshAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0330   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0338   (0x0030)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0368   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0470   (0x0020)  
	FAnimNode_MeshSpaceRefPose                         AnimGraphNode_MeshRefPose;                                  // 0x0490   (0x0010)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x04A0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x05A8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x06B0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x07B8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x08C0   (0x0108)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x09C8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x09D0   (0x0440)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0E10   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0F18   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1020   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1128   (0x0108)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1230   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1670   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Ventrue/Female/HAIR/04/ABP_SKM_V_HAIR_22_POS.ABP_SKM_V_HAIR_22_POS_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Ventrue/Female/HAIR/04/ABP_SKM_V_HAIR_22_POS.ABP_SKM_V_HAIR_22_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_22_POS_AnimGraphNode_ModifyBone_6A98D9794368307D5CBEB288CCBB94CE
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_22_POS_AnimGraphNode_ModifyBone_6A98D9794368307D5CBEB288CCBB94CE(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Ventrue/Female/HAIR/04/ABP_SKM_V_HAIR_22_POS.ABP_SKM_V_HAIR_22_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_22_POS_AnimGraphNode_ModifyBone_4EC04F4646DE299A4833A588663E2648
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_22_POS_AnimGraphNode_ModifyBone_4EC04F4646DE299A4833A588663E2648(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Ventrue/Female/HAIR/04/ABP_SKM_V_HAIR_22_POS.ABP_SKM_V_HAIR_22_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_22_POS_AnimGraphNode_ModifyBone_8CD9371D48B4E6DF6F7AC381DA3B7534
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_22_POS_AnimGraphNode_ModifyBone_8CD9371D48B4E6DF6F7AC381DA3B7534(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Ventrue/Female/HAIR/04/ABP_SKM_V_HAIR_22_POS.ABP_SKM_V_HAIR_22_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_22_POS_AnimGraphNode_ModifyBone_ACBDCBF74EA2FF18F7B11F8568B2B6A1
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_22_POS_AnimGraphNode_ModifyBone_ACBDCBF74EA2FF18F7B11F8568B2B6A1(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Ventrue/Female/HAIR/04/ABP_SKM_V_HAIR_22_POS.ABP_SKM_V_HAIR_22_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_22_POS_AnimGraphNode_ModifyBone_352BCE7B4EB005C73BED89BA8D207653
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_22_POS_AnimGraphNode_ModifyBone_352BCE7B4EB005C73BED89BA8D207653(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Ventrue/Female/HAIR/04/ABP_SKM_V_HAIR_22_POS.ABP_SKM_V_HAIR_22_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_22_POS_AnimGraphNode_ModifyBone_2639C8804A5C4F9FF8A0438B382C209D
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_22_POS_AnimGraphNode_ModifyBone_2639C8804A5C4F9FF8A0438B382C209D(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Ventrue/Female/HAIR/04/ABP_SKM_V_HAIR_22_POS.ABP_SKM_V_HAIR_22_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_22_POS_AnimGraphNode_ModifyBone_208BB2B54919CE80DF894691C2082E98
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_22_POS_AnimGraphNode_ModifyBone_208BB2B54919CE80DF894691C2082E98(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Ventrue/Female/HAIR/04/ABP_SKM_V_HAIR_22_POS.ABP_SKM_V_HAIR_22_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_22_POS_AnimGraphNode_ModifyBone_31635ACE47C6F0D5B66082B369A6CD18
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_22_POS_AnimGraphNode_ModifyBone_31635ACE47C6F0D5B66082B369A6CD18(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Ventrue/Female/HAIR/04/ABP_SKM_V_HAIR_22_POS.ABP_SKM_V_HAIR_22_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_22_POS_AnimGraphNode_ModifyBone_0700398A4D6AD4793F69589F471AEB7A
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_22_POS_AnimGraphNode_ModifyBone_0700398A4D6AD4793F69589F471AEB7A(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Ventrue/Female/HAIR/04/ABP_SKM_V_HAIR_22_POS.ABP_SKM_V_HAIR_22_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_22_POS_AnimGraphNode_ModifyBone_F13547A74F13F6004062F1B2AE0B078E
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_22_POS_AnimGraphNode_ModifyBone_F13547A74F13F6004062F1B2AE0B078E(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Ventrue/Female/HAIR/04/ABP_SKM_V_HAIR_22_POS.ABP_SKM_V_HAIR_22_POS_C.ExecuteUbergraph_ABP_SKM_V_HAIR_22_POS
	void ExecuteUbergraph_ABP_SKM_V_HAIR_22_POS(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Brujah/Female/Hair/02/ABP_VMP_BRU_F_HAIR_02.ABP_VMP_BRU_F_HAIR_02_C
/// Size: 0x5140 (0x0002C0 - 0x005400)
class UABP_VMP_BRU_F_HAIR_02_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02F8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0300   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0740   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0B80   (0x0440)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0FC0   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0FE0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1420   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1860   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1CA0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x20E0   (0x0440)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x2520   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2540   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2980   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2DC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3200   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3640   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3A80   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3EC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x4300   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x4740   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x4B80   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x4FC0   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/02/ABP_VMP_BRU_F_HAIR_02.ABP_VMP_BRU_F_HAIR_02_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/02/ABP_VMP_BRU_F_HAIR_02.ABP_VMP_BRU_F_HAIR_02_C.ExecuteUbergraph_ABP_VMP_BRU_F_HAIR_02
	void ExecuteUbergraph_ABP_VMP_BRU_F_HAIR_02(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Brujah/Female/Hair/02/ABP_SKM_V_HAIR_02_POS.ABP_SKM_V_HAIR_02_POS_C
/// Size: 0x2880 (0x000330 - 0x002BB0)
class UABP_SKM_V_HAIR_02_POS_C : public UTigerCharacterPoseableMeshAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0330   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0338   (0x0030)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0368   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0470   (0x0020)  
	FAnimNode_MeshSpaceRefPose                         AnimGraphNode_MeshRefPose;                                  // 0x0490   (0x0010)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x04A0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x05A8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x06B0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x07B8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x08C0   (0x0108)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x09C8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x09D0   (0x0440)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0E10   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0F18   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1020   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1128   (0x0108)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1230   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1670   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1AB0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1EF0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2330   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2770   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/02/ABP_SKM_V_HAIR_02_POS.ABP_SKM_V_HAIR_02_POS_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/02/ABP_SKM_V_HAIR_02_POS.ABP_SKM_V_HAIR_02_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_02_POS_AnimGraphNode_ModifyBone_4B6441DD48B8C910A22D37AACC785F70
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_02_POS_AnimGraphNode_ModifyBone_4B6441DD48B8C910A22D37AACC785F70(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/02/ABP_SKM_V_HAIR_02_POS.ABP_SKM_V_HAIR_02_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_02_POS_AnimGraphNode_ModifyBone_91F5055B421FD8189E7800A4FABD316A
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_02_POS_AnimGraphNode_ModifyBone_91F5055B421FD8189E7800A4FABD316A(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/02/ABP_SKM_V_HAIR_02_POS.ABP_SKM_V_HAIR_02_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_02_POS_AnimGraphNode_ModifyBone_B38E082940D6641C46CFEF9C981383E5
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_02_POS_AnimGraphNode_ModifyBone_B38E082940D6641C46CFEF9C981383E5(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/02/ABP_SKM_V_HAIR_02_POS.ABP_SKM_V_HAIR_02_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_02_POS_AnimGraphNode_ModifyBone_BD1331A643C26112BC90B3BC6266FA94
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_02_POS_AnimGraphNode_ModifyBone_BD1331A643C26112BC90B3BC6266FA94(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/02/ABP_SKM_V_HAIR_02_POS.ABP_SKM_V_HAIR_02_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_02_POS_AnimGraphNode_ModifyBone_6D959A6A4C9A9849E264989676E48F7A
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_02_POS_AnimGraphNode_ModifyBone_6D959A6A4C9A9849E264989676E48F7A(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/02/ABP_SKM_V_HAIR_02_POS.ABP_SKM_V_HAIR_02_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_02_POS_AnimGraphNode_ModifyBone_0985F69F45A8F05BD11ECEA227294CEE
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_02_POS_AnimGraphNode_ModifyBone_0985F69F45A8F05BD11ECEA227294CEE(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/02/ABP_SKM_V_HAIR_02_POS.ABP_SKM_V_HAIR_02_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_02_POS_AnimGraphNode_ModifyBone_B16843AE4E26BEBF335F3CBE470753DE
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_02_POS_AnimGraphNode_ModifyBone_B16843AE4E26BEBF335F3CBE470753DE(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/02/ABP_SKM_V_HAIR_02_POS.ABP_SKM_V_HAIR_02_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_02_POS_AnimGraphNode_ModifyBone_80BCA50743B0B84E85F5CBA3D4EEEDB3
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_02_POS_AnimGraphNode_ModifyBone_80BCA50743B0B84E85F5CBA3D4EEEDB3(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/02/ABP_SKM_V_HAIR_02_POS.ABP_SKM_V_HAIR_02_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_02_POS_AnimGraphNode_ModifyBone_F5CE89AC430F9465BBA3CF9BB2164587
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_02_POS_AnimGraphNode_ModifyBone_F5CE89AC430F9465BBA3CF9BB2164587(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/02/ABP_SKM_V_HAIR_02_POS.ABP_SKM_V_HAIR_02_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_02_POS_AnimGraphNode_ModifyBone_D593904E44E8B2FD49BCB9B5282175AB
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_02_POS_AnimGraphNode_ModifyBone_D593904E44E8B2FD49BCB9B5282175AB(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/02/ABP_SKM_V_HAIR_02_POS.ABP_SKM_V_HAIR_02_POS_C.ExecuteUbergraph_ABP_SKM_V_HAIR_02_POS
	void ExecuteUbergraph_ABP_SKM_V_HAIR_02_POS(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Brujah/Male/Hair/11/ABP_VMP_BRU_M_HAIR.ABP_VMP_BRU_M_HAIR_11_C
/// Size: 0x5140 (0x0002C0 - 0x005400)
class UABP_VMP_BRU_M_HAIR_11_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02F8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0300   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0740   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0B80   (0x0440)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0FC0   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0FE0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1420   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1860   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1CA0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x20E0   (0x0440)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x2520   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2540   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2980   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2DC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3200   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3640   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3A80   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3EC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x4300   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x4740   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x4B80   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x4FC0   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/11/ABP_VMP_BRU_M_HAIR.ABP_VMP_BRU_M_HAIR_11_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/11/ABP_VMP_BRU_M_HAIR.ABP_VMP_BRU_M_HAIR_11_C.ExecuteUbergraph_ABP_VMP_BRU_M_HAIR
	void ExecuteUbergraph_ABP_VMP_BRU_M_HAIR(int32_t EntryPoint);                                                            // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Brujah/Female/Hair/04/ABP_SKM_V_HAIR_03_POS.ABP_SKM_V_HAIR_03_POS_C
/// Size: 0x3100 (0x000330 - 0x003430)
class UABP_SKM_V_HAIR_03_POS_C : public UTigerCharacterPoseableMeshAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0330   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0338   (0x0030)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0368   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0470   (0x0020)  
	FAnimNode_MeshSpaceRefPose                         AnimGraphNode_MeshRefPose;                                  // 0x0490   (0x0010)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x04A0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x05A8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x06B0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x07B8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x08C0   (0x0108)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x09C8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x09D0   (0x0440)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0E10   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0F18   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1020   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1128   (0x0108)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1230   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1670   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1AB0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1EF0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2330   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2770   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2BB0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2FF0   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/04/ABP_SKM_V_HAIR_03_POS.ABP_SKM_V_HAIR_03_POS_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/04/ABP_SKM_V_HAIR_03_POS.ABP_SKM_V_HAIR_03_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_03_POS_AnimGraphNode_ModifyBone_F60AB8E3482820A2DBF32A9FBE460740
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_03_POS_AnimGraphNode_ModifyBone_F60AB8E3482820A2DBF32A9FBE460740(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/04/ABP_SKM_V_HAIR_03_POS.ABP_SKM_V_HAIR_03_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_03_POS_AnimGraphNode_ModifyBone_A4A7BFD04073EA7E35BC628238872689
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_03_POS_AnimGraphNode_ModifyBone_A4A7BFD04073EA7E35BC628238872689(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/04/ABP_SKM_V_HAIR_03_POS.ABP_SKM_V_HAIR_03_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_03_POS_AnimGraphNode_ModifyBone_A49B6D304C21866A0FAECB92A85009E2
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_03_POS_AnimGraphNode_ModifyBone_A49B6D304C21866A0FAECB92A85009E2(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/04/ABP_SKM_V_HAIR_03_POS.ABP_SKM_V_HAIR_03_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_03_POS_AnimGraphNode_ModifyBone_62D4187D46DB522F4E12869909800CC9
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_03_POS_AnimGraphNode_ModifyBone_62D4187D46DB522F4E12869909800CC9(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/04/ABP_SKM_V_HAIR_03_POS.ABP_SKM_V_HAIR_03_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_03_POS_AnimGraphNode_ModifyBone_4F9261FA4AF9A20A4EF324B3C7A9B14F
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_03_POS_AnimGraphNode_ModifyBone_4F9261FA4AF9A20A4EF324B3C7A9B14F(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/04/ABP_SKM_V_HAIR_03_POS.ABP_SKM_V_HAIR_03_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_03_POS_AnimGraphNode_ModifyBone_2319CCBB47A39576C2CB5C81B297D9DE
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_03_POS_AnimGraphNode_ModifyBone_2319CCBB47A39576C2CB5C81B297D9DE(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/04/ABP_SKM_V_HAIR_03_POS.ABP_SKM_V_HAIR_03_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_03_POS_AnimGraphNode_ModifyBone_715B63584F21DD3112DCBEA67A4F9994
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_03_POS_AnimGraphNode_ModifyBone_715B63584F21DD3112DCBEA67A4F9994(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/04/ABP_SKM_V_HAIR_03_POS.ABP_SKM_V_HAIR_03_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_03_POS_AnimGraphNode_ModifyBone_58919BF04214255DC6AFE2831DDADDC9
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_03_POS_AnimGraphNode_ModifyBone_58919BF04214255DC6AFE2831DDADDC9(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/04/ABP_SKM_V_HAIR_03_POS.ABP_SKM_V_HAIR_03_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_03_POS_AnimGraphNode_ModifyBone_BF513BCB47E3AEE77C248DA3F2D38D77
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_03_POS_AnimGraphNode_ModifyBone_BF513BCB47E3AEE77C248DA3F2D38D77(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/04/ABP_SKM_V_HAIR_03_POS.ABP_SKM_V_HAIR_03_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_03_POS_AnimGraphNode_ModifyBone_5360704C477D38908DD4B3A6928D7676
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_03_POS_AnimGraphNode_ModifyBone_5360704C477D38908DD4B3A6928D7676(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/04/ABP_SKM_V_HAIR_03_POS.ABP_SKM_V_HAIR_03_POS_C.ExecuteUbergraph_ABP_SKM_V_HAIR_03_POS
	void ExecuteUbergraph_ABP_SKM_V_HAIR_03_POS(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Brujah/Male/Hair/14/ABP_VMP_BRU_M_HAIR.ABP_VMP_BRU_M_HAIR_14_C
/// Size: 0x4040 (0x0002C0 - 0x004300)
class UABP_VMP_BRU_M_HAIR_14_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02F8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0300   (0x0440)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0740   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0760   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0BA0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0FE0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1420   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1860   (0x0440)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x1CA0   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1CC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2100   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2540   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2980   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2DC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3200   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3640   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3A80   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3EC0   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/14/ABP_VMP_BRU_M_HAIR.ABP_VMP_BRU_M_HAIR_14_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/14/ABP_VMP_BRU_M_HAIR.ABP_VMP_BRU_M_HAIR_14_C.ExecuteUbergraph_ABP_VMP_BRU_M_HAIR
	void ExecuteUbergraph_ABP_VMP_BRU_M_HAIR(int32_t EntryPoint);                                                            // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Ventrue/Male/Hair/09/ABP_VMP_VEN_M_HAIR_09.ABP_VMP_VEN_M_HAIR_09_C
/// Size: 0x0900 (0x0002C0 - 0x000BC0)
class UABP_VMP_VEN_M_HAIR_09_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02F8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0300   (0x0440)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0740   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0760   (0x0440)  
	nil                                                AnimGraphNode_ComponentToLocalSpace;                        // 0x0BA0   (0x0020)  


	/// Functions
	// Function /Game/Characters/Vampire/Ventrue/Male/Hair/09/ABP_VMP_VEN_M_HAIR_09.ABP_VMP_VEN_M_HAIR_09_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Ventrue/Male/Hair/09/ABP_VMP_VEN_M_HAIR_09.ABP_VMP_VEN_M_HAIR_09_C.ExecuteUbergraph_ABP_VMP_VEN_M_HAIR_09
	void ExecuteUbergraph_ABP_VMP_VEN_M_HAIR_09(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Ventrue/Female/HAIR/01/ABP_VMP_VEN_F_HAIR_01.ABP_VMP_VEN_F_HAIR_01_C
/// Size: 0x0900 (0x0002C0 - 0x000BC0)
class UABP_VMP_VEN_F_HAIR_01_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02F8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0300   (0x0440)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0740   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0760   (0x0440)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0BA0   (0x0020)  


	/// Functions
	// Function /Game/Characters/Vampire/Ventrue/Female/HAIR/01/ABP_VMP_VEN_F_HAIR_01.ABP_VMP_VEN_F_HAIR_01_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Ventrue/Female/HAIR/01/ABP_VMP_VEN_F_HAIR_01.ABP_VMP_VEN_F_HAIR_01_C.ExecuteUbergraph_ABP_VMP_VEN_F_HAIR_01
	void ExecuteUbergraph_ABP_VMP_VEN_F_HAIR_01(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Brujah/Female/Hair/14/ABP_SKM_VMP_BRU_F_HAIR.ABP_SKM_VMP_BRU_F_HAIR_14_C
/// Size: 0x3380 (0x0002C0 - 0x003640)
class UABP_SKM_VMP_BRU_F_HAIR_14_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02F8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0300   (0x0440)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0740   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0760   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0780   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0BC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1000   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1440   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1880   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1CC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2100   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2540   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2980   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2DC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3200   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/14/ABP_SKM_VMP_BRU_F_HAIR.ABP_SKM_VMP_BRU_F_HAIR_14_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/14/ABP_SKM_VMP_BRU_F_HAIR.ABP_SKM_VMP_BRU_F_HAIR_14_C.ExecuteUbergraph_ABP_SKM_VMP_BRU_F_HAIR
	void ExecuteUbergraph_ABP_SKM_VMP_BRU_F_HAIR(int32_t EntryPoint);                                                        // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Brujah/Female/Hair/14/ABP_SKM_V_HAIR_08_POS.ABP_SKM_V_HAIR_08_POS_C
/// Size: 0x3DC0 (0x000330 - 0x0040F0)
class UABP_SKM_V_HAIR_08_POS_C : public UTigerCharacterPoseableMeshAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0330   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0338   (0x0030)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0368   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0470   (0x0020)  
	FAnimNode_MeshSpaceRefPose                         AnimGraphNode_MeshRefPose;                                  // 0x0490   (0x0010)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x04A0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x05A8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x06B0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x07B8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x08C0   (0x0108)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x09C8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x09D0   (0x0440)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0E10   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0F18   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1020   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1128   (0x0108)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1230   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1670   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1AB0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1EF0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2330   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2770   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2BB0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2FF0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3430   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3870   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3CB0   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/14/ABP_SKM_V_HAIR_08_POS.ABP_SKM_V_HAIR_08_POS_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/14/ABP_SKM_V_HAIR_08_POS.ABP_SKM_V_HAIR_08_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_08_POS_AnimGraphNode_ModifyBone_BAB2E6F14ED901067667E3B5408E12DA
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_08_POS_AnimGraphNode_ModifyBone_BAB2E6F14ED901067667E3B5408E12DA(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/14/ABP_SKM_V_HAIR_08_POS.ABP_SKM_V_HAIR_08_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_08_POS_AnimGraphNode_ModifyBone_3EDCF8F74426443A067995B2E961A51A
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_08_POS_AnimGraphNode_ModifyBone_3EDCF8F74426443A067995B2E961A51A(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/14/ABP_SKM_V_HAIR_08_POS.ABP_SKM_V_HAIR_08_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_08_POS_AnimGraphNode_ModifyBone_07056B8340DF8F9EABFA81B7F4C34A15
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_08_POS_AnimGraphNode_ModifyBone_07056B8340DF8F9EABFA81B7F4C34A15(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/14/ABP_SKM_V_HAIR_08_POS.ABP_SKM_V_HAIR_08_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_08_POS_AnimGraphNode_ModifyBone_18CF709D4E4FB4A431BABEA5415C22CE
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_08_POS_AnimGraphNode_ModifyBone_18CF709D4E4FB4A431BABEA5415C22CE(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/14/ABP_SKM_V_HAIR_08_POS.ABP_SKM_V_HAIR_08_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_08_POS_AnimGraphNode_ModifyBone_BA90EB4A42886522116DF2A7542BBC91
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_08_POS_AnimGraphNode_ModifyBone_BA90EB4A42886522116DF2A7542BBC91(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/14/ABP_SKM_V_HAIR_08_POS.ABP_SKM_V_HAIR_08_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_08_POS_AnimGraphNode_ModifyBone_CDF57EAA430CEC0FF547C7908F7512F9
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_08_POS_AnimGraphNode_ModifyBone_CDF57EAA430CEC0FF547C7908F7512F9(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/14/ABP_SKM_V_HAIR_08_POS.ABP_SKM_V_HAIR_08_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_08_POS_AnimGraphNode_ModifyBone_DFC9A66344A57EF6437C01AAD039097D
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_08_POS_AnimGraphNode_ModifyBone_DFC9A66344A57EF6437C01AAD039097D(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/14/ABP_SKM_V_HAIR_08_POS.ABP_SKM_V_HAIR_08_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_08_POS_AnimGraphNode_ModifyBone_4BCE15904F6A0EF902C33EB0AF0F9069
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_08_POS_AnimGraphNode_ModifyBone_4BCE15904F6A0EF902C33EB0AF0F9069(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/14/ABP_SKM_V_HAIR_08_POS.ABP_SKM_V_HAIR_08_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_08_POS_AnimGraphNode_ModifyBone_768AF9574D368AE9BF31BEB24478C85E
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_08_POS_AnimGraphNode_ModifyBone_768AF9574D368AE9BF31BEB24478C85E(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/14/ABP_SKM_V_HAIR_08_POS.ABP_SKM_V_HAIR_08_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_08_POS_AnimGraphNode_ModifyBone_312F539646B84D6B95E14D9DF45E83C9
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_08_POS_AnimGraphNode_ModifyBone_312F539646B84D6B95E14D9DF45E83C9(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/14/ABP_SKM_V_HAIR_08_POS.ABP_SKM_V_HAIR_08_POS_C.ExecuteUbergraph_ABP_SKM_V_HAIR_08_POS
	void ExecuteUbergraph_ABP_SKM_V_HAIR_08_POS(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Brujah/Male/Hair/01/ABP_VMP_BRU_M_HAIR_01.ABP_VMP_BRU_M_HAIR_01_C
/// Size: 0x3380 (0x0002C0 - 0x003640)
class UABP_VMP_BRU_M_HAIR_01_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02F8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0300   (0x0440)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0740   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0760   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0780   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0BC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1000   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1440   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1880   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1CC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2100   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2540   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2980   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2DC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3200   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/01/ABP_VMP_BRU_M_HAIR_01.ABP_VMP_BRU_M_HAIR_01_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/01/ABP_VMP_BRU_M_HAIR_01.ABP_VMP_BRU_M_HAIR_01_C.ExecuteUbergraph_ABP_VMP_BRU_M_HAIR_01
	void ExecuteUbergraph_ABP_VMP_BRU_M_HAIR_01(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Ventrue/Male/Hair/06/ABP_SKM_VEN_M_HAIR_06_POS.ABP_SKM_VEN_M_HAIR_06_POS_C
/// Size: 0x2880 (0x000330 - 0x002BB0)
class UABP_SKM_VEN_M_HAIR_06_POS_C : public UTigerCharacterPoseableMeshAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0330   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0338   (0x0030)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0368   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0470   (0x0020)  
	FAnimNode_MeshSpaceRefPose                         AnimGraphNode_MeshRefPose;                                  // 0x0490   (0x0010)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x04A0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x05A8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x06B0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x07B8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x08C0   (0x0108)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x09C8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x09D0   (0x0440)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0E10   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0F18   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1020   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1128   (0x0108)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1230   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1670   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1AB0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1EF0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2330   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2770   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Ventrue/Male/Hair/06/ABP_SKM_VEN_M_HAIR_06_POS.ABP_SKM_VEN_M_HAIR_06_POS_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Ventrue/Male/Hair/06/ABP_SKM_VEN_M_HAIR_06_POS.ABP_SKM_VEN_M_HAIR_06_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_VEN_M_HAIR_06_POS_AnimGraphNode_ModifyBone_E1183EEC4A9D05D7765A5CADB950CE21
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_VEN_M_HAIR_06_POS_AnimGraphNode_ModifyBone_E1183EEC4A9D05D7765A5CADB950CE21(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Ventrue/Male/Hair/06/ABP_SKM_VEN_M_HAIR_06_POS.ABP_SKM_VEN_M_HAIR_06_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_VEN_M_HAIR_06_POS_AnimGraphNode_ModifyBone_667FA1F44C58EC57468793AC20683C7A
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_VEN_M_HAIR_06_POS_AnimGraphNode_ModifyBone_667FA1F44C58EC57468793AC20683C7A(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Ventrue/Male/Hair/06/ABP_SKM_VEN_M_HAIR_06_POS.ABP_SKM_VEN_M_HAIR_06_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_VEN_M_HAIR_06_POS_AnimGraphNode_ModifyBone_3B96BDC94AFC8D20C2769EA9564CB364
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_VEN_M_HAIR_06_POS_AnimGraphNode_ModifyBone_3B96BDC94AFC8D20C2769EA9564CB364(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Ventrue/Male/Hair/06/ABP_SKM_VEN_M_HAIR_06_POS.ABP_SKM_VEN_M_HAIR_06_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_VEN_M_HAIR_06_POS_AnimGraphNode_ModifyBone_411EA6994118F24A039EB89179CF0B84
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_VEN_M_HAIR_06_POS_AnimGraphNode_ModifyBone_411EA6994118F24A039EB89179CF0B84(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Ventrue/Male/Hair/06/ABP_SKM_VEN_M_HAIR_06_POS.ABP_SKM_VEN_M_HAIR_06_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_VEN_M_HAIR_06_POS_AnimGraphNode_ModifyBone_D61E9B2F42D6B1B1ACCD8187EE3A649C
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_VEN_M_HAIR_06_POS_AnimGraphNode_ModifyBone_D61E9B2F42D6B1B1ACCD8187EE3A649C(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Ventrue/Male/Hair/06/ABP_SKM_VEN_M_HAIR_06_POS.ABP_SKM_VEN_M_HAIR_06_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_VEN_M_HAIR_06_POS_AnimGraphNode_ModifyBone_5C93DF9A4D037FDAAFBCB6923146C14F
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_VEN_M_HAIR_06_POS_AnimGraphNode_ModifyBone_5C93DF9A4D037FDAAFBCB6923146C14F(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Ventrue/Male/Hair/06/ABP_SKM_VEN_M_HAIR_06_POS.ABP_SKM_VEN_M_HAIR_06_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_VEN_M_HAIR_06_POS_AnimGraphNode_ModifyBone_D7D2ABEC4BFB426F66A671A6B0AC0781
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_VEN_M_HAIR_06_POS_AnimGraphNode_ModifyBone_D7D2ABEC4BFB426F66A671A6B0AC0781(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Ventrue/Male/Hair/06/ABP_SKM_VEN_M_HAIR_06_POS.ABP_SKM_VEN_M_HAIR_06_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_VEN_M_HAIR_06_POS_AnimGraphNode_ModifyBone_FA5FAFF5495D9AFD9E3D8BAFA2E90BBD
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_VEN_M_HAIR_06_POS_AnimGraphNode_ModifyBone_FA5FAFF5495D9AFD9E3D8BAFA2E90BBD(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Ventrue/Male/Hair/06/ABP_SKM_VEN_M_HAIR_06_POS.ABP_SKM_VEN_M_HAIR_06_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_VEN_M_HAIR_06_POS_AnimGraphNode_ModifyBone_4D0824354A50C3126AE7FB9476E27D91
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_VEN_M_HAIR_06_POS_AnimGraphNode_ModifyBone_4D0824354A50C3126AE7FB9476E27D91(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Ventrue/Male/Hair/06/ABP_SKM_VEN_M_HAIR_06_POS.ABP_SKM_VEN_M_HAIR_06_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_VEN_M_HAIR_06_POS_AnimGraphNode_ModifyBone_B0710181438756DC5903F7A93F40241E
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_VEN_M_HAIR_06_POS_AnimGraphNode_ModifyBone_B0710181438756DC5903F7A93F40241E(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Ventrue/Male/Hair/06/ABP_SKM_VEN_M_HAIR_06_POS.ABP_SKM_VEN_M_HAIR_06_POS_C.ExecuteUbergraph_ABP_SKM_VEN_M_HAIR_06_POS
	void ExecuteUbergraph_ABP_SKM_VEN_M_HAIR_06_POS(int32_t EntryPoint);                                                     // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Ventrue/Male/Hair/06/ABP_VMP_VEN_M_HAIR_06.ABP_VMP_VEN_M_HAIR_06_C
/// Size: 0x37C0 (0x0002C0 - 0x003A80)
class UABP_VMP_VEN_M_HAIR_06_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02F8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0300   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0740   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0B80   (0x0440)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0FC0   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0FE0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1420   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1860   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1CA0   (0x0440)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x20E0   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2100   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2540   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2980   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2DC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3200   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3640   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Ventrue/Male/Hair/06/ABP_VMP_VEN_M_HAIR_06.ABP_VMP_VEN_M_HAIR_06_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Ventrue/Male/Hair/06/ABP_VMP_VEN_M_HAIR_06.ABP_VMP_VEN_M_HAIR_06_C.ExecuteUbergraph_ABP_VMP_VEN_M_HAIR_06
	void ExecuteUbergraph_ABP_VMP_VEN_M_HAIR_06(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Toreador/Female/Hair/03/ABP_VMP_TOR_F_HAIR_03.ABP_VMP_TOR_F_HAIR_03_C
/// Size: 0x4480 (0x0002C0 - 0x004740)
class UABP_VMP_TOR_F_HAIR_03_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02F8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0300   (0x0440)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0740   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0760   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0780   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0BC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1000   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1440   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1880   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1CC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2100   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2540   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2980   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2DC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3200   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3640   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3A80   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3EC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x4300   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/03/ABP_VMP_TOR_F_HAIR_03.ABP_VMP_TOR_F_HAIR_03_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/03/ABP_VMP_TOR_F_HAIR_03.ABP_VMP_TOR_F_HAIR_03_C.ExecuteUbergraph_ABP_VMP_TOR_F_HAIR_03
	void ExecuteUbergraph_ABP_VMP_TOR_F_HAIR_03(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Ventrue/Male/Hair/11/ABP_VMP_VEN_M_HAIR.ABP_VMP_VEN_M_HAIR_11_C
/// Size: 0x37C0 (0x0002C0 - 0x003A80)
class UABP_VMP_VEN_M_HAIR_11_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02C8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x02D0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0710   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0B50   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0F90   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x13D0   (0x0440)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x1810   (0x0020)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x1830   (0x0030)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1860   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1CA0   (0x0440)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x20E0   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2100   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2540   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2980   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2DC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3200   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3640   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Ventrue/Male/Hair/11/ABP_VMP_VEN_M_HAIR.ABP_VMP_VEN_M_HAIR_11_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Ventrue/Male/Hair/11/ABP_VMP_VEN_M_HAIR.ABP_VMP_VEN_M_HAIR_11_C.ExecuteUbergraph_ABP_VMP_VEN_M_HAIR
	void ExecuteUbergraph_ABP_VMP_VEN_M_HAIR(int32_t EntryPoint);                                                            // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Ventrue/Female/HAIR/23/ABP_VMP_VEN_F_HAIR.ABP_VMP_VEN_F_HAIR_23_C
/// Size: 0x2F40 (0x0002C0 - 0x003200)
class UABP_VMP_VEN_F_HAIR_23_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02C8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x02D0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0710   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0B50   (0x0440)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0F90   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0FB0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x13F0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1830   (0x0440)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x1C70   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1C90   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x20D0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2510   (0x0440)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x2950   (0x0030)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2980   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2DC0   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Ventrue/Female/HAIR/23/ABP_VMP_VEN_F_HAIR.ABP_VMP_VEN_F_HAIR_23_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Ventrue/Female/HAIR/23/ABP_VMP_VEN_F_HAIR.ABP_VMP_VEN_F_HAIR_23_C.ExecuteUbergraph_ABP_VMP_VEN_F_HAIR
	void ExecuteUbergraph_ABP_VMP_VEN_F_HAIR(int32_t EntryPoint);                                                            // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Ventrue/Male/Hair/23/ABP_VEN_M_HAIR.ABP_VEN_M_HAIR_23_C
/// Size: 0x2F40 (0x0002C0 - 0x003200)
class UABP_VEN_M_HAIR_23_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02F8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0300   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0740   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0B80   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0FC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1400   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1840   (0x0440)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x1C80   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x1CA0   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1CC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2100   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2540   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2980   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2DC0   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Ventrue/Male/Hair/23/ABP_VEN_M_HAIR.ABP_VEN_M_HAIR_23_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Ventrue/Male/Hair/23/ABP_VEN_M_HAIR.ABP_VEN_M_HAIR_23_C.ExecuteUbergraph_ABP_VEN_M_HAIR
	void ExecuteUbergraph_ABP_VEN_M_HAIR(int32_t EntryPoint);                                                                // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Ventrue/Female/HAIR/08/ABP_SKM_V_HAIR_24_POS.ABP_SKM_V_HAIR_24_POS_C
/// Size: 0x2CC0 (0x000330 - 0x002FF0)
class UABP_SKM_V_HAIR_24_POS_C : public UTigerCharacterPoseableMeshAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0330   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0338   (0x0030)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0368   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0470   (0x0020)  
	FAnimNode_MeshSpaceRefPose                         AnimGraphNode_MeshRefPose;                                  // 0x0490   (0x0010)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x04A0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x05A8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x06B0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x07B8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x08C0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x09C8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0AD0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0BD8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0CE0   (0x0108)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x0DE8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0DF0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1230   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1670   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1AB0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1EF0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2330   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2770   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2BB0   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Ventrue/Female/HAIR/08/ABP_SKM_V_HAIR_24_POS.ABP_SKM_V_HAIR_24_POS_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Ventrue/Female/HAIR/08/ABP_SKM_V_HAIR_24_POS.ABP_SKM_V_HAIR_24_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_24_POS_AnimGraphNode_ModifyBone_896BD7F743ECCF56FD3E6B893D708DA8
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_24_POS_AnimGraphNode_ModifyBone_896BD7F743ECCF56FD3E6B893D708DA8(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Ventrue/Female/HAIR/08/ABP_SKM_V_HAIR_24_POS.ABP_SKM_V_HAIR_24_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_24_POS_AnimGraphNode_ModifyBone_5A11CBE84336FCB3C8DC778D5803271F
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_24_POS_AnimGraphNode_ModifyBone_5A11CBE84336FCB3C8DC778D5803271F(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Ventrue/Female/HAIR/08/ABP_SKM_V_HAIR_24_POS.ABP_SKM_V_HAIR_24_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_24_POS_AnimGraphNode_ModifyBone_6FB82FDF4F64815284CFF3A531C05B17
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_24_POS_AnimGraphNode_ModifyBone_6FB82FDF4F64815284CFF3A531C05B17(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Ventrue/Female/HAIR/08/ABP_SKM_V_HAIR_24_POS.ABP_SKM_V_HAIR_24_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_24_POS_AnimGraphNode_ModifyBone_200E64F24992F9F1FD7306A1CF276BBC
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_24_POS_AnimGraphNode_ModifyBone_200E64F24992F9F1FD7306A1CF276BBC(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Ventrue/Female/HAIR/08/ABP_SKM_V_HAIR_24_POS.ABP_SKM_V_HAIR_24_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_24_POS_AnimGraphNode_ModifyBone_B2A8CF5041850F7B4E165B9ED8F0C631
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_24_POS_AnimGraphNode_ModifyBone_B2A8CF5041850F7B4E165B9ED8F0C631(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Ventrue/Female/HAIR/08/ABP_SKM_V_HAIR_24_POS.ABP_SKM_V_HAIR_24_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_24_POS_AnimGraphNode_ModifyBone_B8C7291144181F5265B3E18E34591205
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_24_POS_AnimGraphNode_ModifyBone_B8C7291144181F5265B3E18E34591205(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Ventrue/Female/HAIR/08/ABP_SKM_V_HAIR_24_POS.ABP_SKM_V_HAIR_24_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_24_POS_AnimGraphNode_ModifyBone_5BB9F1B448797F249A0864AF90EBC607
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_24_POS_AnimGraphNode_ModifyBone_5BB9F1B448797F249A0864AF90EBC607(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Ventrue/Female/HAIR/08/ABP_SKM_V_HAIR_24_POS.ABP_SKM_V_HAIR_24_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_24_POS_AnimGraphNode_ModifyBone_6297037B4D04C2A0333A37AD1C6A5287
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_24_POS_AnimGraphNode_ModifyBone_6297037B4D04C2A0333A37AD1C6A5287(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Ventrue/Female/HAIR/08/ABP_SKM_V_HAIR_24_POS.ABP_SKM_V_HAIR_24_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_24_POS_AnimGraphNode_ModifyBone_219A84D24F03B9929AF77E8DA0F00439
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_24_POS_AnimGraphNode_ModifyBone_219A84D24F03B9929AF77E8DA0F00439(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Ventrue/Female/HAIR/08/ABP_SKM_V_HAIR_24_POS.ABP_SKM_V_HAIR_24_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_24_POS_AnimGraphNode_ModifyBone_F2BBFD6745A677AE839AF9960612C505
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_24_POS_AnimGraphNode_ModifyBone_F2BBFD6745A677AE839AF9960612C505(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Ventrue/Female/HAIR/08/ABP_SKM_V_HAIR_24_POS.ABP_SKM_V_HAIR_24_POS_C.ExecuteUbergraph_ABP_SKM_V_HAIR_24_POS
	void ExecuteUbergraph_ABP_SKM_V_HAIR_24_POS(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Ventrue/Female/HAIR/08/ABP_VMP_VEN_F_HAIR_08.ABP_VMP_VEN_F_HAIR_08_C
/// Size: 0x26C0 (0x0002C0 - 0x002980)
class UABP_VMP_VEN_F_HAIR_08_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02F8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0300   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0740   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0B80   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0FC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1400   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1840   (0x0440)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x1C80   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x1CA0   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1CC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2100   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2540   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Ventrue/Female/HAIR/08/ABP_VMP_VEN_F_HAIR_08.ABP_VMP_VEN_F_HAIR_08_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Ventrue/Female/HAIR/08/ABP_VMP_VEN_F_HAIR_08.ABP_VMP_VEN_F_HAIR_08_C.ExecuteUbergraph_ABP_VMP_VEN_F_HAIR_08
	void ExecuteUbergraph_ABP_VMP_VEN_F_HAIR_08(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Nosferatu/Male/Hair/05/ABP_VMP_NOS_M_HAIR_05.ABP_VMP_NOS_M_HAIR_05_C
/// Size: 0x3380 (0x0002C0 - 0x003640)
class UABP_VMP_NOS_M_HAIR_05_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02C8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x02D0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0710   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0B50   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0F90   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x13D0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1810   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1C50   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2090   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x24D0   (0x0440)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x2910   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x2930   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2950   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2D90   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x31D0   (0x0440)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x3610   (0x0030)  


	/// Functions
	// Function /Game/Characters/Vampire/Nosferatu/Male/Hair/05/ABP_VMP_NOS_M_HAIR_05.ABP_VMP_NOS_M_HAIR_05_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Nosferatu/Male/Hair/05/ABP_VMP_NOS_M_HAIR_05.ABP_VMP_NOS_M_HAIR_05_C.ExecuteUbergraph_ABP_VMP_NOS_M_HAIR_05
	void ExecuteUbergraph_ABP_VMP_NOS_M_HAIR_05(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Nosferatu/Female/Hair/04/ABP_SKM_V_HAIR_12_POS.ABP_SKM_V_HAIR_12_POS_C
/// Size: 0x2880 (0x000330 - 0x002BB0)
class UABP_SKM_V_HAIR_12_POS_C : public UTigerCharacterPoseableMeshAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0330   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0338   (0x0030)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0368   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0470   (0x0020)  
	FAnimNode_MeshSpaceRefPose                         AnimGraphNode_MeshRefPose;                                  // 0x0490   (0x0010)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x04A0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x05A8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x06B0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x07B8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x08C0   (0x0108)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x09C8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x09D0   (0x0440)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0E10   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0F18   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1020   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1128   (0x0108)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1230   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1670   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1AB0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1EF0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2330   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2770   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Nosferatu/Female/Hair/04/ABP_SKM_V_HAIR_12_POS.ABP_SKM_V_HAIR_12_POS_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Nosferatu/Female/Hair/04/ABP_SKM_V_HAIR_12_POS.ABP_SKM_V_HAIR_12_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_12_POS_AnimGraphNode_ModifyBone_4044A51A45FC654ADC8CA7B93EE2390F
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_12_POS_AnimGraphNode_ModifyBone_4044A51A45FC654ADC8CA7B93EE2390F(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Nosferatu/Female/Hair/04/ABP_SKM_V_HAIR_12_POS.ABP_SKM_V_HAIR_12_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_12_POS_AnimGraphNode_ModifyBone_EBCB42FB4171B0B9D231228369142D43
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_12_POS_AnimGraphNode_ModifyBone_EBCB42FB4171B0B9D231228369142D43(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Nosferatu/Female/Hair/04/ABP_SKM_V_HAIR_12_POS.ABP_SKM_V_HAIR_12_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_12_POS_AnimGraphNode_ModifyBone_900BF33A4FF7D3625DFBA2891D452898
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_12_POS_AnimGraphNode_ModifyBone_900BF33A4FF7D3625DFBA2891D452898(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Nosferatu/Female/Hair/04/ABP_SKM_V_HAIR_12_POS.ABP_SKM_V_HAIR_12_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_12_POS_AnimGraphNode_ModifyBone_A1C02831498AC1BF02803DB8D0EADD95
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_12_POS_AnimGraphNode_ModifyBone_A1C02831498AC1BF02803DB8D0EADD95(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Nosferatu/Female/Hair/04/ABP_SKM_V_HAIR_12_POS.ABP_SKM_V_HAIR_12_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_12_POS_AnimGraphNode_ModifyBone_C2982A1C4D59112D560D0DAAB04F78D9
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_12_POS_AnimGraphNode_ModifyBone_C2982A1C4D59112D560D0DAAB04F78D9(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Nosferatu/Female/Hair/04/ABP_SKM_V_HAIR_12_POS.ABP_SKM_V_HAIR_12_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_12_POS_AnimGraphNode_ModifyBone_682F76B24EA96F9CF1E7B79EB8E74F91
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_12_POS_AnimGraphNode_ModifyBone_682F76B24EA96F9CF1E7B79EB8E74F91(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Nosferatu/Female/Hair/04/ABP_SKM_V_HAIR_12_POS.ABP_SKM_V_HAIR_12_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_12_POS_AnimGraphNode_ModifyBone_894CCA694312FDB58F7BE99E07C18BC0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_12_POS_AnimGraphNode_ModifyBone_894CCA694312FDB58F7BE99E07C18BC0(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Nosferatu/Female/Hair/04/ABP_SKM_V_HAIR_12_POS.ABP_SKM_V_HAIR_12_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_12_POS_AnimGraphNode_ModifyBone_B45014A9442CF19BCD090D8D0B600CE9
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_12_POS_AnimGraphNode_ModifyBone_B45014A9442CF19BCD090D8D0B600CE9(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Nosferatu/Female/Hair/04/ABP_SKM_V_HAIR_12_POS.ABP_SKM_V_HAIR_12_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_12_POS_AnimGraphNode_ModifyBone_F88EE9E44FC0FBD8E04498A299015AA2
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_12_POS_AnimGraphNode_ModifyBone_F88EE9E44FC0FBD8E04498A299015AA2(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Nosferatu/Female/Hair/04/ABP_SKM_V_HAIR_12_POS.ABP_SKM_V_HAIR_12_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_12_POS_AnimGraphNode_ModifyBone_FDB457B2445F84D929E94F96FF4B3E1F
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_12_POS_AnimGraphNode_ModifyBone_FDB457B2445F84D929E94F96FF4B3E1F(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Nosferatu/Female/Hair/04/ABP_SKM_V_HAIR_12_POS.ABP_SKM_V_HAIR_12_POS_C.ExecuteUbergraph_ABP_SKM_V_HAIR_12_POS
	void ExecuteUbergraph_ABP_SKM_V_HAIR_12_POS(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Nosferatu/Female/Hair/04/ABP_VMP_NOS_F_HAIR_04.ABP_VMP_NOS_F_HAIR_04_C
/// Size: 0x2F40 (0x0002C0 - 0x003200)
class UABP_VMP_NOS_F_HAIR_04_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02C8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x02D0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0710   (0x0440)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0B50   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0B70   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0B90   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0FD0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1410   (0x0440)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x1850   (0x0030)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1880   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1CC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2100   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2540   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2980   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2DC0   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Nosferatu/Female/Hair/04/ABP_VMP_NOS_F_HAIR_04.ABP_VMP_NOS_F_HAIR_04_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Nosferatu/Female/Hair/04/ABP_VMP_NOS_F_HAIR_04.ABP_VMP_NOS_F_HAIR_04_C.ExecuteUbergraph_ABP_VMP_NOS_F_HAIR_04
	void ExecuteUbergraph_ABP_VMP_NOS_F_HAIR_04(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Nosferatu/Female/Hair/02/ABP_VMP_NOS_F_HAIR_02.ABP_VMP_NOS_F_HAIR_02_C
/// Size: 0x3380 (0x0002C0 - 0x003640)
class UABP_VMP_NOS_F_HAIR_02_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02F8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0300   (0x0440)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0740   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0760   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0780   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0BC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1000   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1440   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1880   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1CC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2100   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2540   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2980   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2DC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3200   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Nosferatu/Female/Hair/02/ABP_VMP_NOS_F_HAIR_02.ABP_VMP_NOS_F_HAIR_02_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Nosferatu/Female/Hair/02/ABP_VMP_NOS_F_HAIR_02.ABP_VMP_NOS_F_HAIR_02_C.ExecuteUbergraph_ABP_VMP_NOS_F_HAIR_02
	void ExecuteUbergraph_ABP_VMP_NOS_F_HAIR_02(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Nosferatu/Female/Hair/02/ABP_SKM_V_HAIR_11_POS.ABP_SKM_V_HAIR_11_POS_C
/// Size: 0x2CC0 (0x000330 - 0x002FF0)
class UABP_SKM_V_HAIR_11_POS_C : public UTigerCharacterPoseableMeshAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0330   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0338   (0x0030)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0368   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0470   (0x0020)  
	FAnimNode_MeshSpaceRefPose                         AnimGraphNode_MeshRefPose;                                  // 0x0490   (0x0010)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x04A0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x05A8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x06B0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x07B8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x08C0   (0x0108)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x09C8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x09D0   (0x0440)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0E10   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0F18   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1020   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1128   (0x0108)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1230   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1670   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1AB0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1EF0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2330   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2770   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2BB0   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Nosferatu/Female/Hair/02/ABP_SKM_V_HAIR_11_POS.ABP_SKM_V_HAIR_11_POS_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Nosferatu/Female/Hair/02/ABP_SKM_V_HAIR_11_POS.ABP_SKM_V_HAIR_11_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_11_POS_AnimGraphNode_ModifyBone_D49AA9A643823F03448EDB8148CD730C
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_11_POS_AnimGraphNode_ModifyBone_D49AA9A643823F03448EDB8148CD730C(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Nosferatu/Female/Hair/02/ABP_SKM_V_HAIR_11_POS.ABP_SKM_V_HAIR_11_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_11_POS_AnimGraphNode_ModifyBone_BEE948484C77F1B231454C91216BF9ED
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_11_POS_AnimGraphNode_ModifyBone_BEE948484C77F1B231454C91216BF9ED(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Nosferatu/Female/Hair/02/ABP_SKM_V_HAIR_11_POS.ABP_SKM_V_HAIR_11_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_11_POS_AnimGraphNode_ModifyBone_D9B72D2448962A1CAF2E7D8905662FBD
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_11_POS_AnimGraphNode_ModifyBone_D9B72D2448962A1CAF2E7D8905662FBD(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Nosferatu/Female/Hair/02/ABP_SKM_V_HAIR_11_POS.ABP_SKM_V_HAIR_11_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_11_POS_AnimGraphNode_ModifyBone_C6A5F0CD43A0D3EEEA2523B5637789A0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_11_POS_AnimGraphNode_ModifyBone_C6A5F0CD43A0D3EEEA2523B5637789A0(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Nosferatu/Female/Hair/02/ABP_SKM_V_HAIR_11_POS.ABP_SKM_V_HAIR_11_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_11_POS_AnimGraphNode_ModifyBone_76BD9A27440A5AC8A3CB2A89C9165CCE
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_11_POS_AnimGraphNode_ModifyBone_76BD9A27440A5AC8A3CB2A89C9165CCE(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Nosferatu/Female/Hair/02/ABP_SKM_V_HAIR_11_POS.ABP_SKM_V_HAIR_11_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_11_POS_AnimGraphNode_ModifyBone_68A5777346CEAD0C63957FAE8574E392
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_11_POS_AnimGraphNode_ModifyBone_68A5777346CEAD0C63957FAE8574E392(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Nosferatu/Female/Hair/02/ABP_SKM_V_HAIR_11_POS.ABP_SKM_V_HAIR_11_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_11_POS_AnimGraphNode_ModifyBone_ACB02D0446F62CAF35399C90AA12D951
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_11_POS_AnimGraphNode_ModifyBone_ACB02D0446F62CAF35399C90AA12D951(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Nosferatu/Female/Hair/02/ABP_SKM_V_HAIR_11_POS.ABP_SKM_V_HAIR_11_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_11_POS_AnimGraphNode_ModifyBone_A5FF18A74D3740F231D399A224A5567B
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_11_POS_AnimGraphNode_ModifyBone_A5FF18A74D3740F231D399A224A5567B(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Nosferatu/Female/Hair/02/ABP_SKM_V_HAIR_11_POS.ABP_SKM_V_HAIR_11_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_11_POS_AnimGraphNode_ModifyBone_F3295651458C53CF5248C1BE3C720ABF
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_11_POS_AnimGraphNode_ModifyBone_F3295651458C53CF5248C1BE3C720ABF(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Nosferatu/Female/Hair/02/ABP_SKM_V_HAIR_11_POS.ABP_SKM_V_HAIR_11_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_11_POS_AnimGraphNode_ModifyBone_A5E5ED49489D0DCB9EE329945945D7F0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_11_POS_AnimGraphNode_ModifyBone_A5E5ED49489D0DCB9EE329945945D7F0(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Nosferatu/Female/Hair/02/ABP_SKM_V_HAIR_11_POS.ABP_SKM_V_HAIR_11_POS_C.ExecuteUbergraph_ABP_SKM_V_HAIR_11_POS
	void ExecuteUbergraph_ABP_SKM_V_HAIR_11_POS(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Nosferatu/Male/Hair/06/ABP_VMP_NOS_M_HAIR_06.ABP_VMP_NOS_M_HAIR_06_C
/// Size: 0x3380 (0x0002C0 - 0x003640)
class UABP_VMP_NOS_M_HAIR_06_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02F8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0300   (0x0440)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0740   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0760   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0780   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0BC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1000   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1440   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1880   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1CC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2100   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2540   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2980   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2DC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3200   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Nosferatu/Male/Hair/06/ABP_VMP_NOS_M_HAIR_06.ABP_VMP_NOS_M_HAIR_06_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Nosferatu/Male/Hair/06/ABP_VMP_NOS_M_HAIR_06.ABP_VMP_NOS_M_HAIR_06_C.ExecuteUbergraph_ABP_VMP_NOS_M_HAIR_06
	void ExecuteUbergraph_ABP_VMP_NOS_M_HAIR_06(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Brujah/Male/Hair/12/ABP_VMP_BRU_M_HAIR.ABP_VMP_BRU_M_HAIR_12_C
/// Size: 0x0D40 (0x0002C0 - 0x001000)
class UABP_VMP_BRU_M_HAIR_12_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x02F8   (0x0020)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x0318   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0320   (0x0440)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0760   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0780   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0BC0   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/12/ABP_VMP_BRU_M_HAIR.ABP_VMP_BRU_M_HAIR_12_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/12/ABP_VMP_BRU_M_HAIR.ABP_VMP_BRU_M_HAIR_12_C.ExecuteUbergraph_ABP_VMP_BRU_M_HAIR
	void ExecuteUbergraph_ABP_VMP_BRU_M_HAIR(int32_t EntryPoint);                                                            // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Brujah/Female/Hair/07/ABP_SKM_V_HAIR_81_POS.ABP_SKM_V_HAIR_81_POS_C
/// Size: 0x1BC0 (0x000330 - 0x001EF0)
class UABP_SKM_V_HAIR_81_POS_C : public UTigerCharacterPoseableMeshAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0330   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0338   (0x0030)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0368   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0470   (0x0020)  
	FAnimNode_MeshSpaceRefPose                         AnimGraphNode_MeshRefPose;                                  // 0x0490   (0x0010)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x04A0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x05A8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x06B0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x07B8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x08C0   (0x0108)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x09C8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x09D0   (0x0440)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0E10   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0F18   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1020   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1128   (0x0108)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1230   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1670   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1AB0   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/07/ABP_SKM_V_HAIR_81_POS.ABP_SKM_V_HAIR_81_POS_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/07/ABP_SKM_V_HAIR_81_POS.ABP_SKM_V_HAIR_81_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_81_POS_AnimGraphNode_ModifyBone_71EF2F41413B9AA3BCDB63ABDB770FB3
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_81_POS_AnimGraphNode_ModifyBone_71EF2F41413B9AA3BCDB63ABDB770FB3(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/07/ABP_SKM_V_HAIR_81_POS.ABP_SKM_V_HAIR_81_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_81_POS_AnimGraphNode_ModifyBone_1AFCE5294859FF3A5597D5A7AB202296
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_81_POS_AnimGraphNode_ModifyBone_1AFCE5294859FF3A5597D5A7AB202296(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/07/ABP_SKM_V_HAIR_81_POS.ABP_SKM_V_HAIR_81_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_81_POS_AnimGraphNode_ModifyBone_B988CE9D41BCD9DD8D19EAA1AE2002B3
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_81_POS_AnimGraphNode_ModifyBone_B988CE9D41BCD9DD8D19EAA1AE2002B3(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/07/ABP_SKM_V_HAIR_81_POS.ABP_SKM_V_HAIR_81_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_81_POS_AnimGraphNode_ModifyBone_6E4EC8AE49BFFC4AF470F4AE11748E3D
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_81_POS_AnimGraphNode_ModifyBone_6E4EC8AE49BFFC4AF470F4AE11748E3D(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/07/ABP_SKM_V_HAIR_81_POS.ABP_SKM_V_HAIR_81_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_81_POS_AnimGraphNode_ModifyBone_04E918184631C4D5F74B1BBE1A631D93
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_81_POS_AnimGraphNode_ModifyBone_04E918184631C4D5F74B1BBE1A631D93(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/07/ABP_SKM_V_HAIR_81_POS.ABP_SKM_V_HAIR_81_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_81_POS_AnimGraphNode_ModifyBone_1E3E02FD4B87E8F34DC07A9A7C2CEECA
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_81_POS_AnimGraphNode_ModifyBone_1E3E02FD4B87E8F34DC07A9A7C2CEECA(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/07/ABP_SKM_V_HAIR_81_POS.ABP_SKM_V_HAIR_81_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_81_POS_AnimGraphNode_ModifyBone_9B91C82D4EE4085F466970B78D03C101
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_81_POS_AnimGraphNode_ModifyBone_9B91C82D4EE4085F466970B78D03C101(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/07/ABP_SKM_V_HAIR_81_POS.ABP_SKM_V_HAIR_81_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_81_POS_AnimGraphNode_ModifyBone_335A50F84F59D8DD7908D4AEEA0CFB51
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_81_POS_AnimGraphNode_ModifyBone_335A50F84F59D8DD7908D4AEEA0CFB51(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/07/ABP_SKM_V_HAIR_81_POS.ABP_SKM_V_HAIR_81_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_81_POS_AnimGraphNode_ModifyBone_F088A711477167B872DDEB98A73595BB
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_81_POS_AnimGraphNode_ModifyBone_F088A711477167B872DDEB98A73595BB(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/07/ABP_SKM_V_HAIR_81_POS.ABP_SKM_V_HAIR_81_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_81_POS_AnimGraphNode_ModifyBone_D48BADCD48518FA6802EC698CF55B917
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_81_POS_AnimGraphNode_ModifyBone_D48BADCD48518FA6802EC698CF55B917(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/07/ABP_SKM_V_HAIR_81_POS.ABP_SKM_V_HAIR_81_POS_C.ExecuteUbergraph_ABP_SKM_V_HAIR_81_POS
	void ExecuteUbergraph_ABP_SKM_V_HAIR_81_POS(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Brujah/Female/Hair/07/ABP_VMP_BRU_F_HAIR_07.ABP_VMP_BRU_F_HAIR_07_C
/// Size: 0x0D40 (0x0002C0 - 0x001000)
class UABP_VMP_BRU_F_HAIR_07_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x02C8   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x02E8   (0x0020)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0308   (0x0030)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x0338   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0340   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0780   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0BC0   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/07/ABP_VMP_BRU_F_HAIR_07.ABP_VMP_BRU_F_HAIR_07_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/07/ABP_VMP_BRU_F_HAIR_07.ABP_VMP_BRU_F_HAIR_07_C.ExecuteUbergraph_ABP_VMP_BRU_F_HAIR_07
	void ExecuteUbergraph_ABP_VMP_BRU_F_HAIR_07(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Toreador/Female/Hair/08/ABP_SKM_V_HAIR_18_POS.ABP_SKM_V_HAIR_18_POS_C
/// Size: 0x2880 (0x000330 - 0x002BB0)
class UABP_SKM_V_HAIR_18_POS_C : public UTigerCharacterPoseableMeshAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0330   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0338   (0x0030)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0368   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0470   (0x0020)  
	FAnimNode_MeshSpaceRefPose                         AnimGraphNode_MeshRefPose;                                  // 0x0490   (0x0010)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x04A0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x05A8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x06B0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x07B8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x08C0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x09C8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0AD0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0BD8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0CE0   (0x0108)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x0DE8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0DF0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1230   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1670   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1AB0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1EF0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2330   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2770   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/08/ABP_SKM_V_HAIR_18_POS.ABP_SKM_V_HAIR_18_POS_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/08/ABP_SKM_V_HAIR_18_POS.ABP_SKM_V_HAIR_18_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_18_POS_AnimGraphNode_ModifyBone_D743F14644BF6340EDADC19B7181D6BE
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_18_POS_AnimGraphNode_ModifyBone_D743F14644BF6340EDADC19B7181D6BE(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/08/ABP_SKM_V_HAIR_18_POS.ABP_SKM_V_HAIR_18_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_18_POS_AnimGraphNode_ModifyBone_AEE092B54A2374FE3AAF2DAF605F9C86
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_18_POS_AnimGraphNode_ModifyBone_AEE092B54A2374FE3AAF2DAF605F9C86(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/08/ABP_SKM_V_HAIR_18_POS.ABP_SKM_V_HAIR_18_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_18_POS_AnimGraphNode_ModifyBone_B91E30E444048FB509AA3A86FB6316F1
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_18_POS_AnimGraphNode_ModifyBone_B91E30E444048FB509AA3A86FB6316F1(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/08/ABP_SKM_V_HAIR_18_POS.ABP_SKM_V_HAIR_18_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_18_POS_AnimGraphNode_ModifyBone_C9A991C34C6B2E2BAFA289B5502F321B
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_18_POS_AnimGraphNode_ModifyBone_C9A991C34C6B2E2BAFA289B5502F321B(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/08/ABP_SKM_V_HAIR_18_POS.ABP_SKM_V_HAIR_18_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_18_POS_AnimGraphNode_ModifyBone_99A5A589429E522E57F90F9CC5955010
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_18_POS_AnimGraphNode_ModifyBone_99A5A589429E522E57F90F9CC5955010(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/08/ABP_SKM_V_HAIR_18_POS.ABP_SKM_V_HAIR_18_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_18_POS_AnimGraphNode_ModifyBone_7A657D6841365161F04A158A39B0695B
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_18_POS_AnimGraphNode_ModifyBone_7A657D6841365161F04A158A39B0695B(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/08/ABP_SKM_V_HAIR_18_POS.ABP_SKM_V_HAIR_18_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_18_POS_AnimGraphNode_ModifyBone_977149F54B5207CD730F2C94BD1F28FB
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_18_POS_AnimGraphNode_ModifyBone_977149F54B5207CD730F2C94BD1F28FB(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/08/ABP_SKM_V_HAIR_18_POS.ABP_SKM_V_HAIR_18_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_18_POS_AnimGraphNode_ModifyBone_59EDE8244F119A77380EB5BFB0CACA80
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_18_POS_AnimGraphNode_ModifyBone_59EDE8244F119A77380EB5BFB0CACA80(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/08/ABP_SKM_V_HAIR_18_POS.ABP_SKM_V_HAIR_18_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_18_POS_AnimGraphNode_ModifyBone_A6F56E794557E9D9B2BE0BB7AF98363A
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_18_POS_AnimGraphNode_ModifyBone_A6F56E794557E9D9B2BE0BB7AF98363A(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/08/ABP_SKM_V_HAIR_18_POS.ABP_SKM_V_HAIR_18_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_18_POS_AnimGraphNode_ModifyBone_291B30ED442B3AE59DF907B540929160
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_18_POS_AnimGraphNode_ModifyBone_291B30ED442B3AE59DF907B540929160(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/08/ABP_SKM_V_HAIR_18_POS.ABP_SKM_V_HAIR_18_POS_C.ExecuteUbergraph_ABP_SKM_V_HAIR_18_POS
	void ExecuteUbergraph_ABP_SKM_V_HAIR_18_POS(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Toreador/Female/Hair/08/ABP_VMP_TOR_F_HAIR_08.ABP_VMP_TOR_F_HAIR_08_C
/// Size: 0x37C0 (0x0002C0 - 0x003A80)
class UABP_VMP_TOR_F_HAIR_08_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02C8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x02D0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0710   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0B50   (0x0440)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0F90   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0FB0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x13F0   (0x0440)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x1830   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1850   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1C90   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x20D0   (0x0440)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x2510   (0x0030)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2540   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2980   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2DC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3200   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3640   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/08/ABP_VMP_TOR_F_HAIR_08.ABP_VMP_TOR_F_HAIR_08_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/08/ABP_VMP_TOR_F_HAIR_08.ABP_VMP_TOR_F_HAIR_08_C.ExecuteUbergraph_ABP_VMP_TOR_F_HAIR_08
	void ExecuteUbergraph_ABP_VMP_TOR_F_HAIR_08(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Customization/Assets/Hair/40/ABP_SKM_V_HAIR_40_POS.ABP_SKM_V_HAIR_40_POS_C
/// Size: 0x1BC0 (0x000330 - 0x001EF0)
class UABP_SKM_V_HAIR_40_POS_C : public UTigerCharacterPoseableMeshAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0330   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0338   (0x0030)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0368   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0470   (0x0020)  
	FAnimNode_MeshSpaceRefPose                         AnimGraphNode_MeshRefPose;                                  // 0x0490   (0x0010)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x04A0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x05A8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x06B0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x07B8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x08C0   (0x0108)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x09C8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x09D0   (0x0440)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0E10   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0F18   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1020   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1128   (0x0108)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1230   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1670   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1AB0   (0x0440)  


	/// Functions
	// Function /Game/Characters/Customization/Assets/Hair/40/ABP_SKM_V_HAIR_40_POS.ABP_SKM_V_HAIR_40_POS_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Customization/Assets/Hair/40/ABP_SKM_V_HAIR_40_POS.ABP_SKM_V_HAIR_40_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_40_POS_AnimGraphNode_ModifyBone_4A38E7944303ED58EB8C2E91E4F27127
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_40_POS_AnimGraphNode_ModifyBone_4A38E7944303ED58EB8C2E91E4F27127(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/40/ABP_SKM_V_HAIR_40_POS.ABP_SKM_V_HAIR_40_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_40_POS_AnimGraphNode_ModifyBone_2B6D8E154CDF39D418DBE1BFD8964C90
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_40_POS_AnimGraphNode_ModifyBone_2B6D8E154CDF39D418DBE1BFD8964C90(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/40/ABP_SKM_V_HAIR_40_POS.ABP_SKM_V_HAIR_40_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_40_POS_AnimGraphNode_ModifyBone_5AE599444B7EAB7470B570842669823C
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_40_POS_AnimGraphNode_ModifyBone_5AE599444B7EAB7470B570842669823C(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/40/ABP_SKM_V_HAIR_40_POS.ABP_SKM_V_HAIR_40_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_40_POS_AnimGraphNode_ModifyBone_3AB4F7DC46347DEE1EEF5C99D58B9ADC
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_40_POS_AnimGraphNode_ModifyBone_3AB4F7DC46347DEE1EEF5C99D58B9ADC(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/40/ABP_SKM_V_HAIR_40_POS.ABP_SKM_V_HAIR_40_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_40_POS_AnimGraphNode_ModifyBone_B1AB2BB24050B50623A14D997B277A7A
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_40_POS_AnimGraphNode_ModifyBone_B1AB2BB24050B50623A14D997B277A7A(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/40/ABP_SKM_V_HAIR_40_POS.ABP_SKM_V_HAIR_40_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_40_POS_AnimGraphNode_ModifyBone_8A6192CC43CB529CCE0F24927D0ED5BA
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_40_POS_AnimGraphNode_ModifyBone_8A6192CC43CB529CCE0F24927D0ED5BA(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/40/ABP_SKM_V_HAIR_40_POS.ABP_SKM_V_HAIR_40_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_40_POS_AnimGraphNode_ModifyBone_A62D1C3B42EE85E9174A55AFAE6F4F2E
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_40_POS_AnimGraphNode_ModifyBone_A62D1C3B42EE85E9174A55AFAE6F4F2E(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/40/ABP_SKM_V_HAIR_40_POS.ABP_SKM_V_HAIR_40_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_40_POS_AnimGraphNode_ModifyBone_2271A70A48D5A572B287C991E062D27F
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_40_POS_AnimGraphNode_ModifyBone_2271A70A48D5A572B287C991E062D27F(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/40/ABP_SKM_V_HAIR_40_POS.ABP_SKM_V_HAIR_40_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_40_POS_AnimGraphNode_ModifyBone_67EE7D6E4379C27538AF9A80AD810EF8
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_40_POS_AnimGraphNode_ModifyBone_67EE7D6E4379C27538AF9A80AD810EF8(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/40/ABP_SKM_V_HAIR_40_POS.ABP_SKM_V_HAIR_40_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_40_POS_AnimGraphNode_ModifyBone_76B505744E0CE3229C7F7FADB3790719
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_40_POS_AnimGraphNode_ModifyBone_76B505744E0CE3229C7F7FADB3790719(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/40/ABP_SKM_V_HAIR_40_POS.ABP_SKM_V_HAIR_40_POS_C.ExecuteUbergraph_ABP_SKM_V_HAIR_40_POS
	void ExecuteUbergraph_ABP_SKM_V_HAIR_40_POS(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Customization/Assets/Hair/59/ABP_V_HAIR.ABP_V_HAIR_59_C
/// Size: 0x0038 (0x0002C0 - 0x0002F8)
class UABP_V_HAIR_59_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  


	/// Functions
	// Function /Game/Characters/Customization/Assets/Hair/59/ABP_V_HAIR.ABP_V_HAIR_59_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Customization/Assets/Hair/59/ABP_V_HAIR.ABP_V_HAIR_59_C.ExecuteUbergraph_ABP_V_HAIR
	void ExecuteUbergraph_ABP_V_HAIR(int32_t EntryPoint);                                                                    // [0x197e4f0] Final                
};

/// Class /Game/Characters/Customization/Assets/Hair/59/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_59_C
/// Size: 0x1BC0 (0x000330 - 0x001EF0)
class UABP_SKM_V_HAIR_59_C : public UTigerCharacterPoseableMeshAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0330   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0338   (0x0030)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0368   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0470   (0x0020)  
	FAnimNode_MeshSpaceRefPose                         AnimGraphNode_MeshRefPose;                                  // 0x0490   (0x0010)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x04A0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x05A8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x06B0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x07B8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x08C0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x09C8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0AD0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0BD8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0CE0   (0x0108)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x0DE8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0DF0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1230   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1670   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1AB0   (0x0440)  


	/// Functions
	// Function /Game/Characters/Customization/Assets/Hair/59/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_59_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Customization/Assets/Hair/59/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_59_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_59_AnimGraphNode_ModifyBone_7987113D42153D78994DCEA1BDCEA3E3
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_59_AnimGraphNode_ModifyBone_7987113D42153D78994DCEA1BDCEA3E3(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/59/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_59_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_59_AnimGraphNode_ModifyBone_91B0A88C4A8BA07912F8EFA38D00ED67
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_59_AnimGraphNode_ModifyBone_91B0A88C4A8BA07912F8EFA38D00ED67(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/59/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_59_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_59_AnimGraphNode_ModifyBone_A1204D2749520813DD6CF6B5F176A97A
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_59_AnimGraphNode_ModifyBone_A1204D2749520813DD6CF6B5F176A97A(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/59/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_59_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_59_AnimGraphNode_ModifyBone_FE4908E442FF357F2A0849B4A2FF7341
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_59_AnimGraphNode_ModifyBone_FE4908E442FF357F2A0849B4A2FF7341(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/59/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_59_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_59_AnimGraphNode_ModifyBone_1FB530A24783B1DEDF6DAAB9442E86C2
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_59_AnimGraphNode_ModifyBone_1FB530A24783B1DEDF6DAAB9442E86C2(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/59/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_59_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_59_AnimGraphNode_ModifyBone_A3A87261457F760476DAF2B5AB153044
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_59_AnimGraphNode_ModifyBone_A3A87261457F760476DAF2B5AB153044(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/59/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_59_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_59_AnimGraphNode_ModifyBone_1635F1BB42317F9A7741D39369C5E26B
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_59_AnimGraphNode_ModifyBone_1635F1BB42317F9A7741D39369C5E26B(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/59/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_59_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_59_AnimGraphNode_ModifyBone_AE2A99D74B29107B229F47B969675922
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_59_AnimGraphNode_ModifyBone_AE2A99D74B29107B229F47B969675922(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/59/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_59_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_59_AnimGraphNode_ModifyBone_4A8AEE0F47CDAA4FFF442FA809252AFE
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_59_AnimGraphNode_ModifyBone_4A8AEE0F47CDAA4FFF442FA809252AFE(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/59/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_59_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_59_AnimGraphNode_ModifyBone_45FAF9284400CB81A88F29BD351CDC84
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_59_AnimGraphNode_ModifyBone_45FAF9284400CB81A88F29BD351CDC84(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/59/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_59_C.ExecuteUbergraph_ABP_SKM_V_HAIR
	void ExecuteUbergraph_ABP_SKM_V_HAIR(int32_t EntryPoint);                                                                // [0x197e4f0] Final                
};

/// Class /Game/Characters/Customization/Assets/Hair/56/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_56_C
/// Size: 0x2440 (0x000330 - 0x002770)
class UABP_SKM_V_HAIR_56_C : public UTigerCharacterPoseableMeshAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0330   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0338   (0x0030)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0368   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0470   (0x0020)  
	FAnimNode_MeshSpaceRefPose                         AnimGraphNode_MeshRefPose;                                  // 0x0490   (0x0010)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x04A0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x05A8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x06B0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x07B8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x08C0   (0x0108)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x09C8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x09D0   (0x0440)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0E10   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0F18   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1020   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1128   (0x0108)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1230   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1670   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1AB0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1EF0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2330   (0x0440)  


	/// Functions
	// Function /Game/Characters/Customization/Assets/Hair/56/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_56_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Customization/Assets/Hair/56/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_56_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_56_AnimGraphNode_ModifyBone_9AA714BD481326C9167C56BEABF14EBD
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_56_AnimGraphNode_ModifyBone_9AA714BD481326C9167C56BEABF14EBD(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/56/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_56_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_56_AnimGraphNode_ModifyBone_9464901341FFF0DEA917429802625F3A
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_56_AnimGraphNode_ModifyBone_9464901341FFF0DEA917429802625F3A(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/56/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_56_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_56_AnimGraphNode_ModifyBone_2E8DF5E0465A9A8DB0FF90B0E55BE6C3
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_56_AnimGraphNode_ModifyBone_2E8DF5E0465A9A8DB0FF90B0E55BE6C3(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/56/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_56_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_56_AnimGraphNode_ModifyBone_54677EDF45384422A675CE9679353CED
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_56_AnimGraphNode_ModifyBone_54677EDF45384422A675CE9679353CED(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/56/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_56_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_56_AnimGraphNode_ModifyBone_38531FBB4427422C12529DA614448C36
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_56_AnimGraphNode_ModifyBone_38531FBB4427422C12529DA614448C36(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/56/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_56_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_56_AnimGraphNode_ModifyBone_C4B8DA4B4DF44C7487E163B3DD5477C3
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_56_AnimGraphNode_ModifyBone_C4B8DA4B4DF44C7487E163B3DD5477C3(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/56/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_56_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_56_AnimGraphNode_ModifyBone_8FC96F704C96CF054C05699ED71282B4
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_56_AnimGraphNode_ModifyBone_8FC96F704C96CF054C05699ED71282B4(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/56/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_56_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_56_AnimGraphNode_ModifyBone_A20DE23A4C24FF7ADC2A67B72EFE3209
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_56_AnimGraphNode_ModifyBone_A20DE23A4C24FF7ADC2A67B72EFE3209(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/56/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_56_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_56_AnimGraphNode_ModifyBone_B7FEF8F34101E1FDE74C50A20F49B4E5
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_56_AnimGraphNode_ModifyBone_B7FEF8F34101E1FDE74C50A20F49B4E5(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/56/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_56_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_56_AnimGraphNode_ModifyBone_15F77BEC4E67815D91089081DB930A0B
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_56_AnimGraphNode_ModifyBone_15F77BEC4E67815D91089081DB930A0B(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/56/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_56_C.ExecuteUbergraph_ABP_SKM_V_HAIR
	void ExecuteUbergraph_ABP_SKM_V_HAIR(int32_t EntryPoint);                                                                // [0x197e4f0] Final                
};

/// Class /Game/Characters/Customization/Assets/Hair/44/ABP_V_HAIR.ABP_V_HAIR_44_C
/// Size: 0x4640 (0x000330 - 0x004970)
class UABP_V_HAIR_44_C : public UTigerCharacterPoseableMeshAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0330   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0338   (0x0030)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0368   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0470   (0x0020)  
	FAnimNode_MeshSpaceRefPose                         AnimGraphNode_MeshRefPose;                                  // 0x0490   (0x0010)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x04A0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x05A8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x06B0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x07B8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x08C0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x09C8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0AD0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0BD8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0CE0   (0x0108)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x0DE8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0DF0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1230   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1670   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1AB0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1EF0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2330   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2770   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2BB0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2FF0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3430   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3870   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3CB0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x40F0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x4530   (0x0440)  


	/// Functions
	// Function /Game/Characters/Customization/Assets/Hair/44/ABP_V_HAIR.ABP_V_HAIR_44_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Customization/Assets/Hair/44/ABP_V_HAIR.ABP_V_HAIR_44_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_V_HAIR_44_AnimGraphNode_ModifyBone_36AE07AE4DABD153AC68CEAECF5DBC6D
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_V_HAIR_44_AnimGraphNode_ModifyBone_36AE07AE4DABD153AC68CEAECF5DBC6D(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/44/ABP_V_HAIR.ABP_V_HAIR_44_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_V_HAIR_44_AnimGraphNode_ModifyBone_8AD68A904025CE4947115FB1D4D41F30
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_V_HAIR_44_AnimGraphNode_ModifyBone_8AD68A904025CE4947115FB1D4D41F30(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/44/ABP_V_HAIR.ABP_V_HAIR_44_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_V_HAIR_44_AnimGraphNode_ModifyBone_4E46B44F4FECB30D5DE6EA8DB5399560
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_V_HAIR_44_AnimGraphNode_ModifyBone_4E46B44F4FECB30D5DE6EA8DB5399560(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/44/ABP_V_HAIR.ABP_V_HAIR_44_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_V_HAIR_44_AnimGraphNode_ModifyBone_315284B2469AC3B621F005B5C04A2FF8
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_V_HAIR_44_AnimGraphNode_ModifyBone_315284B2469AC3B621F005B5C04A2FF8(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/44/ABP_V_HAIR.ABP_V_HAIR_44_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_V_HAIR_44_AnimGraphNode_ModifyBone_8D3A59494662C04AF881C6B6FB81E134
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_V_HAIR_44_AnimGraphNode_ModifyBone_8D3A59494662C04AF881C6B6FB81E134(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/44/ABP_V_HAIR.ABP_V_HAIR_44_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_V_HAIR_44_AnimGraphNode_ModifyBone_3D2B6B504B652DD44BDBACB44595FBCF
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_V_HAIR_44_AnimGraphNode_ModifyBone_3D2B6B504B652DD44BDBACB44595FBCF(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/44/ABP_V_HAIR.ABP_V_HAIR_44_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_V_HAIR_44_AnimGraphNode_ModifyBone_66C50A3A4664C78847E5B5AFA455BCFC
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_V_HAIR_44_AnimGraphNode_ModifyBone_66C50A3A4664C78847E5B5AFA455BCFC(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/44/ABP_V_HAIR.ABP_V_HAIR_44_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_V_HAIR_44_AnimGraphNode_ModifyBone_AFC45BED44C16CD7D115B1B0086BD944
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_V_HAIR_44_AnimGraphNode_ModifyBone_AFC45BED44C16CD7D115B1B0086BD944(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/44/ABP_V_HAIR.ABP_V_HAIR_44_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_V_HAIR_44_AnimGraphNode_ModifyBone_B40AF07749070ABB3EB53BAB1DB4D436
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_V_HAIR_44_AnimGraphNode_ModifyBone_B40AF07749070ABB3EB53BAB1DB4D436(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/44/ABP_V_HAIR.ABP_V_HAIR_44_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_V_HAIR_44_AnimGraphNode_ModifyBone_C2CB786341CE88DA7D83D384D8391061
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_V_HAIR_44_AnimGraphNode_ModifyBone_C2CB786341CE88DA7D83D384D8391061(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/44/ABP_V_HAIR.ABP_V_HAIR_44_C.ExecuteUbergraph_ABP_V_HAIR
	void ExecuteUbergraph_ABP_V_HAIR(int32_t EntryPoint);                                                                    // [0x197e4f0] Final                
};

/// Class /Game/Characters/Customization/Assets/Hair/56/ABP_V_HAIR.ABP_V_HAIR_56_C
/// Size: 0x0038 (0x0002C0 - 0x0002F8)
class UABP_V_HAIR_56_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  


	/// Functions
	// Function /Game/Characters/Customization/Assets/Hair/56/ABP_V_HAIR.ABP_V_HAIR_56_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Customization/Assets/Hair/56/ABP_V_HAIR.ABP_V_HAIR_56_C.ExecuteUbergraph_ABP_V_HAIR
	void ExecuteUbergraph_ABP_V_HAIR(int32_t EntryPoint);                                                                    // [0x197e4f0] Final                
};

/// Class /Game/Characters/Customization/Assets/Hair/52/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_52_C
/// Size: 0x2000 (0x000330 - 0x002330)
class UABP_SKM_V_HAIR_52_C : public UTigerCharacterPoseableMeshAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0330   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0338   (0x0030)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0368   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0470   (0x0020)  
	FAnimNode_MeshSpaceRefPose                         AnimGraphNode_MeshRefPose;                                  // 0x0490   (0x0010)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x04A0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x05A8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x06B0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x07B8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x08C0   (0x0108)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x09C8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x09D0   (0x0440)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0E10   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0F18   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1020   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1128   (0x0108)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1230   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1670   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1AB0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1EF0   (0x0440)  


	/// Functions
	// Function /Game/Characters/Customization/Assets/Hair/52/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_52_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Customization/Assets/Hair/52/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_52_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_52_AnimGraphNode_ModifyBone_A7467B5848393D31DAD7688C67304CE0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_52_AnimGraphNode_ModifyBone_A7467B5848393D31DAD7688C67304CE0(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/52/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_52_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_52_AnimGraphNode_ModifyBone_F8670F0040CE47B529BE64A6FFCB2968
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_52_AnimGraphNode_ModifyBone_F8670F0040CE47B529BE64A6FFCB2968(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/52/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_52_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_52_AnimGraphNode_ModifyBone_9CC10E8448296DD3EFE8EA91F0832697
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_52_AnimGraphNode_ModifyBone_9CC10E8448296DD3EFE8EA91F0832697(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/52/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_52_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_52_AnimGraphNode_ModifyBone_F37890E94FDEAC4C279517BEFAE416E0
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_52_AnimGraphNode_ModifyBone_F37890E94FDEAC4C279517BEFAE416E0(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/52/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_52_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_52_AnimGraphNode_ModifyBone_BBBA9ACC4E30677DB781E3951B5E1746
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_52_AnimGraphNode_ModifyBone_BBBA9ACC4E30677DB781E3951B5E1746(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/52/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_52_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_52_AnimGraphNode_ModifyBone_DB5F45DD415D16620288D6A12B7C64D7
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_52_AnimGraphNode_ModifyBone_DB5F45DD415D16620288D6A12B7C64D7(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/52/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_52_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_52_AnimGraphNode_ModifyBone_1413A5F042E4CE59F514D39D27C0F094
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_52_AnimGraphNode_ModifyBone_1413A5F042E4CE59F514D39D27C0F094(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/52/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_52_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_52_AnimGraphNode_ModifyBone_99D88ED54367FD16335052AB20A7DA49
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_52_AnimGraphNode_ModifyBone_99D88ED54367FD16335052AB20A7DA49(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/52/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_52_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_52_AnimGraphNode_ModifyBone_295E1C304380DE9678A42A974F241C2C
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_52_AnimGraphNode_ModifyBone_295E1C304380DE9678A42A974F241C2C(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/52/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_52_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_52_AnimGraphNode_ModifyBone_1CD9CC7444DCB4DEA7AB28958F0DCEA8
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_52_AnimGraphNode_ModifyBone_1CD9CC7444DCB4DEA7AB28958F0DCEA8(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Customization/Assets/Hair/52/ABP_SKM_V_HAIR.ABP_SKM_V_HAIR_52_C.ExecuteUbergraph_ABP_SKM_V_HAIR
	void ExecuteUbergraph_ABP_SKM_V_HAIR(int32_t EntryPoint);                                                                // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Brujah/Female/Hair/04/ABP_VMP_BRU_F_HAIR_04.ABP_VMP_BRU_F_HAIR_04_C
/// Size: 0x4040 (0x0002C0 - 0x004300)
class UABP_VMP_BRU_F_HAIR_04_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02F8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0300   (0x0440)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0740   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0760   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0BA0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0FE0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1420   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1860   (0x0440)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x1CA0   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1CC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2100   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2540   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2980   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2DC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3200   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3640   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3A80   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3EC0   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/04/ABP_VMP_BRU_F_HAIR_04.ABP_VMP_BRU_F_HAIR_04_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/04/ABP_VMP_BRU_F_HAIR_04.ABP_VMP_BRU_F_HAIR_04_C.ExecuteUbergraph_ABP_VMP_BRU_F_HAIR_04
	void ExecuteUbergraph_ABP_VMP_BRU_F_HAIR_04(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Brujah/Female/Hair/01/ABP_SKM_V_HAIR_01_POS.ABP_SKM_V_HAIR_01_POS_C
/// Size: 0x2CC0 (0x000330 - 0x002FF0)
class UABP_SKM_V_HAIR_01_POS_C : public UTigerCharacterPoseableMeshAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0330   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0338   (0x0030)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0368   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0470   (0x0020)  
	FAnimNode_MeshSpaceRefPose                         AnimGraphNode_MeshRefPose;                                  // 0x0490   (0x0010)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x04A0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x05A8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x06B0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x07B8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x08C0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x09C8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0AD0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0BD8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0CE0   (0x0108)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x0DE8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0DF0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1230   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1670   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1AB0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1EF0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2330   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2770   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2BB0   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/01/ABP_SKM_V_HAIR_01_POS.ABP_SKM_V_HAIR_01_POS_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/01/ABP_SKM_V_HAIR_01_POS.ABP_SKM_V_HAIR_01_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_01_POS_AnimGraphNode_ModifyBone_B143BEED49666048A2C796B0BCF94449
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_01_POS_AnimGraphNode_ModifyBone_B143BEED49666048A2C796B0BCF94449(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/01/ABP_SKM_V_HAIR_01_POS.ABP_SKM_V_HAIR_01_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_01_POS_AnimGraphNode_ModifyBone_B957DF474664D420CDCE3E802CF7BDBC
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_01_POS_AnimGraphNode_ModifyBone_B957DF474664D420CDCE3E802CF7BDBC(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/01/ABP_SKM_V_HAIR_01_POS.ABP_SKM_V_HAIR_01_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_01_POS_AnimGraphNode_ModifyBone_1499D9E943537B25114606A2C562173F
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_01_POS_AnimGraphNode_ModifyBone_1499D9E943537B25114606A2C562173F(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/01/ABP_SKM_V_HAIR_01_POS.ABP_SKM_V_HAIR_01_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_01_POS_AnimGraphNode_ModifyBone_08270CDC482D912ED0B8D4A185D0D5EE
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_01_POS_AnimGraphNode_ModifyBone_08270CDC482D912ED0B8D4A185D0D5EE(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/01/ABP_SKM_V_HAIR_01_POS.ABP_SKM_V_HAIR_01_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_01_POS_AnimGraphNode_ModifyBone_48ECB4A94AC07A7479BCF7BA127CD3BC
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_01_POS_AnimGraphNode_ModifyBone_48ECB4A94AC07A7479BCF7BA127CD3BC(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/01/ABP_SKM_V_HAIR_01_POS.ABP_SKM_V_HAIR_01_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_01_POS_AnimGraphNode_ModifyBone_DD46CABC4C4243DAEE9A169DFE0572BF
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_01_POS_AnimGraphNode_ModifyBone_DD46CABC4C4243DAEE9A169DFE0572BF(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/01/ABP_SKM_V_HAIR_01_POS.ABP_SKM_V_HAIR_01_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_01_POS_AnimGraphNode_ModifyBone_319637F54DEB3139ABFC5CB16F714907
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_01_POS_AnimGraphNode_ModifyBone_319637F54DEB3139ABFC5CB16F714907(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/01/ABP_SKM_V_HAIR_01_POS.ABP_SKM_V_HAIR_01_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_01_POS_AnimGraphNode_ModifyBone_C48923A44750EF406B131EA6C59F3717
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_01_POS_AnimGraphNode_ModifyBone_C48923A44750EF406B131EA6C59F3717(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/01/ABP_SKM_V_HAIR_01_POS.ABP_SKM_V_HAIR_01_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_01_POS_AnimGraphNode_ModifyBone_243DE5104EDFBBCEBAD32E984260B379
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_01_POS_AnimGraphNode_ModifyBone_243DE5104EDFBBCEBAD32E984260B379(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/01/ABP_SKM_V_HAIR_01_POS.ABP_SKM_V_HAIR_01_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_01_POS_AnimGraphNode_ModifyBone_14CAEAD9468DA3E655CEA7A7B4CB29AE
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_01_POS_AnimGraphNode_ModifyBone_14CAEAD9468DA3E655CEA7A7B4CB29AE(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/01/ABP_SKM_V_HAIR_01_POS.ABP_SKM_V_HAIR_01_POS_C.ExecuteUbergraph_ABP_SKM_V_HAIR_01_POS
	void ExecuteUbergraph_ABP_SKM_V_HAIR_01_POS(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Brujah/Female/Hair/01/ABP_VMP_BRU_F_HAIR_01.ABP_VMP_BRU_F_HAIR_01_C
/// Size: 0x2280 (0x0002C0 - 0x002540)
class UABP_VMP_BRU_F_HAIR_01_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02C8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x02D0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0710   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0B50   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0F90   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x13D0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1810   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1C50   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2090   (0x0440)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x24D0   (0x0020)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x24F0   (0x0030)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x2520   (0x0020)  


	/// Functions
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/01/ABP_VMP_BRU_F_HAIR_01.ABP_VMP_BRU_F_HAIR_01_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/01/ABP_VMP_BRU_F_HAIR_01.ABP_VMP_BRU_F_HAIR_01_C.ExecuteUbergraph_ABP_VMP_BRU_F_HAIR_01
	void ExecuteUbergraph_ABP_VMP_BRU_F_HAIR_01(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Brujah/Female/Hair/08/ABP_VMP_BRU_F_HAIR_08.ABP_VMP_BRU_F_HAIR_08_C
/// Size: 0x0D40 (0x0002C0 - 0x001000)
class UABP_VMP_BRU_F_HAIR_08_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x02F8   (0x0020)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x0318   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0320   (0x0440)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0760   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0780   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0BC0   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/08/ABP_VMP_BRU_F_HAIR_08.ABP_VMP_BRU_F_HAIR_08_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/08/ABP_VMP_BRU_F_HAIR_08.ABP_VMP_BRU_F_HAIR_08_C.ExecuteUbergraph_ABP_VMP_BRU_F_HAIR_08
	void ExecuteUbergraph_ABP_VMP_BRU_F_HAIR_08(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Brujah/Female/Hair/09/ABP_VMP_BRU_F_HAIR_09.ABP_VMP_BRU_F_HAIR_09_C
/// Size: 0x2B00 (0x0002C0 - 0x002DC0)
class UABP_VMP_BRU_F_HAIR_09_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02F8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0300   (0x0440)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0740   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0760   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0BA0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0FE0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1420   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1860   (0x0440)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x1CA0   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1CC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2100   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2540   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2980   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/09/ABP_VMP_BRU_F_HAIR_09.ABP_VMP_BRU_F_HAIR_09_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/09/ABP_VMP_BRU_F_HAIR_09.ABP_VMP_BRU_F_HAIR_09_C.ExecuteUbergraph_ABP_VMP_BRU_F_HAIR_09
	void ExecuteUbergraph_ABP_VMP_BRU_F_HAIR_09(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Nosferatu/Female/Hair/01/ABP_VMP_NOS_F_HAIR_01_Skeleton.ABP_VMP_NOS_F_HAIR_01_Skeleton_C
/// Size: 0x4D00 (0x0002C0 - 0x004FC0)
class UABP_VMP_NOS_F_HAIR_01_Skeleton_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02F8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0300   (0x0440)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0740   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0760   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0BA0   (0x0440)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0FE0   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1000   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1440   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1880   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1CC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2100   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2540   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2980   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2DC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3200   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3640   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3A80   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3EC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x4300   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x4740   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x4B80   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Nosferatu/Female/Hair/01/ABP_VMP_NOS_F_HAIR_01_Skeleton.ABP_VMP_NOS_F_HAIR_01_Skeleton_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Nosferatu/Female/Hair/01/ABP_VMP_NOS_F_HAIR_01_Skeleton.ABP_VMP_NOS_F_HAIR_01_Skeleton_C.ExecuteUbergraph_ABP_VMP_NOS_F_HAIR_01_Skeleton
	void ExecuteUbergraph_ABP_VMP_NOS_F_HAIR_01_Skeleton(int32_t EntryPoint);                                                // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Nosferatu/Female/Hair/03/ABP_VMP_NOS_F_HAIR_03.ABP_VMP_NOS_F_HAIR_03_C
/// Size: 0x37C0 (0x0002C0 - 0x003A80)
class UABP_VMP_NOS_F_HAIR_03_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x02C8   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x02E8   (0x0020)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x0308   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0310   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0750   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0B90   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0FD0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1410   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1850   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1C90   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x20D0   (0x0440)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x2510   (0x0030)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2540   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2980   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2DC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3200   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3640   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Nosferatu/Female/Hair/03/ABP_VMP_NOS_F_HAIR_03.ABP_VMP_NOS_F_HAIR_03_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Nosferatu/Female/Hair/03/ABP_VMP_NOS_F_HAIR_03.ABP_VMP_NOS_F_HAIR_03_C.ExecuteUbergraph_ABP_VMP_NOS_F_HAIR_03
	void ExecuteUbergraph_ABP_VMP_NOS_F_HAIR_03(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Nosferatu/Male/Hair/02/ABP_VMP_NOS_M_HAIR_02.ABP_VMP_NOS_M_HAIR_02_C
/// Size: 0x1E40 (0x0002C0 - 0x002100)
class UABP_VMP_NOS_M_HAIR_02_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x02F8   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0318   (0x0020)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x0338   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0340   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0780   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0BC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1000   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1440   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1880   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1CC0   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Nosferatu/Male/Hair/02/ABP_VMP_NOS_M_HAIR_02.ABP_VMP_NOS_M_HAIR_02_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Nosferatu/Male/Hair/02/ABP_VMP_NOS_M_HAIR_02.ABP_VMP_NOS_M_HAIR_02_C.ExecuteUbergraph_ABP_VMP_NOS_M_HAIR_02
	void ExecuteUbergraph_ABP_VMP_NOS_M_HAIR_02(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Nosferatu/Male/Hair/03/ABP_VMP_NOS_M_HAIR_03.ABP_VMP_NOS_M_HAIR_03_C
/// Size: 0x3380 (0x0002C0 - 0x003640)
class UABP_VMP_NOS_M_HAIR_03_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02F8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0300   (0x0440)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0740   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0760   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0BA0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0FE0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1420   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1860   (0x0440)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x1CA0   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1CC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2100   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2540   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2980   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2DC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3200   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Nosferatu/Male/Hair/03/ABP_VMP_NOS_M_HAIR_03.ABP_VMP_NOS_M_HAIR_03_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Nosferatu/Male/Hair/03/ABP_VMP_NOS_M_HAIR_03.ABP_VMP_NOS_M_HAIR_03_C.ExecuteUbergraph_ABP_VMP_NOS_M_HAIR_03
	void ExecuteUbergraph_ABP_VMP_NOS_M_HAIR_03(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Nosferatu/Male/Hair/04/ABP_VMP_NOS_M_HAIR_04.ABP_VMP_NOS_M_HAIR_04_C
/// Size: 0x4040 (0x0002C0 - 0x004300)
class UABP_VMP_NOS_M_HAIR_04_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02F8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0300   (0x0440)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0740   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0760   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0BA0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0FE0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1420   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1860   (0x0440)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x1CA0   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1CC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2100   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2540   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2980   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2DC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3200   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3640   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3A80   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3EC0   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Nosferatu/Male/Hair/04/ABP_VMP_NOS_M_HAIR_04.ABP_VMP_NOS_M_HAIR_04_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Nosferatu/Male/Hair/04/ABP_VMP_NOS_M_HAIR_04.ABP_VMP_NOS_M_HAIR_04_C.ExecuteUbergraph_ABP_VMP_NOS_M_HAIR_04
	void ExecuteUbergraph_ABP_VMP_NOS_M_HAIR_04(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Toreador/Male/Hair/01/ABP_VMP_TOR_M_HAIR_01.ABP_VMP_TOR_M_HAIR_01_C
/// Size: 0x26C0 (0x0002C0 - 0x002980)
class UABP_VMP_TOR_M_HAIR_01_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02F8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0300   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0740   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0B80   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0FC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1400   (0x0440)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x1840   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1860   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1CA0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x20E0   (0x0440)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x2520   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2540   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Toreador/Male/Hair/01/ABP_VMP_TOR_M_HAIR_01.ABP_VMP_TOR_M_HAIR_01_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Toreador/Male/Hair/01/ABP_VMP_TOR_M_HAIR_01.ABP_VMP_TOR_M_HAIR_01_C.ExecuteUbergraph_ABP_VMP_TOR_M_HAIR_01
	void ExecuteUbergraph_ABP_VMP_TOR_M_HAIR_01(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Toreador/Female/Hair/02/ABP_VMP_TOR_F_HAIR_02.ABP_VMP_TOR_F_HAIR_02_C
/// Size: 0x2280 (0x0002C0 - 0x002540)
class UABP_VMP_TOR_F_HAIR_02_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02C8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x02D0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0710   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0B50   (0x0440)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0F90   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0FB0   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0FD0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1410   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1850   (0x0440)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x1C90   (0x0030)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1CC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2100   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/02/ABP_VMP_TOR_F_HAIR_02.ABP_VMP_TOR_F_HAIR_02_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/02/ABP_VMP_TOR_F_HAIR_02.ABP_VMP_TOR_F_HAIR_02_C.ExecuteUbergraph_ABP_VMP_TOR_F_HAIR_02
	void ExecuteUbergraph_ABP_VMP_TOR_F_HAIR_02(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Brujah/Male/Hair/07/ABP_VMP_BRU_M_HAIR_07.ABP_VMP_BRU_M_HAIR_07_C
/// Size: 0x0900 (0x0002C0 - 0x000BC0)
class UABP_VMP_BRU_M_HAIR_07_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02F8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0300   (0x0440)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0740   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0760   (0x0440)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0BA0   (0x0020)  


	/// Functions
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/07/ABP_VMP_BRU_M_HAIR_07.ABP_VMP_BRU_M_HAIR_07_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/07/ABP_VMP_BRU_M_HAIR_07.ABP_VMP_BRU_M_HAIR_07_C.ExecuteUbergraph_ABP_VMP_BRU_M_HAIR_07
	void ExecuteUbergraph_ABP_VMP_BRU_M_HAIR_07(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Toreador/Female/Hair/07/ABP_VMP_TOR_F_HAIR_07.ABP_VMP_TOR_F_HAIR_07_C
/// Size: 0x26C0 (0x0002C0 - 0x002980)
class UABP_VMP_TOR_F_HAIR_07_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02F8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0300   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0740   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0B80   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0FC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1400   (0x0440)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x1840   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1860   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1CA0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x20E0   (0x0440)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x2520   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2540   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/07/ABP_VMP_TOR_F_HAIR_07.ABP_VMP_TOR_F_HAIR_07_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/07/ABP_VMP_TOR_F_HAIR_07.ABP_VMP_TOR_F_HAIR_07_C.ExecuteUbergraph_ABP_VMP_TOR_F_HAIR_07
	void ExecuteUbergraph_ABP_VMP_TOR_F_HAIR_07(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Brujah/Male/Hair/13/ABP_SKM_V_HAIR_10_POS.ABP_SKM_V_HAIR_10_POS_C
/// Size: 0x2CC0 (0x000330 - 0x002FF0)
class UABP_SKM_V_HAIR_10_POS_C : public UTigerCharacterPoseableMeshAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0330   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0338   (0x0030)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0368   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0470   (0x0020)  
	FAnimNode_MeshSpaceRefPose                         AnimGraphNode_MeshRefPose;                                  // 0x0490   (0x0010)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x04A0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x05A8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x06B0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x07B8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x08C0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x09C8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0AD0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0BD8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0CE0   (0x0108)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x0DE8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0DF0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1230   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1670   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1AB0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1EF0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2330   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2770   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2BB0   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/13/ABP_SKM_V_HAIR_10_POS.ABP_SKM_V_HAIR_10_POS_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/13/ABP_SKM_V_HAIR_10_POS.ABP_SKM_V_HAIR_10_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_10_POS_AnimGraphNode_ModifyBone_A03430F0445F291DC800B28489971951
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_10_POS_AnimGraphNode_ModifyBone_A03430F0445F291DC800B28489971951(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/13/ABP_SKM_V_HAIR_10_POS.ABP_SKM_V_HAIR_10_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_10_POS_AnimGraphNode_ModifyBone_DB009B364974BB5AD2B0EBBBB7C534C2
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_10_POS_AnimGraphNode_ModifyBone_DB009B364974BB5AD2B0EBBBB7C534C2(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/13/ABP_SKM_V_HAIR_10_POS.ABP_SKM_V_HAIR_10_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_10_POS_AnimGraphNode_ModifyBone_4D035ED844F563948839C1BF435605A2
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_10_POS_AnimGraphNode_ModifyBone_4D035ED844F563948839C1BF435605A2(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/13/ABP_SKM_V_HAIR_10_POS.ABP_SKM_V_HAIR_10_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_10_POS_AnimGraphNode_ModifyBone_18B87B5644384C9A79C8C992C22994DD
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_10_POS_AnimGraphNode_ModifyBone_18B87B5644384C9A79C8C992C22994DD(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/13/ABP_SKM_V_HAIR_10_POS.ABP_SKM_V_HAIR_10_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_10_POS_AnimGraphNode_ModifyBone_90F67CFE48F017977619C2B311FD079E
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_10_POS_AnimGraphNode_ModifyBone_90F67CFE48F017977619C2B311FD079E(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/13/ABP_SKM_V_HAIR_10_POS.ABP_SKM_V_HAIR_10_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_10_POS_AnimGraphNode_ModifyBone_4E169B134C6FF8CD1E154D89962C7217
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_10_POS_AnimGraphNode_ModifyBone_4E169B134C6FF8CD1E154D89962C7217(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/13/ABP_SKM_V_HAIR_10_POS.ABP_SKM_V_HAIR_10_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_10_POS_AnimGraphNode_ModifyBone_81BF57C6496090D8658480B4E63F9939
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_10_POS_AnimGraphNode_ModifyBone_81BF57C6496090D8658480B4E63F9939(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/13/ABP_SKM_V_HAIR_10_POS.ABP_SKM_V_HAIR_10_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_10_POS_AnimGraphNode_ModifyBone_5E776A34482A8C52EDCFA8BA2B31CD92
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_10_POS_AnimGraphNode_ModifyBone_5E776A34482A8C52EDCFA8BA2B31CD92(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/13/ABP_SKM_V_HAIR_10_POS.ABP_SKM_V_HAIR_10_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_10_POS_AnimGraphNode_ModifyBone_572E80054F68B207789A82AD1C3BB41B
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_10_POS_AnimGraphNode_ModifyBone_572E80054F68B207789A82AD1C3BB41B(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/13/ABP_SKM_V_HAIR_10_POS.ABP_SKM_V_HAIR_10_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_10_POS_AnimGraphNode_ModifyBone_624BF7B047E15A43EE70E5B234B6DB24
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_10_POS_AnimGraphNode_ModifyBone_624BF7B047E15A43EE70E5B234B6DB24(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/13/ABP_SKM_V_HAIR_10_POS.ABP_SKM_V_HAIR_10_POS_C.ExecuteUbergraph_ABP_SKM_V_HAIR_10_POS
	void ExecuteUbergraph_ABP_SKM_V_HAIR_10_POS(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Brujah/Male/Hair/13/ABP_VMP_BRU_M_HAIR.ABP_VMP_BRU_M_HAIR_13_C
/// Size: 0x2280 (0x0002C0 - 0x002540)
class UABP_VMP_BRU_M_HAIR_13_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02C8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x02D0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0710   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0B50   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0F90   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x13D0   (0x0440)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x1810   (0x0030)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1840   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1C80   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x20C0   (0x0440)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x2500   (0x0020)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x2520   (0x0020)  


	/// Functions
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/13/ABP_VMP_BRU_M_HAIR.ABP_VMP_BRU_M_HAIR_13_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Brujah/Male/Hair/13/ABP_VMP_BRU_M_HAIR.ABP_VMP_BRU_M_HAIR_13_C.ExecuteUbergraph_ABP_VMP_BRU_M_HAIR
	void ExecuteUbergraph_ABP_VMP_BRU_M_HAIR(int32_t EntryPoint);                                                            // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Toreador/Female/Hair/05/ABP_SKM_V_HAIR_17_POS.ABP_SKM_V_HAIR_17_POS_C
/// Size: 0x4200 (0x000330 - 0x004530)
class UABP_SKM_V_HAIR_17_POS_C : public UTigerCharacterPoseableMeshAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0330   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0338   (0x0030)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0368   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0470   (0x0020)  
	FAnimNode_MeshSpaceRefPose                         AnimGraphNode_MeshRefPose;                                  // 0x0490   (0x0010)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x04A0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x05A8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x06B0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x07B8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x08C0   (0x0108)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x09C8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x09D0   (0x0440)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0E10   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0F18   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1020   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1128   (0x0108)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1230   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1670   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1AB0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1EF0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2330   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2770   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2BB0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2FF0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3430   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3870   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3CB0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x40F0   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/05/ABP_SKM_V_HAIR_17_POS.ABP_SKM_V_HAIR_17_POS_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/05/ABP_SKM_V_HAIR_17_POS.ABP_SKM_V_HAIR_17_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_17_POS_AnimGraphNode_ModifyBone_7CD5C54F403A29163E7202BD60D3462D
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_17_POS_AnimGraphNode_ModifyBone_7CD5C54F403A29163E7202BD60D3462D(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/05/ABP_SKM_V_HAIR_17_POS.ABP_SKM_V_HAIR_17_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_17_POS_AnimGraphNode_ModifyBone_B27E4EF646750E52AD0C829E27977822
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_17_POS_AnimGraphNode_ModifyBone_B27E4EF646750E52AD0C829E27977822(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/05/ABP_SKM_V_HAIR_17_POS.ABP_SKM_V_HAIR_17_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_17_POS_AnimGraphNode_ModifyBone_E2287C9546E5848A05ECD59074DFCEF8
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_17_POS_AnimGraphNode_ModifyBone_E2287C9546E5848A05ECD59074DFCEF8(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/05/ABP_SKM_V_HAIR_17_POS.ABP_SKM_V_HAIR_17_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_17_POS_AnimGraphNode_ModifyBone_B139B28E4053374833D94CAA9BACCE93
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_17_POS_AnimGraphNode_ModifyBone_B139B28E4053374833D94CAA9BACCE93(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/05/ABP_SKM_V_HAIR_17_POS.ABP_SKM_V_HAIR_17_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_17_POS_AnimGraphNode_ModifyBone_56D5752445CAC18904ECFB8C8C72DF45
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_17_POS_AnimGraphNode_ModifyBone_56D5752445CAC18904ECFB8C8C72DF45(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/05/ABP_SKM_V_HAIR_17_POS.ABP_SKM_V_HAIR_17_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_17_POS_AnimGraphNode_ModifyBone_4949BADC4A8D197D6F0A41AC3382811A
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_17_POS_AnimGraphNode_ModifyBone_4949BADC4A8D197D6F0A41AC3382811A(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/05/ABP_SKM_V_HAIR_17_POS.ABP_SKM_V_HAIR_17_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_17_POS_AnimGraphNode_ModifyBone_B018E0F64BEAB42F0998FFA8D0E08D76
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_17_POS_AnimGraphNode_ModifyBone_B018E0F64BEAB42F0998FFA8D0E08D76(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/05/ABP_SKM_V_HAIR_17_POS.ABP_SKM_V_HAIR_17_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_17_POS_AnimGraphNode_ModifyBone_752F4C3C40F70083D17D90B37CDD6FF8
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_17_POS_AnimGraphNode_ModifyBone_752F4C3C40F70083D17D90B37CDD6FF8(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/05/ABP_SKM_V_HAIR_17_POS.ABP_SKM_V_HAIR_17_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_17_POS_AnimGraphNode_ModifyBone_8B41E3DF44F273EBE7987585E6E17A2D
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_17_POS_AnimGraphNode_ModifyBone_8B41E3DF44F273EBE7987585E6E17A2D(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/05/ABP_SKM_V_HAIR_17_POS.ABP_SKM_V_HAIR_17_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_17_POS_AnimGraphNode_ModifyBone_96600CAD4ABC560EC82B83B7F009454E
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_17_POS_AnimGraphNode_ModifyBone_96600CAD4ABC560EC82B83B7F009454E(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/05/ABP_SKM_V_HAIR_17_POS.ABP_SKM_V_HAIR_17_POS_C.ExecuteUbergraph_ABP_SKM_V_HAIR_17_POS
	void ExecuteUbergraph_ABP_SKM_V_HAIR_17_POS(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Toreador/Male/Hair/05/ABP_VMP_TOR_M_HAIR_05.ABP_VMP_TOR_M_HAIR_05_C
/// Size: 0x2B00 (0x0002C0 - 0x002DC0)
class UABP_VMP_TOR_M_HAIR_05_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02C8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x02D0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0710   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0B50   (0x0440)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0F90   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0FB0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x13F0   (0x0440)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x1830   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1850   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1C90   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x20D0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2510   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2950   (0x0440)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x2D90   (0x0030)  


	/// Functions
	// Function /Game/Characters/Vampire/Toreador/Male/Hair/05/ABP_VMP_TOR_M_HAIR_05.ABP_VMP_TOR_M_HAIR_05_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Toreador/Male/Hair/05/ABP_VMP_TOR_M_HAIR_05.ABP_VMP_TOR_M_HAIR_05_C.ExecuteUbergraph_ABP_VMP_TOR_M_HAIR_05
	void ExecuteUbergraph_ABP_VMP_TOR_M_HAIR_05(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Toreador/Female/Hair/03/ABP_SKM_V_HAIR_15_POS.ABP_SKM_V_HAIR_15_POS_C
/// Size: 0x2CC0 (0x000330 - 0x002FF0)
class UABP_SKM_V_HAIR_15_POS_C : public UTigerCharacterPoseableMeshAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0330   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0338   (0x0030)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0368   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0470   (0x0020)  
	FAnimNode_MeshSpaceRefPose                         AnimGraphNode_MeshRefPose;                                  // 0x0490   (0x0010)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x04A0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x05A8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x06B0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x07B8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x08C0   (0x0108)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x09C8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x09D0   (0x0440)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0E10   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0F18   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1020   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1128   (0x0108)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1230   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1670   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1AB0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1EF0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2330   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2770   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2BB0   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/03/ABP_SKM_V_HAIR_15_POS.ABP_SKM_V_HAIR_15_POS_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/03/ABP_SKM_V_HAIR_15_POS.ABP_SKM_V_HAIR_15_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_15_POS_AnimGraphNode_ModifyBone_AAAB92DF4EA001DC2843878E1F31D4C6
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_15_POS_AnimGraphNode_ModifyBone_AAAB92DF4EA001DC2843878E1F31D4C6(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/03/ABP_SKM_V_HAIR_15_POS.ABP_SKM_V_HAIR_15_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_15_POS_AnimGraphNode_ModifyBone_0890A0C745E61BF165B0048BA324FDC6
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_15_POS_AnimGraphNode_ModifyBone_0890A0C745E61BF165B0048BA324FDC6(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/03/ABP_SKM_V_HAIR_15_POS.ABP_SKM_V_HAIR_15_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_15_POS_AnimGraphNode_ModifyBone_8E57C4B34BF7974AAD8603B83155C507
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_15_POS_AnimGraphNode_ModifyBone_8E57C4B34BF7974AAD8603B83155C507(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/03/ABP_SKM_V_HAIR_15_POS.ABP_SKM_V_HAIR_15_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_15_POS_AnimGraphNode_ModifyBone_264238234DFB7AE49BB8B4AD5D318331
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_15_POS_AnimGraphNode_ModifyBone_264238234DFB7AE49BB8B4AD5D318331(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/03/ABP_SKM_V_HAIR_15_POS.ABP_SKM_V_HAIR_15_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_15_POS_AnimGraphNode_ModifyBone_9D708BA74858EFC9C01E52800AB25656
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_15_POS_AnimGraphNode_ModifyBone_9D708BA74858EFC9C01E52800AB25656(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/03/ABP_SKM_V_HAIR_15_POS.ABP_SKM_V_HAIR_15_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_15_POS_AnimGraphNode_ModifyBone_726F8DC64D3F0C7B4A7226B206166F17
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_15_POS_AnimGraphNode_ModifyBone_726F8DC64D3F0C7B4A7226B206166F17(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/03/ABP_SKM_V_HAIR_15_POS.ABP_SKM_V_HAIR_15_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_15_POS_AnimGraphNode_ModifyBone_3F51E616450BA1718424F19270CA924C
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_15_POS_AnimGraphNode_ModifyBone_3F51E616450BA1718424F19270CA924C(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/03/ABP_SKM_V_HAIR_15_POS.ABP_SKM_V_HAIR_15_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_15_POS_AnimGraphNode_ModifyBone_D399FDEB41D07BBAB40788AA957254D1
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_15_POS_AnimGraphNode_ModifyBone_D399FDEB41D07BBAB40788AA957254D1(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/03/ABP_SKM_V_HAIR_15_POS.ABP_SKM_V_HAIR_15_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_15_POS_AnimGraphNode_ModifyBone_ECD36E2B4DDADFE09B38A9923E42078C
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_15_POS_AnimGraphNode_ModifyBone_ECD36E2B4DDADFE09B38A9923E42078C(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/03/ABP_SKM_V_HAIR_15_POS.ABP_SKM_V_HAIR_15_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_15_POS_AnimGraphNode_ModifyBone_F0E5B8FA4F6768314E61A480CB285461
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_15_POS_AnimGraphNode_ModifyBone_F0E5B8FA4F6768314E61A480CB285461(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/03/ABP_SKM_V_HAIR_15_POS.ABP_SKM_V_HAIR_15_POS_C.ExecuteUbergraph_ABP_SKM_V_HAIR_15_POS
	void ExecuteUbergraph_ABP_SKM_V_HAIR_15_POS(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Toreador/Male/Hair/04/ABP_VMP_TOR_M_HAIR_04.ABP_VMP_TOR_M_HAIR_04_C
/// Size: 0x4480 (0x0002C0 - 0x004740)
class UABP_VMP_TOR_M_HAIR_04_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02F8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0300   (0x0440)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0740   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0760   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0780   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0BC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1000   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1440   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1880   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1CC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2100   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2540   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2980   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2DC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3200   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3640   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3A80   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x3EC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x4300   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Toreador/Male/Hair/04/ABP_VMP_TOR_M_HAIR_04.ABP_VMP_TOR_M_HAIR_04_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Toreador/Male/Hair/04/ABP_VMP_TOR_M_HAIR_04.ABP_VMP_TOR_M_HAIR_04_C.ExecuteUbergraph_ABP_VMP_TOR_M_HAIR_04
	void ExecuteUbergraph_ABP_VMP_TOR_M_HAIR_04(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Brujah/Female/Hair/03/ABP_VMP_BRU_F_HAIR_03.ABP_VMP_BRU_F_HAIR_03_C
/// Size: 0x0D40 (0x0002C0 - 0x001000)
class UABP_VMP_BRU_F_HAIR_03_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02F8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0300   (0x0440)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0740   (0x0020)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0760   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0780   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0BC0   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/03/ABP_VMP_BRU_F_HAIR_03.ABP_VMP_BRU_F_HAIR_03_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Brujah/Female/Hair/03/ABP_VMP_BRU_F_HAIR_03.ABP_VMP_BRU_F_HAIR_03_C.ExecuteUbergraph_ABP_VMP_BRU_F_HAIR_03
	void ExecuteUbergraph_ABP_VMP_BRU_F_HAIR_03(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Toreador/Female/Hair/02/ABP_SKM_V_HAIR_14_POS.ABP_SKM_V_HAIR_14_POS_C
/// Size: 0x2CC0 (0x000330 - 0x002FF0)
class UABP_SKM_V_HAIR_14_POS_C : public UTigerCharacterPoseableMeshAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0330   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x0338   (0x0030)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0368   (0x0108)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x0470   (0x0020)  
	FAnimNode_MeshSpaceRefPose                         AnimGraphNode_MeshRefPose;                                  // 0x0490   (0x0010)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x04A0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x05A8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x06B0   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x07B8   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x08C0   (0x0108)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x09C8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x09D0   (0x0440)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0E10   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x0F18   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1020   (0x0108)  
	FAnimNode_ModifyBone                               AnimGraphNode_ModifyBone;                                   // 0x1128   (0x0108)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1230   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1670   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1AB0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1EF0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2330   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2770   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2BB0   (0x0440)  


	/// Functions
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/02/ABP_SKM_V_HAIR_14_POS.ABP_SKM_V_HAIR_14_POS_C.AnimGraph
	void AnimGraph(FPoseLink& AnimGraph);                                                                                    // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/02/ABP_SKM_V_HAIR_14_POS.ABP_SKM_V_HAIR_14_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_14_POS_AnimGraphNode_ModifyBone_F86F339E48E7CA8FC48C7C915D183C54
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_14_POS_AnimGraphNode_ModifyBone_F86F339E48E7CA8FC48C7C915D183C54(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/02/ABP_SKM_V_HAIR_14_POS.ABP_SKM_V_HAIR_14_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_14_POS_AnimGraphNode_ModifyBone_E8F423EA473BFDF3FD3C199604BF086F
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_14_POS_AnimGraphNode_ModifyBone_E8F423EA473BFDF3FD3C199604BF086F(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/02/ABP_SKM_V_HAIR_14_POS.ABP_SKM_V_HAIR_14_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_14_POS_AnimGraphNode_ModifyBone_FC343ABE4E51A1924F2A82ADC3885DBB
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_14_POS_AnimGraphNode_ModifyBone_FC343ABE4E51A1924F2A82ADC3885DBB(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/02/ABP_SKM_V_HAIR_14_POS.ABP_SKM_V_HAIR_14_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_14_POS_AnimGraphNode_ModifyBone_52EFA59E45A0DE02DC9AB7AAB8363C66
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_14_POS_AnimGraphNode_ModifyBone_52EFA59E45A0DE02DC9AB7AAB8363C66(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/02/ABP_SKM_V_HAIR_14_POS.ABP_SKM_V_HAIR_14_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_14_POS_AnimGraphNode_ModifyBone_6599E3F344939770742967B753D3E05D
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_14_POS_AnimGraphNode_ModifyBone_6599E3F344939770742967B753D3E05D(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/02/ABP_SKM_V_HAIR_14_POS.ABP_SKM_V_HAIR_14_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_14_POS_AnimGraphNode_ModifyBone_92C7B739407721DE49AE74B2B4FB56C3
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_14_POS_AnimGraphNode_ModifyBone_92C7B739407721DE49AE74B2B4FB56C3(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/02/ABP_SKM_V_HAIR_14_POS.ABP_SKM_V_HAIR_14_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_14_POS_AnimGraphNode_ModifyBone_E16495384039BF458AC4C98203569A1A
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_14_POS_AnimGraphNode_ModifyBone_E16495384039BF458AC4C98203569A1A(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/02/ABP_SKM_V_HAIR_14_POS.ABP_SKM_V_HAIR_14_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_14_POS_AnimGraphNode_ModifyBone_4691CE3D499F5AB0675B4BBBEC7430D9
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_14_POS_AnimGraphNode_ModifyBone_4691CE3D499F5AB0675B4BBBEC7430D9(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/02/ABP_SKM_V_HAIR_14_POS.ABP_SKM_V_HAIR_14_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_14_POS_AnimGraphNode_ModifyBone_C791E3B040E0C56E9B06B29F56F9736A
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_14_POS_AnimGraphNode_ModifyBone_C791E3B040E0C56E9B06B29F56F9736A(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/02/ABP_SKM_V_HAIR_14_POS.ABP_SKM_V_HAIR_14_POS_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_14_POS_AnimGraphNode_ModifyBone_2382CF884B3A30FB69B64EB966C67E45
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_SKM_V_HAIR_14_POS_AnimGraphNode_ModifyBone_2382CF884B3A30FB69B64EB966C67E45(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/Characters/Vampire/Toreador/Female/Hair/02/ABP_SKM_V_HAIR_14_POS.ABP_SKM_V_HAIR_14_POS_C.ExecuteUbergraph_ABP_SKM_V_HAIR_14_POS
	void ExecuteUbergraph_ABP_SKM_V_HAIR_14_POS(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/Characters/Vampire/Toreador/Male/Hair/06/ABP_VMP_TOR_M_HAIR_06.ABP_VMP_TOR_M_HAIR_06_C
/// Size: 0x3380 (0x0002C0 - 0x003640)
class UABP_VMP_TOR_M_HAIR_06_C : public UAnimInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	FAnimNode_Root                                     AnimGraphNode_Root;                                         // 0x02C8   (0x0030)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02F8   (0x0008)  MISSED
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0300   (0x0440)  
	FAnimNode_ConvertLocalToComponentSpace             AnimGraphNode_LocalToComponentSpace;                        // 0x0740   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0760   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0BA0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x0FE0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1420   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1860   (0x0440)  
	FAnimNode_ConvertComponentToLocalSpace             AnimGraphNode_ComponentToLocalSpace;                        // 0x1CA0   (0x0020)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x1CC0   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2100   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2540   (0x0440)  
	FAnimNode_AnimDynamics                             AnimGraphNode_AnimDynamics;                                 // 0x2980   (0x0440)  
