/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

/// Package GameBlueprints.

/// Class /Game/GameBlueprints/Props/TeleportMarker.TeleportMarker_C
/// Size: 0x0008 (0x000238 - 0x000240)
class ATeleportMarker_C : public AStaticMeshActor
{ 
public:
	UStaticMeshComponent*                              StaticMesh1;                                                // 0x0238   (0x0008)  
};

/// Class /Game/GameBlueprints/Camera/CameraShakes/TBP_CamShake_Slide.TBP_CamShake_Slide_C
/// Size: 0x0000 (0x000180 - 0x000180)
class UTBP_CamShake_Slide_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/PresetBlueprints/TBP_Gamepad_Aiming_Config.TBP_Gamepad_Aiming_Config_C
/// Size: 0x0000 (0x000128 - 0x000128)
class UTBP_Gamepad_Aiming_Config_C : public UTigerAimingCameraBehavior
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/CameraBehaviors/TBP_CameraBehavior_Spectate.TBP_CameraBehavior_Spectate_C
/// Size: 0x0000 (0x000178 - 0x000178)
class UTBP_CameraBehavior_Spectate_C : public UTigerSpectateCameraBehavior
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/PresetBlueprints/Other/TBP_CamConf_Ghost.TBP_CamConf_Ghost_C
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UTBP_CamConf_Ghost_C : public UTigerCameraPreset
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/PresetBlueprints/Other/TBP_CamConf_Feeding.TBP_CamConf_Feeding_C
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UTBP_CamConf_Feeding_C : public UTigerCameraPreset
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/PresetBlueprints/Other/TBP_CamConf_Diablerize.TBP_CamConf_Diablerize_C
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UTBP_CamConf_Diablerize_C : public UTigerCameraPreset
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/PresetBlueprints/Other/TBP_Cam_Conf_DialogueInteraction.TBP_Cam_Conf_DialogueInteraction_C
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UTBP_Cam_Conf_DialogueInteraction_C : public UTigerCameraPreset
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/PresetBlueprints/Main/TBP_CamConf_Main.TBP_CamConf_Main_C
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UTBP_CamConf_Main_C : public UTigerCameraPreset
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/PresetBlueprints/Main/Actions/TBP_CamConf_Spectate.TBP_CamConf_Spectate_C
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UTBP_CamConf_Spectate_C : public UTigerCameraPreset
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/PresetBlueprints/Main/Actions/TBP_CamConf_SharkDeath.TBP_CamConf_SharkDeath_C
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UTBP_CamConf_SharkDeath_C : public UTigerCameraPreset
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/PresetBlueprints/Main/Actions/TBP_CamConf_Scoped.TBP_CamConf_Scoped_C
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UTBP_CamConf_Scoped_C : public UTigerCameraPreset
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/PresetBlueprints/Main/Actions/TBP_CamConf_MeleeCombat.TBP_CamConf_MeleeCombat_C
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UTBP_CamConf_MeleeCombat_C : public UTigerCameraPreset
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/PresetBlueprints/Main/Actions/TBP_CamConf_Indoor.TBP_CamConf_Indoor_C
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UTBP_CamConf_Indoor_C : public UTBP_CamConf_Main_C
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/PresetBlueprints/Main/Actions/TBP_CamConf_Downed.TBP_CamConf_Downed_C
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UTBP_CamConf_Downed_C : public UTigerCameraPreset
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/PresetBlueprints/Main/Actions/TBP_CamConf_Climbing.TBP_CamConf_Climbing_C
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UTBP_CamConf_Climbing_C : public UTigerCameraPreset
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/PresetBlueprints/Main/Actions/TBP_CamConf_AirDash.TBP_CamConf_AirDash_C
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UTBP_CamConf_AirDash_C : public UTigerCameraPreset
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/PresetBlueprints/Main/Actions/TBP_CamConf_AimingAndSliding.TBP_CamConf_AimingAndSliding_C
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UTBP_CamConf_AimingAndSliding_C : public UTigerCameraPreset
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/PresetBlueprints/Additive/TBP_CamConf_Additive_Sliding.TBP_CamConf_Additive_Sliding_C
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UTBP_CamConf_Additive_Sliding_C : public UTigerCameraPreset
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/PresetBlueprints/Additive/TBP_CamConf_Additive_Running.TBP_CamConf_Additive_Running_C
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UTBP_CamConf_Additive_Running_C : public UTigerCameraPreset
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/PresetBlueprints/Additive/TBP_CamConf_Additive_Crouching.TBP_CamConf_Additive_Crouching_C
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UTBP_CamConf_Additive_Crouching_C : public UTigerCameraPreset
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/PresetBlueprints/Additive/TBP_CamConf_Additive_Combat.TBP_CamConf_Additive_Combat_C
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UTBP_CamConf_Additive_Combat_C : public UTigerCameraPreset
{ 
public:
};

/// Class /Game/GameBlueprints/Player/TBP_TigerPlayerCameraManager.TBP_TigerPlayerCameraManager_C
/// Size: 0x0008 (0x002940 - 0x002948)
class ATBP_TigerPlayerCameraManager_C : public ATigerPlayerCameraManager
{ 
public:
	float                                              HighSpeedCameraTreshold;                                    // 0x2940   (0x0004)  
	float                                              MinMoveSpeedForMeleeCamera;                                 // 0x2944   (0x0004)  


	/// Functions
	// Function /Game/GameBlueprints/Player/TBP_TigerPlayerCameraManager.TBP_TigerPlayerCameraManager_C.OnChangingCameraPreset
	void OnChangingCameraPreset(UClass* InCurrentCameraPresetClass, UClass* InNewCameraPresetClass);                         // [0x197e4f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/TBP_TigerPlayerCameraManager.TBP_TigerPlayerCameraManager_C.SelectPresetTransitionCurve
	UCurveFloat* SelectPresetTransitionCurve(UTigerCameraPreset* InPreviousPreset, UTigerCameraPreset* InNewPreset);         // [0x197e4f0] Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/TBP_TigerPlayerCameraManager.TBP_TigerPlayerCameraManager_C.EvaluateCameraPreset
	UClass* EvaluateCameraPreset();                                                                                          // [0x197e4f0] Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/GameBlueprints/TBP_GameSingleton.TBP_GameSingleton_C
/// Size: 0x0000 (0x000078 - 0x000078)
class UTBP_GameSingleton_C : public UTigerGameSingleton
{ 
public:
};

/// Class /Game/GameBlueprints/Player/Passives/TBP_Enraged.TBP_Enraged_C
/// Size: 0x001C (0x000230 - 0x00024C)
class ATBP_Enraged_C : public ATigerEnragedEffectActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0230   (0x0008)  
	UParticleSystemComponent*                          RegeneratingEmitter;                                        // 0x0238   (0x0008)  
	USceneComponent*                                   DefaultSceneRoot;                                           // 0x0240   (0x0008)  
	int32_t                                            EnrageAkEventID;                                            // 0x0248   (0x0004)  


	/// Functions
	// Function /Game/GameBlueprints/Player/Passives/TBP_Enraged.TBP_Enraged_C.PlayEnrageAudio
	void PlayEnrageAudio();                                                                                                  // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/Passives/TBP_Enraged.TBP_Enraged_C.StopEnrageAudio
	void StopEnrageAudio();                                                                                                  // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/Passives/TBP_Enraged.TBP_Enraged_C.OnRegenStarted
	void OnRegenStarted();                                                                                                   // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/Passives/TBP_Enraged.TBP_Enraged_C.OnRegenStopped
	void OnRegenStopped();                                                                                                   // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/Passives/TBP_Enraged.TBP_Enraged_C.ReceiveEndPlay
	void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason);                                                          // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/Passives/TBP_Enraged.TBP_Enraged_C.ExecuteUbergraph_TBP_Enraged
	void ExecuteUbergraph_TBP_Enraged(int32_t EntryPoint);                                                                   // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/GameBlueprints/Buffs/Archetypes/Outlaw/TBP_Buff_AdrenalineRush.TBP_Buff_AdrenalineRush_C
/// Size: 0x0000 (0x000268 - 0x000268)
class UTBP_Buff_AdrenalineRush_C : public UTigerBuffAdrenalineRush
{ 
public:
};

/// Class /Game/GameBlueprints/Character/Customization/Brujah/BodyTypes/TBP_BodyType_Bru_M.TBP_BodyType_Bru_M_C
/// Size: 0x0000 (0x0001C8 - 0x0001C8)
class UTBP_BodyType_Bru_M_C : public UTigerCharacterBodyTypeCustomization
{ 
public:
};

/// Class /Game/GameBlueprints/Character/Customization/Brujah/BodyTypes/TBP_BodyType_Bru_F.TBP_BodyType_Bru_F_C
/// Size: 0x0000 (0x0001C8 - 0x0001C8)
class UTBP_BodyType_Bru_F_C : public UTigerCharacterBodyTypeCustomization
{ 
public:
};

/// Class /Game/GameBlueprints/Character/Customization/Epsilon/BodyTypes/TBP_BodyType_Eps_M.TBP_BodyType_Eps_M_C
/// Size: 0x0000 (0x0001C8 - 0x0001C8)
class UTBP_BodyType_Eps_M_C : public UTigerCharacterBodyTypeCustomization
{ 
public:
};

/// Class /Game/GameBlueprints/Character/Customization/Epsilon/BodyTypes/TBP_BodyType_Eps_F.TBP_BodyType_Eps_F_C
/// Size: 0x0000 (0x0001C8 - 0x0001C8)
class UTBP_BodyType_Eps_F_C : public UTigerCharacterBodyTypeCustomization
{ 
public:
};

/// Class /Game/GameBlueprints/Powers/Nosferatu/Prowler/TBP_AnAcquiredTaste.TBP_AnAcquiredTaste_C
/// Size: 0x000C (0x0000C8 - 0x0000D4)
class UTBP_AnAcquiredTaste_C : public UTigerPassiveComponent
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00C8   (0x0008)  
	int32_t                                            Stacks;                                                     // 0x00D0   (0x0004)  


	/// Functions
	// Function /Game/GameBlueprints/Powers/Nosferatu/Prowler/TBP_AnAcquiredTaste.TBP_AnAcquiredTaste_C.OnCreated
	void OnCreated(ATigerPlayer* InPlayer, bool InHasAuthority);                                                             // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Nosferatu/Prowler/TBP_AnAcquiredTaste.TBP_AnAcquiredTaste_C.OnPlayerEvent
	void OnPlayerEvent(ETigerPlayerEvent Event, ATigerCharacter* EventTiedCharacter);                                        // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Nosferatu/Prowler/TBP_AnAcquiredTaste.TBP_AnAcquiredTaste_C.ExecuteUbergraph_TBP_AnAcquiredTaste
	void ExecuteUbergraph_TBP_AnAcquiredTaste(int32_t EntryPoint);                                                           // [0x197e4f0] Final                
};

/// Class /Game/GameBlueprints/Player/Passives/TBP_BestialTrailPart_SplineMesh.TBP_BestialTrailPart_SplineMesh_C
/// Size: 0x0010 (0x000580 - 0x000590)
class UTBP_BestialTrailPart_SplineMesh_C : public UTigerBestialTrailPart
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0580   (0x0008)  
	ATigerBestialTrailVisualizer*                      Visualizer;                                                 // 0x0588   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/Player/Passives/TBP_BestialTrailPart_SplineMesh.TBP_BestialTrailPart_SplineMesh_C.Setup
	void Setup(FVector Start Location, FVector End Location, FVector End Tangent, float New Dissappear Time Stamp);          // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/Passives/TBP_BestialTrailPart_SplineMesh.TBP_BestialTrailPart_SplineMesh_C.ScheduleFade
	void ScheduleFade(float Dissappear At);                                                                                  // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/Passives/TBP_BestialTrailPart_SplineMesh.TBP_BestialTrailPart_SplineMesh_C.Fade Out
	void Fade Out();                                                                                                         // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/Passives/TBP_BestialTrailPart_SplineMesh.TBP_BestialTrailPart_SplineMesh_C.ExecuteUbergraph_TBP_BestialTrailPart_SplineMesh
	void ExecuteUbergraph_TBP_BestialTrailPart_SplineMesh(int32_t EntryPoint);                                               // [0x197e4f0] Final                
};

/// Class /Game/GameBlueprints/Player/Passives/TBP_BestialTrailVisualizer_DebugLines.TBP_BestialTrailVisualizer_DebugLines_C
/// Size: 0x0090 (0x000240 - 0x0002D0)
class ATBP_BestialTrailVisualizer_DebugLines_C : public ATigerBestialTrailVisualizer
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0240   (0x0008)  
	USceneComponent*                                   DefaultSceneRoot;                                           // 0x0248   (0x0008)  
	FTigerPlayerSavedLocation                          PreviousPoint;                                              // 0x0250   (0x0010)  
	FTigerPlayerSavedLocation                          SecondLocation;                                             // 0x0260   (0x0010)  
	UTigerNosferatuPassiveBestialConfig*               Config;                                                     // 0x0270   (0x0008)  
	UTBP_BestialTrailPart_SplineMesh_C*                Latest_Part;                                                // 0x0278   (0x0008)  
	int32_t                                            Number_of_Received_Points;                                  // 0x0280   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0284   (0x0004)  MISSED
	UNiagaraComponent*                                 NewVar;                                                     // 0x0288   (0x0008)  
	FVector                                            3rdPos;                                                     // 0x0290   (0x000C)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x029C   (0x0004)  MISSED
	UNiagaraComponent*                                 PreviousNiagaraBeam;                                        // 0x02A0   (0x0008)  
	float                                              PreviousSpawnTime;                                          // 0x02A8   (0x0004)  
	float                                              PreviousPointNumber;                                        // 0x02AC   (0x0004)  
	FSoftObjectPath                                    NiagaraPath;                                                // 0x02B0   (0x0018)  
	UTBP_AnAcquiredTaste_C*                            Passive_Component;                                          // 0x02C8   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/Player/Passives/TBP_BestialTrailVisualizer_DebugLines.TBP_BestialTrailVisualizer_DebugLines_C.Decide LifeTime
	void Decide LifeTime(float ExtraLifeTimePerStack, float& FinalLifeTime);                                                 // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/Passives/TBP_BestialTrailVisualizer_DebugLines.TBP_BestialTrailVisualizer_DebugLines_C.AddPoint
	void AddPoint(FTigerPlayerSavedLocation New Location);                                                                   // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/Passives/TBP_BestialTrailVisualizer_DebugLines.TBP_BestialTrailVisualizer_DebugLines_C.BeginEndTracking
	void BeginEndTracking();                                                                                                 // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/Passives/TBP_BestialTrailVisualizer_DebugLines.TBP_BestialTrailVisualizer_DebugLines_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/Passives/TBP_BestialTrailVisualizer_DebugLines.TBP_BestialTrailVisualizer_DebugLines_C.ReceiveInitialTrackingPoints
	void ReceiveInitialTrackingPoints(TArray<FTigerPlayerSavedLocation>& Locations, ATigerPlayer* TrackedPlayer);            // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/Passives/TBP_BestialTrailVisualizer_DebugLines.TBP_BestialTrailVisualizer_DebugLines_C.ReceiveNewTrackingPoint
	void ReceiveNewTrackingPoint(FTigerPlayerSavedLocation& NewLocation);                                                    // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/Passives/TBP_BestialTrailVisualizer_DebugLines.TBP_BestialTrailVisualizer_DebugLines_C.ExecuteUbergraph_TBP_BestialTrailVisualizer_DebugLines
	void ExecuteUbergraph_TBP_BestialTrailVisualizer_DebugLines(int32_t EntryPoint);                                         // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/GameBlueprints/Buffs/Archetypes/Prowler/TBP_Buff_SenseTheBeast.TBP_Buff_SenseTheBeast_C
/// Size: 0x0000 (0x000268 - 0x000268)
class UTBP_Buff_SenseTheBeast_C : public UTigerTrackedBuff
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/Archetypes/Saboteur/TBP_UnseenPresenceBuffInstance.TBP_UnseenPresenceBuffInstance_C
/// Size: 0x000C (0x000090 - 0x00009C)
class UTBP_UnseenPresenceBuffInstance_C : public UTigerBuffUnseenPresenceInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0090   (0x0008)  
	float                                              CurrentOpacity;                                             // 0x0098   (0x0004)  


	/// Functions
	// Function /Game/GameBlueprints/Buffs/Archetypes/Saboteur/TBP_UnseenPresenceBuffInstance.TBP_UnseenPresenceBuffInstance_C.UpdateInvisibilityMaterial
	void UpdateInvisibilityMaterial(float DeltaTime, ATigerPlayer* Player, UMaterialInstanceDynamic* MaterialInstance);      // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Buffs/Archetypes/Saboteur/TBP_UnseenPresenceBuffInstance.TBP_UnseenPresenceBuffInstance_C.ExecuteUbergraph_TBP_UnseenPresenceBuffInstance
	void ExecuteUbergraph_TBP_UnseenPresenceBuffInstance(int32_t EntryPoint);                                                // [0x197e4f0] Final                
};

/// Class /Game/GameBlueprints/Buffs/Archetypes/Saboteur/TBP_UnseenPresenceBuff.TBP_UnseenPresenceBuff_C
/// Size: 0x0000 (0x000280 - 0x000280)
class UTBP_UnseenPresenceBuff_C : public UTigerBuffUnseenPresence
{ 
public:
};

/// Class /Game/GameBlueprints/Character/Customization/Nosferatu/BodyType/TBP_BodyType_Nos_M.TBP_BodyType_Nos_M_C
/// Size: 0x0000 (0x0001C8 - 0x0001C8)
class UTBP_BodyType_Nos_M_C : public UTigerCharacterBodyTypeCustomization
{ 
public:
};

/// Class /Game/GameBlueprints/Character/Customization/Nosferatu/BodyType/TBP_BodyType_Nos_F.TBP_BodyType_Nos_F_C
/// Size: 0x0000 (0x0001C8 - 0x0001C8)
class UTBP_BodyType_Nos_F_C : public UTigerCharacterBodyTypeCustomization
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/Archetypes/Siren/TBP_Buff_KindredCharm_Npc.TBP_Buff_KindredCharm_Npc_C
/// Size: 0x0008 (0x000268 - 0x000270)
class UTBP_Buff_KindredCharm_Npc_C : public UTigerBuffKindredCharm
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0268   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/Buffs/Archetypes/Siren/TBP_Buff_KindredCharm_Npc.TBP_Buff_KindredCharm_Npc_C.OnActivated
	void OnActivated(ATigerCharacter* InBuffOwner, ATigerCharacter* InBuffCaster);                                           // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Buffs/Archetypes/Siren/TBP_Buff_KindredCharm_Npc.TBP_Buff_KindredCharm_Npc_C.OnDeactivated
	void OnDeactivated(ATigerCharacter* InBuffOwner, ATigerCharacter* InBuffCaster);                                         // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Buffs/Archetypes/Siren/TBP_Buff_KindredCharm_Npc.TBP_Buff_KindredCharm_Npc_C.ExecuteUbergraph_TBP_Buff_KindredCharm_Npc
	void ExecuteUbergraph_TBP_Buff_KindredCharm_Npc(int32_t EntryPoint);                                                     // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/GameBlueprints/Character/Customization/Toreador/BodyType/TBP_BodyType_Tor_M.TBP_BodyType_Tor_M_C
/// Size: 0x0000 (0x0001C8 - 0x0001C8)
class UTBP_BodyType_Tor_M_C : public UTigerCharacterBodyTypeCustomization
{ 
public:
};

/// Class /Game/GameBlueprints/Character/Customization/Toreador/BodyType/TBP_BodyType_Tor_F.TBP_BodyType_Tor_F_C
/// Size: 0x0000 (0x0001C8 - 0x0001C8)
class UTBP_BodyType_Tor_F_C : public UTigerCharacterBodyTypeCustomization
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/CameraShakes/TBP_CamShake_Hard_Landing.TBP_CamShake_Hard_Landing_C
/// Size: 0x0000 (0x000180 - 0x000180)
class UTBP_CamShake_Hard_Landing_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/PresetBlueprints/Other/TBP_CamConf_Death.TBP_CamConf_Death_C
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UTBP_CamConf_Death_C : public UTigerCameraPreset
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/CameraShakes/TBP_CamShake_WallGrind.TBP_CamShake_WallGrind_C
/// Size: 0x0000 (0x000180 - 0x000180)
class UTBP_CamShake_WallGrind_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/GameBlueprints/VFX/Traversal/TBP_WallClimbEffect.TBP_WallClimbEffect_C
/// Size: 0x0008 (0x000028 - 0x000030)
class UTBP_WallClimbEffect_C : public UTigerCharacterEffect
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0028   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/VFX/Traversal/TBP_WallClimbEffect.TBP_WallClimbEffect_C.HandleVFX
	void HandleVFX(UObject* WorldContextObject, UParticleSystem* ParticleSystem, UMaterialInterface* Decal, FVector VFXLocation, FRotator ParticleRotation, FRotator DecalRotation); // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/VFX/Traversal/TBP_WallClimbEffect.TBP_WallClimbEffect_C.ApplyWithSocket
	void ApplyWithSocket(ATigerCharacter* Character, FName SocketName);                                                      // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/VFX/Traversal/TBP_WallClimbEffect.TBP_WallClimbEffect_C.ExecuteUbergraph_TBP_WallClimbEffect
	void ExecuteUbergraph_TBP_WallClimbEffect(int32_t EntryPoint);                                                           // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/GameBlueprints/Buffs/Archetypes/TBP_Buff_Slowed_VentruePassive.TBP_Buff_Slowed_VentruePassive_C
/// Size: 0x0014 (0x000268 - 0x00027C)
class UTBP_Buff_Slowed_VentruePassive_C : public UTigerAreaBuff
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0268   (0x0008)  
	FVector                                            SlowColor;                                                  // 0x0270   (0x000C)  


	/// Functions
	// Function /Game/GameBlueprints/Buffs/Archetypes/TBP_Buff_Slowed_VentruePassive.TBP_Buff_Slowed_VentruePassive_C.OnActivated
	void OnActivated(ATigerCharacter* InBuffOwner, ATigerCharacter* InBuffCaster);                                           // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Buffs/Archetypes/TBP_Buff_Slowed_VentruePassive.TBP_Buff_Slowed_VentruePassive_C.OnDeactivated
	void OnDeactivated(ATigerCharacter* InBuffOwner, ATigerCharacter* InBuffCaster);                                         // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Buffs/Archetypes/TBP_Buff_Slowed_VentruePassive.TBP_Buff_Slowed_VentruePassive_C.ExecuteUbergraph_TBP_Buff_Slowed_VentruePassive
	void ExecuteUbergraph_TBP_Buff_Slowed_VentruePassive(int32_t EntryPoint);                                                // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/GameBlueprints/Player/ArchetypePassives/TBP_Passive_VentrueTwo.TBP_Passive_VentrueTwo_C
/// Size: 0x0008 (0x000178 - 0x000180)
class UTBP_Passive_VentrueTwo_C : public UTigerPassiveArchetypeLogic
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0178   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/Player/ArchetypePassives/TBP_Passive_VentrueTwo.TBP_Passive_VentrueTwo_C.OnCreated
	void OnCreated(ATigerPlayer* InPlayer, bool InHasAuthority);                                                             // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/ArchetypePassives/TBP_Passive_VentrueTwo.TBP_Passive_VentrueTwo_C.OnFeedingDone
	void OnFeedingDone(bool bTargetIsDrained, ATigerCharacter* InTargetFedOn);                                               // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/ArchetypePassives/TBP_Passive_VentrueTwo.TBP_Passive_VentrueTwo_C.OnPlayerEvent
	void OnPlayerEvent(ETigerPlayerEvent Event, ATigerCharacter* EventTiedCharacter);                                        // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/ArchetypePassives/TBP_Passive_VentrueTwo.TBP_Passive_VentrueTwo_C.ExecuteUbergraph_TBP_Passive_VentrueTwo
	void ExecuteUbergraph_TBP_Passive_VentrueTwo(int32_t EntryPoint);                                                        // [0x197e4f0] Final                
};

/// Class /Game/GameBlueprints/Character/Customization/Ventrue/BodyTypes/TBP_BodyType_Ven_M.TBP_BodyType_Ven_M_C
/// Size: 0x0000 (0x0001C8 - 0x0001C8)
class UTBP_BodyType_Ven_M_C : public UTigerCharacterBodyTypeCustomization
{ 
public:
};

/// Class /Game/GameBlueprints/Character/Customization/Ventrue/BodyTypes/TBP_BodyType_Ven_F.TBP_BodyType_Ven_F_C
/// Size: 0x0000 (0x0001C8 - 0x0001C8)
class UTBP_BodyType_Ven_F_C : public UTigerCharacterBodyTypeCustomization
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/CameraShakes/TBP_CamShake_Fall_Low.TBP_CamShake_Fall_Low_C
/// Size: 0x0000 (0x000180 - 0x000180)
class UTBP_CamShake_Fall_Low_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/CameraShakes/TBP_CamShake_Fall_High.TBP_CamShake_Fall_High_C
/// Size: 0x0000 (0x000180 - 0x000180)
class UTBP_CamShake_Fall_High_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/CameraShakes/TBP_CamShake_Walk.TBP_CamShake_Walk_C
/// Size: 0x0000 (0x000180 - 0x000180)
class UTBP_CamShake_Walk_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/CameraShakes/TBP_CamShake_Slide_Recoil.TBP_CamShake_Slide_Recoil_C
/// Size: 0x0000 (0x000180 - 0x000180)
class UTBP_CamShake_Slide_Recoil_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/CameraShakes/TBP_CamShake_MightyLeap.TBP_CamShake_MightyLeap_C
/// Size: 0x0000 (0x000180 - 0x000180)
class UTBP_CamShake_MightyLeap_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/CameraShakes/TBP_CamShake_Landing_Big.TBP_CamShake_Landing_Big_C
/// Size: 0x0000 (0x000180 - 0x000180)
class UTBP_CamShake_Landing_Big_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/GameBlueprints/VFX/Traversal/TBP_WallJumpEffect.TBP_WallJumpEffect_C
/// Size: 0x0008 (0x000028 - 0x000030)
class UTBP_WallJumpEffect_C : public UTigerCharacterEffect
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0028   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/VFX/Traversal/TBP_WallJumpEffect.TBP_WallJumpEffect_C.HandleVFX
	void HandleVFX(UObject* WorldContextObject, UParticleSystem* ParticleSystem, UMaterialInterface* Decal, FVector VFXLocation, FRotator ParticleRotation, FRotator DecalRotation); // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/VFX/Traversal/TBP_WallJumpEffect.TBP_WallJumpEffect_C.ApplyWithSocket
	void ApplyWithSocket(ATigerCharacter* Character, FName SocketName);                                                      // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/VFX/Traversal/TBP_WallJumpEffect.TBP_WallJumpEffect_C.ExecuteUbergraph_TBP_WallJumpEffect
	void ExecuteUbergraph_TBP_WallJumpEffect(int32_t EntryPoint);                                                            // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/GameBlueprints/TBP_MeleeAttack_Shake_Air.TBP_MeleeAttack_Shake_Air_C
/// Size: 0x0000 (0x000180 - 0x000180)
class UTBP_MeleeAttack_Shake_Air_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/Archetypes/Muse/NightingaleBuffs/TBP_Buff_Heal.TBP_Buff_Heal_C
/// Size: 0x000C (0x000268 - 0x000274)
class UTBP_Buff_Heal_C : public UTigerBuff
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0268   (0x0008)  
	float                                              In_Heal_Amount;                                             // 0x0270   (0x0004)  


	/// Functions
	// Function /Game/GameBlueprints/Buffs/Archetypes/Muse/NightingaleBuffs/TBP_Buff_Heal.TBP_Buff_Heal_C.SetShaderParameters
	void SetShaderParameters(ATigerCharacter* InOwner);                                                                      // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Buffs/Archetypes/Muse/NightingaleBuffs/TBP_Buff_Heal.TBP_Buff_Heal_C.OnActivated
	void OnActivated(ATigerCharacter* InBuffOwner, ATigerCharacter* InBuffCaster);                                           // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Buffs/Archetypes/Muse/NightingaleBuffs/TBP_Buff_Heal.TBP_Buff_Heal_C.OnDeactivated
	void OnDeactivated(ATigerCharacter* InBuffOwner, ATigerCharacter* InBuffCaster);                                         // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Buffs/Archetypes/Muse/NightingaleBuffs/TBP_Buff_Heal.TBP_Buff_Heal_C.OnRefreshed
	void OnRefreshed(ATigerCharacter* InBuffOwner, ATigerCharacter* InBuffCaster);                                           // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Buffs/Archetypes/Muse/NightingaleBuffs/TBP_Buff_Heal.TBP_Buff_Heal_C.ExecuteUbergraph_TBP_Buff_Heal
	void ExecuteUbergraph_TBP_Buff_Heal(int32_t EntryPoint);                                                                 // [0x197e4f0] Final                
};

/// Class /Game/GameBlueprints/Camera/CameraShakes/TBP_CamShake_Downed.TBP_CamShake_Downed_C
/// Size: 0x0000 (0x000180 - 0x000180)
class UTBP_CamShake_Downed_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/GameBlueprints/Weapons/MeleeWeapons/TBP_MeleeCombatLogic_RootMotion.TBP_MeleeCombatLogic_RootMotion_C
/// Size: 0x0000 (0x000078 - 0x000078)
class UTBP_MeleeCombatLogic_RootMotion_C : public UTigerMeleeAimAssistBehavior
{ 
public:
};

/// Class /Game/GameBlueprints/Weapons/MeleeWeapons/MeleeWeaponBlueprints/BPI_MeleeWeapon.BPI_MeleeWeapon_C
/// Size: 0x0000 (0x000028 - 0x000028)
class UBPI_MeleeWeapon_C : public UInterface
{ 
public:
};

/// Class /Game/GameBlueprints/Weapons/MeleeWeapons/MeleeWeaponBlueprints/TBP_MeleeWeapon_Master.TBP_MeleeWeapon_Master_C
/// Size: 0x0061 (0x0001A0 - 0x000201)
class UTBP_MeleeWeapon_Master_C : public UTigerMeleeWeapon
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x01A0   (0x0008)  
	TMap<TEnumAsByte, FName>                           WeaponToAudioName;                                          // 0x01A8   (0x0050)  
	TEnumAsByte<ENUM_MeleeWeaponCategories>            AnimMeleeWeaponCategory;                                    // 0x01F8   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x01F9   (0x0003)  MISSED
	float                                              LifestealMultiplier;                                        // 0x01FC   (0x0004)  
	ETigerWeaponMeleeAttackType                        Attack_Type;                                                // 0x0200   (0x0001)  


	/// Functions
	// Function /Game/GameBlueprints/Weapons/MeleeWeapons/MeleeWeaponBlueprints/TBP_MeleeWeapon_Master.TBP_MeleeWeapon_Master_C.GetMeleeWeaponCategory
	void GetMeleeWeaponCategory(TEnumAsByte<ENUM_MeleeWeaponCategories>& MeleeWeaponCategory);                               // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/MeleeWeapons/MeleeWeaponBlueprints/TBP_MeleeWeapon_Master.TBP_MeleeWeapon_Master_C.OnHitFunction
	void OnHitFunction(ATigerCharacter* Instigator, ATigerCharacter* Target, float Damage);                                  // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/MeleeWeapons/MeleeWeaponBlueprints/TBP_MeleeWeapon_Master.TBP_MeleeWeapon_Master_C.OnWorldObjectHit
	void OnWorldObjectHit(ATigerCharacter* InInstigator, FHitResult& InWorldObjectHitResult, FVector& InSwingDirection);     // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/MeleeWeapons/MeleeWeaponBlueprints/TBP_MeleeWeapon_Master.TBP_MeleeWeapon_Master_C.OnHit
	void OnHit(ATigerCharacter* Instigator, ATigerCharacter* Target, ETigerWeaponMeleeAttackType AttackType, float Damage);  // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/MeleeWeapons/MeleeWeaponBlueprints/TBP_MeleeWeapon_Master.TBP_MeleeWeapon_Master_C.ExecuteUbergraph_TBP_MeleeWeapon_Master
	void ExecuteUbergraph_TBP_MeleeWeapon_Master(int32_t EntryPoint);                                                        // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/GameBlueprints/Camera/CameraShakes/TBP_CamShake_MeleeAttack.TBP_CamShake_MeleeAttack_C
/// Size: 0x0000 (0x000180 - 0x000180)
class UTBP_CamShake_MeleeAttack_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/GameBlueprints/Weapons/RangedWeapons/TBFL_SpreadPatternHelpers.TBFL_SpreadPatternHelpers_C
/// Size: 0x0000 (0x000028 - 0x000028)
class UTBFL_SpreadPatternHelpers_C : public UBlueprintFunctionLibrary
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/CameraShakes/TBP_CamShake_AKS74UFireAimed.TBP_CamShake_AKS74UFireAimed_C
/// Size: 0x0000 (0x000180 - 0x000180)
class UTBP_CamShake_AKS74UFireAimed_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/CameraShakes/TBP_CamShake_AKS74UFire.TBP_CamShake_AKS74UFire_C
/// Size: 0x0000 (0x000180 - 0x000180)
class UTBP_CamShake_AKS74UFire_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/GameBlueprints/World/I_Destruction.I_Destruction_C
/// Size: 0x0000 (0x000028 - 0x000028)
class UI_Destruction_C : public UInterface
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/Items/TBP_CrossbowGas.TBP_CrossbowGas_C
/// Size: 0x0000 (0x000278 - 0x000278)
class UTBP_CrossbowGas_C : public UTigerBuffDOT
{ 
public:
};

/// Class /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_Spread.TBP_Modifier_Spread_1_C
/// Size: 0x000C (0x000028 - 0x000034)
class UTBP_Modifier_Spread_1_C : public UTigerRangedWeaponModModifier
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0028   (0x0008)  
	float                                              SpreadModifier;                                             // 0x0030   (0x0004)  


	/// Functions
	// Function /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_Spread.TBP_Modifier_Spread_1_C.OnModEquipped
	void OnModEquipped(UTigerEquippedModModifierValues* Modifiers);                                                          // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_Spread.TBP_Modifier_Spread_1_C.OnModUnequipped
	void OnModUnequipped(UTigerEquippedModModifierValues* Modifiers);                                                        // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_Spread.TBP_Modifier_Spread_1_C.ExecuteUbergraph_TBP_Modifier_Spread
	void ExecuteUbergraph_TBP_Modifier_Spread(int32_t EntryPoint);                                                           // [0x197e4f0] Final                
};

/// Class /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_Spread.TBP_Modifier_Spread_2_C
/// Size: 0x0000 (0x000034 - 0x000034)
class UTBP_Modifier_Spread_2_C : public UTBP_Modifier_Spread_1_C
{ 
public:
};

/// Class /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_Spread.TBP_Modifier_Spread_3_C
/// Size: 0x0000 (0x000034 - 0x000034)
class UTBP_Modifier_Spread_3_C : public UTBP_Modifier_Spread_1_C
{ 
public:
};

/// Class /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_EnableFireModeSwitch.TBP_Modifier_EnableFireModeSwitch_C
/// Size: 0x0008 (0x000028 - 0x000030)
class UTBP_Modifier_EnableFireModeSwitch_C : public UTigerRangedWeaponModModifier
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0028   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_EnableFireModeSwitch.TBP_Modifier_EnableFireModeSwitch_C.OnModEquipped
	void OnModEquipped(UTigerEquippedModModifierValues* Modifiers);                                                          // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_EnableFireModeSwitch.TBP_Modifier_EnableFireModeSwitch_C.OnModUnequipped
	void OnModUnequipped(UTigerEquippedModModifierValues* Modifiers);                                                        // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_EnableFireModeSwitch.TBP_Modifier_EnableFireModeSwitch_C.ExecuteUbergraph_TBP_Modifier_EnableFireModeSwitch
	void ExecuteUbergraph_TBP_Modifier_EnableFireModeSwitch(int32_t EntryPoint);                                             // [0x197e4f0] Final                
};

/// Class /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_SpreadDecreaseMultiplier.TBP_Modifier_SpreadDecreaseMultiplier_1_C
/// Size: 0x000C (0x000028 - 0x000034)
class UTBP_Modifier_SpreadDecreaseMultiplier_1_C : public UTigerRangedWeaponModModifier
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0028   (0x0008)  
	float                                              SpreadDecreaseMultiplier;                                   // 0x0030   (0x0004)  


	/// Functions
	// Function /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_SpreadDecreaseMultiplier.TBP_Modifier_SpreadDecreaseMultiplier_1_C.OnModEquipped
	void OnModEquipped(UTigerEquippedModModifierValues* Modifiers);                                                          // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_SpreadDecreaseMultiplier.TBP_Modifier_SpreadDecreaseMultiplier_1_C.OnModUnequipped
	void OnModUnequipped(UTigerEquippedModModifierValues* Modifiers);                                                        // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_SpreadDecreaseMultiplier.TBP_Modifier_SpreadDecreaseMultiplier_1_C.ExecuteUbergraph_TBP_Modifier_SpreadDecreaseMultiplier
	void ExecuteUbergraph_TBP_Modifier_SpreadDecreaseMultiplier(int32_t EntryPoint);                                         // [0x197e4f0] Final                
};

/// Class /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_SpreadDecreaseMultiplier.TBP_Modifier_SpreadDecreaseMultiplier_2_C
/// Size: 0x0000 (0x000034 - 0x000034)
class UTBP_Modifier_SpreadDecreaseMultiplier_2_C : public UTBP_Modifier_SpreadDecreaseMultiplier_1_C
{ 
public:
};

/// Class /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_SwapSpeed.TBP_Modifier_SwapSpeed_1_C
/// Size: 0x000C (0x000028 - 0x000034)
class UTBP_Modifier_SwapSpeed_1_C : public UTigerRangedWeaponModModifier
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0028   (0x0008)  
	float                                              SwapSpeedMultiplier;                                        // 0x0030   (0x0004)  


	/// Functions
	// Function /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_SwapSpeed.TBP_Modifier_SwapSpeed_1_C.OnModEquipped
	void OnModEquipped(UTigerEquippedModModifierValues* Modifiers);                                                          // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_SwapSpeed.TBP_Modifier_SwapSpeed_1_C.OnModUnequipped
	void OnModUnequipped(UTigerEquippedModModifierValues* Modifiers);                                                        // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_SwapSpeed.TBP_Modifier_SwapSpeed_1_C.ExecuteUbergraph_TBP_Modifier_SwapSpeed
	void ExecuteUbergraph_TBP_Modifier_SwapSpeed(int32_t EntryPoint);                                                        // [0x197e4f0] Final                
};

/// Class /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_SwapSpeed.TBP_Modifier_SwapSpeed_2_C
/// Size: 0x0000 (0x000034 - 0x000034)
class UTBP_Modifier_SwapSpeed_2_C : public UTBP_Modifier_SwapSpeed_1_C
{ 
public:
};

/// Class /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_SwapSpeed.TBP_Modifier_SwapSpeed_3_C
/// Size: 0x0000 (0x000034 - 0x000034)
class UTBP_Modifier_SwapSpeed_3_C : public UTBP_Modifier_SwapSpeed_1_C
{ 
public:
};

/// Class /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_SpreadDecreaseMultiplier.TBP_Modifier_SpreadDecreaseMultiplier_3_C
/// Size: 0x0000 (0x000034 - 0x000034)
class UTBP_Modifier_SpreadDecreaseMultiplier_3_C : public UTBP_Modifier_SpreadDecreaseMultiplier_1_C
{ 
public:
};

/// Class /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_ReloadSpeed.TBP_Modifier_ReloadSpeed_1_C
/// Size: 0x000C (0x000028 - 0x000034)
class UTBP_Modifier_ReloadSpeed_1_C : public UTigerRangedWeaponModModifier
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0028   (0x0008)  
	float                                              ReloadSpeedMultiplier;                                      // 0x0030   (0x0004)  


	/// Functions
	// Function /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_ReloadSpeed.TBP_Modifier_ReloadSpeed_1_C.OnModEquipped
	void OnModEquipped(UTigerEquippedModModifierValues* Modifiers);                                                          // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_ReloadSpeed.TBP_Modifier_ReloadSpeed_1_C.OnModUnequipped
	void OnModUnequipped(UTigerEquippedModModifierValues* Modifiers);                                                        // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_ReloadSpeed.TBP_Modifier_ReloadSpeed_1_C.ExecuteUbergraph_TBP_Modifier_ReloadSpeed
	void ExecuteUbergraph_TBP_Modifier_ReloadSpeed(int32_t EntryPoint);                                                      // [0x197e4f0] Final                
};

/// Class /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_ReloadSpeed.TBP_Modifier_ReloadSpeed_3_C
/// Size: 0x0000 (0x000034 - 0x000034)
class UTBP_Modifier_ReloadSpeed_3_C : public UTBP_Modifier_ReloadSpeed_1_C
{ 
public:
};

/// Class /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_ReloadSpeed.TBP_Modifier_ReloadSpeed_2_C
/// Size: 0x0000 (0x000034 - 0x000034)
class UTBP_Modifier_ReloadSpeed_2_C : public UTBP_Modifier_ReloadSpeed_1_C
{ 
public:
};

/// Class /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_ExtendedMagazine.TBP_Modifier_ExtendedMagazine_1_C
/// Size: 0x000C (0x000028 - 0x000034)
class UTBP_Modifier_ExtendedMagazine_1_C : public UTigerRangedWeaponModModifier
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0028   (0x0008)  
	int32_t                                            ModLevel;                                                   // 0x0030   (0x0004)  


	/// Functions
	// Function /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_ExtendedMagazine.TBP_Modifier_ExtendedMagazine_1_C.OnModEquipped
	void OnModEquipped(UTigerEquippedModModifierValues* Modifiers);                                                          // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_ExtendedMagazine.TBP_Modifier_ExtendedMagazine_1_C.OnModUnequipped
	void OnModUnequipped(UTigerEquippedModModifierValues* Modifiers);                                                        // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_ExtendedMagazine.TBP_Modifier_ExtendedMagazine_1_C.ExecuteUbergraph_TBP_Modifier_ExtendedMagazine
	void ExecuteUbergraph_TBP_Modifier_ExtendedMagazine(int32_t EntryPoint);                                                 // [0x197e4f0] Final                
};

/// Class /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_ExtendedMagazine.TBP_Modifier_ExtendedMagazine_3_C
/// Size: 0x0000 (0x000034 - 0x000034)
class UTBP_Modifier_ExtendedMagazine_3_C : public UTBP_Modifier_ExtendedMagazine_1_C
{ 
public:
};

/// Class /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_ExtendedMagazine.TBP_Modifier_ExtendedMagazine_2_C
/// Size: 0x0000 (0x000034 - 0x000034)
class UTBP_Modifier_ExtendedMagazine_2_C : public UTBP_Modifier_ExtendedMagazine_1_C
{ 
public:
};

/// Class /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_ChangeFOV.TBP_Modifier_ChangeFOV_1_C
/// Size: 0x000C (0x000028 - 0x000034)
class UTBP_Modifier_ChangeFOV_1_C : public UTigerRangedWeaponModModifier
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0028   (0x0008)  
	float                                              ModdedFOV;                                                  // 0x0030   (0x0004)  


	/// Functions
	// Function /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_ChangeFOV.TBP_Modifier_ChangeFOV_1_C.OnModEquipped
	void OnModEquipped(UTigerEquippedModModifierValues* Modifiers);                                                          // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_ChangeFOV.TBP_Modifier_ChangeFOV_1_C.OnModUnequipped
	void OnModUnequipped(UTigerEquippedModModifierValues* Modifiers);                                                        // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_ChangeFOV.TBP_Modifier_ChangeFOV_1_C.ExecuteUbergraph_TBP_Modifier_ChangeFOV
	void ExecuteUbergraph_TBP_Modifier_ChangeFOV(int32_t EntryPoint);                                                        // [0x197e4f0] Final                
};

/// Class /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_ChangeFOV.TBP_Modifier_ChangeFOV_2_C
/// Size: 0x0000 (0x000034 - 0x000034)
class UTBP_Modifier_ChangeFOV_2_C : public UTBP_Modifier_ChangeFOV_1_C
{ 
public:
};

/// Class /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_ChangeFOV.TBP_Modifier_ChangeFOV_3_C
/// Size: 0x0000 (0x000034 - 0x000034)
class UTBP_Modifier_ChangeFOV_3_C : public UTBP_Modifier_ChangeFOV_1_C
{ 
public:
};

/// Class /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_ChangeFOV.TBP_Modifier_ChangeFOV_5_C
/// Size: 0x0000 (0x000034 - 0x000034)
class UTBP_Modifier_ChangeFOV_5_C : public UTBP_Modifier_ChangeFOV_1_C
{ 
public:
};

/// Class /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_SetScoped.TBP_Modifier_SetScoped_C
/// Size: 0x0019 (0x000028 - 0x000041)
class UTBP_Modifier_SetScoped_C : public UTigerRangedWeaponModModifier
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0028   (0x0008)  
	bool                                               bIsScoped;                                                  // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0031   (0x0007)  MISSED
	UClass*                                            CrossHairWidget;                                            // 0x0038   (0x0008)  
	bool                                               bAppliedWidget;                                             // 0x0040   (0x0001)  


	/// Functions
	// Function /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_SetScoped.TBP_Modifier_SetScoped_C.OnModEquipped
	void OnModEquipped(UTigerEquippedModModifierValues* Modifiers);                                                          // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_SetScoped.TBP_Modifier_SetScoped_C.OnModUnequipped
	void OnModUnequipped(UTigerEquippedModModifierValues* Modifiers);                                                        // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_SetScoped.TBP_Modifier_SetScoped_C.ExecuteUbergraph_TBP_Modifier_SetScoped
	void ExecuteUbergraph_TBP_Modifier_SetScoped(int32_t EntryPoint);                                                        // [0x197e4f0] Final                
};

/// Class /Game/GameBlueprints/Items/Mods/Modifiers/TBP_Modifier_ChangeFOV.TBP_Modifier_ChangeFOV_4_C
/// Size: 0x0000 (0x000034 - 0x000034)
class UTBP_Modifier_ChangeFOV_4_C : public UTBP_Modifier_ChangeFOV_1_C
{ 
public:
};

/// Class /Game/GameBlueprints/Weapons/RangedWeapons/AoE_Blueprints/GrenadeLauncher_Explosion.GrenadeLauncher_Explosion_C
/// Size: 0x0008 (0x0004F8 - 0x000500)
class AGrenadeLauncher_Explosion_C : public ATigerAreaEffect
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x04F8   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/AoE_Blueprints/GrenadeLauncher_Explosion.GrenadeLauncher_Explosion_C.OnTriggerClient
	void OnTriggerClient();                                                                                                  // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/AoE_Blueprints/GrenadeLauncher_Explosion.GrenadeLauncher_Explosion_C.ExecuteUbergraph_GrenadeLauncher_Explosion
	void ExecuteUbergraph_GrenadeLauncher_Explosion(int32_t EntryPoint);                                                     // [0x197e4f0] Final                
};

/// Class /Game/GameBlueprints/Weapons/RangedWeapons/AoE_Blueprints/Explosion_Test.Explosion_Test_C
/// Size: 0x0010 (0x0004F8 - 0x000508)
class AExplosion_Test_C : public ATigerAreaEffect
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x04F8   (0x0008)  
	USceneComponent*                                   DefaultSceneRoot;                                           // 0x0500   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/AoE_Blueprints/Explosion_Test.Explosion_Test_C.OnTriggerClient
	void OnTriggerClient();                                                                                                  // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/AoE_Blueprints/Explosion_Test.Explosion_Test_C.ExecuteUbergraph_Explosion_Test
	void ExecuteUbergraph_Explosion_Test(int32_t EntryPoint);                                                                // [0x197e4f0] Final                
};

/// Class /Game/GameBlueprints/Weapons/RangedWeapons/AoE_Blueprints/Crossbow_Gas_Cloud.Crossbow_Gas_Cloud_4_C
/// Size: 0x0008 (0x0004F8 - 0x000500)
class ACrossbow_Gas_Cloud_4_C : public ATigerAreaEffect
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x04F8   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/AoE_Blueprints/Crossbow_Gas_Cloud.Crossbow_Gas_Cloud_4_C.OnTriggerClient
	void OnTriggerClient();                                                                                                  // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/AoE_Blueprints/Crossbow_Gas_Cloud.Crossbow_Gas_Cloud_4_C.OnVehicleHit
	void OnVehicleHit(AActor* InActor);                                                                                      // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/AoE_Blueprints/Crossbow_Gas_Cloud.Crossbow_Gas_Cloud_4_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/AoE_Blueprints/Crossbow_Gas_Cloud.Crossbow_Gas_Cloud_4_C.ExecuteUbergraph_Crossbow_Gas_Cloud
	void ExecuteUbergraph_Crossbow_Gas_Cloud(int32_t EntryPoint);                                                            // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/GameBlueprints/Weapons/RangedWeapons/AoE_Blueprints/Crossbow_Gas_Cloud.Crossbow_Gas_Cloud_3_C
/// Size: 0x0008 (0x0004F8 - 0x000500)
class ACrossbow_Gas_Cloud_3_C : public ATigerAreaEffect
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x04F8   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/AoE_Blueprints/Crossbow_Gas_Cloud.Crossbow_Gas_Cloud_3_C.OnTriggerClient
	void OnTriggerClient();                                                                                                  // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/AoE_Blueprints/Crossbow_Gas_Cloud.Crossbow_Gas_Cloud_3_C.OnVehicleHit
	void OnVehicleHit(AActor* InActor);                                                                                      // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/AoE_Blueprints/Crossbow_Gas_Cloud.Crossbow_Gas_Cloud_3_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/AoE_Blueprints/Crossbow_Gas_Cloud.Crossbow_Gas_Cloud_3_C.ExecuteUbergraph_Crossbow_Gas_Cloud
	void ExecuteUbergraph_Crossbow_Gas_Cloud(int32_t EntryPoint);                                                            // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/GameBlueprints/Weapons/RangedWeapons/AoE_Blueprints/Crossbow_Gas_Cloud.Crossbow_Gas_Cloud_C
/// Size: 0x0008 (0x0004F8 - 0x000500)
class ACrossbow_Gas_Cloud_C : public ATigerAreaEffect
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x04F8   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/AoE_Blueprints/Crossbow_Gas_Cloud.Crossbow_Gas_Cloud_C.OnTriggerClient
	void OnTriggerClient();                                                                                                  // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/AoE_Blueprints/Crossbow_Gas_Cloud.Crossbow_Gas_Cloud_C.OnVehicleHit
	void OnVehicleHit(AActor* InActor);                                                                                      // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/AoE_Blueprints/Crossbow_Gas_Cloud.Crossbow_Gas_Cloud_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/AoE_Blueprints/Crossbow_Gas_Cloud.Crossbow_Gas_Cloud_C.ExecuteUbergraph_Crossbow_Gas_Cloud
	void ExecuteUbergraph_Crossbow_Gas_Cloud(int32_t EntryPoint);                                                            // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/GameBlueprints/Weapons/RangedWeapons/AoE_Blueprints/Crossbow_Explosion.Crossbow_Explosion_4_C
/// Size: 0x0008 (0x0004F8 - 0x000500)
class ACrossbow_Explosion_4_C : public ATigerAreaEffect
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x04F8   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/AoE_Blueprints/Crossbow_Explosion.Crossbow_Explosion_4_C.OnTriggerClient
	void OnTriggerClient();                                                                                                  // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/AoE_Blueprints/Crossbow_Explosion.Crossbow_Explosion_4_C.ExecuteUbergraph_Crossbow_Explosion
	void ExecuteUbergraph_Crossbow_Explosion(int32_t EntryPoint);                                                            // [0x197e4f0] Final                
};

/// Class /Game/GameBlueprints/Weapons/RangedWeapons/AoE_Blueprints/Crossbow_Explosion.Crossbow_Explosion_2_C
/// Size: 0x0008 (0x0004F8 - 0x000500)
class ACrossbow_Explosion_2_C : public ATigerAreaEffect
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x04F8   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/AoE_Blueprints/Crossbow_Explosion.Crossbow_Explosion_2_C.OnTriggerClient
	void OnTriggerClient();                                                                                                  // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/AoE_Blueprints/Crossbow_Explosion.Crossbow_Explosion_2_C.ExecuteUbergraph_Crossbow_Explosion
	void ExecuteUbergraph_Crossbow_Explosion(int32_t EntryPoint);                                                            // [0x197e4f0] Final                
};

/// Class /Game/GameBlueprints/Buffs/Items/TBP_InAirMomentumLossBuff.TBP_InAirMomentumLossBuff_C
/// Size: 0x0000 (0x000270 - 0x000270)
class UTBP_InAirMomentumLossBuff_C : public UTigerBuffInAirMomentumLoss
{ 
public:
};

/// Class /Game/GameBlueprints/Traits/PassiveLogicComponents/CharacterEffects/TBP_HealEffect.TBP_HealEffect_C
/// Size: 0x0000 (0x000028 - 0x000028)
class UTBP_HealEffect_C : public UTigerCharacterEffect
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/Items/TBP_Buff_Syringe.TBP_Buff_Syringe_C
/// Size: 0x0008 (0x000278 - 0x000280)
class UTBP_Buff_Syringe_C : public UTigerHealingBuff
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0278   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/Buffs/Items/TBP_Buff_Syringe.TBP_Buff_Syringe_C.SetShaderParameter
	void SetShaderParameter(ATigerCharacter* InOwner);                                                                       // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Buffs/Items/TBP_Buff_Syringe.TBP_Buff_Syringe_C.OnActivated
	void OnActivated(ATigerCharacter* InBuffOwner, ATigerCharacter* InBuffCaster);                                           // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Buffs/Items/TBP_Buff_Syringe.TBP_Buff_Syringe_C.OnDeactivated
	void OnDeactivated(ATigerCharacter* InBuffOwner, ATigerCharacter* InBuffCaster);                                         // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Buffs/Items/TBP_Buff_Syringe.TBP_Buff_Syringe_C.OnRefreshed
	void OnRefreshed(ATigerCharacter* InBuffOwner, ATigerCharacter* InBuffCaster);                                           // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Buffs/Items/TBP_Buff_Syringe.TBP_Buff_Syringe_C.ExecuteUbergraph_TBP_Buff_Syringe
	void ExecuteUbergraph_TBP_Buff_Syringe(int32_t EntryPoint);                                                              // [0x197e4f0] Final                
};

/// Class /Game/GameBlueprints/Buffs/Items/TBP_Buff_Shield50.TBP_Buff_Shield50_C
/// Size: 0x0008 (0x000280 - 0x000288)
class UTBP_Buff_Shield50_C : public UTigerBuffShieldAdrenalineRush
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/Buffs/Items/TBP_Buff_Shield50.TBP_Buff_Shield50_C.OnActivated
	void OnActivated(ATigerCharacter* InBuffOwner, ATigerCharacter* InBuffCaster);                                           // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Buffs/Items/TBP_Buff_Shield50.TBP_Buff_Shield50_C.OnDeactivated
	void OnDeactivated(ATigerCharacter* InBuffOwner, ATigerCharacter* InBuffCaster);                                         // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Buffs/Items/TBP_Buff_Shield50.TBP_Buff_Shield50_C.OnRefreshed
	void OnRefreshed(ATigerCharacter* InBuffOwner, ATigerCharacter* InBuffCaster);                                           // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Buffs/Items/TBP_Buff_Shield50.TBP_Buff_Shield50_C.ExecuteUbergraph_TBP_Buff_Shield50
	void ExecuteUbergraph_TBP_Buff_Shield50(int32_t EntryPoint);                                                             // [0x197e4f0] Final                
};

/// Class /Game/GameBlueprints/Buffs/Items/TBP_Buff_SpeedUp.TBP_Buff_SpeedUp_C
/// Size: 0x0014 (0x000268 - 0x00027C)
class UTBP_Buff_SpeedUp_C : public UTigerBuff
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0268   (0x0008)  
	FVector                                            SpeedColor;                                                 // 0x0270   (0x000C)  


	/// Functions
	// Function /Game/GameBlueprints/Buffs/Items/TBP_Buff_SpeedUp.TBP_Buff_SpeedUp_C.OnActivated
	void OnActivated(ATigerCharacter* InBuffOwner, ATigerCharacter* InBuffCaster);                                           // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Buffs/Items/TBP_Buff_SpeedUp.TBP_Buff_SpeedUp_C.OnDeactivated
	void OnDeactivated(ATigerCharacter* InBuffOwner, ATigerCharacter* InBuffCaster);                                         // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Buffs/Items/TBP_Buff_SpeedUp.TBP_Buff_SpeedUp_C.ExecuteUbergraph_TBP_Buff_SpeedUp
	void ExecuteUbergraph_TBP_Buff_SpeedUp(int32_t EntryPoint);                                                              // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/GameBlueprints/Buffs/Items/TBP_Buff_HolyincenseShield.TBP_Buff_HolyincenseShield_C
/// Size: 0x0008 (0x000268 - 0x000270)
class UTBP_Buff_HolyincenseShield_C : public UTigerBuffUnholyStimulant
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0268   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/Buffs/Items/TBP_Buff_HolyincenseShield.TBP_Buff_HolyincenseShield_C.SetShaderParameters
	void SetShaderParameters(ATigerCharacter* InOwner);                                                                      // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Buffs/Items/TBP_Buff_HolyincenseShield.TBP_Buff_HolyincenseShield_C.OnDeactivated
	void OnDeactivated(ATigerCharacter* InBuffOwner, ATigerCharacter* InBuffCaster);                                         // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Buffs/Items/TBP_Buff_HolyincenseShield.TBP_Buff_HolyincenseShield_C.OnActivated
	void OnActivated(ATigerCharacter* InBuffOwner, ATigerCharacter* InBuffCaster);                                           // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Buffs/Items/TBP_Buff_HolyincenseShield.TBP_Buff_HolyincenseShield_C.OnRefreshed
	void OnRefreshed(ATigerCharacter* InBuffOwner, ATigerCharacter* InBuffCaster);                                           // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Buffs/Items/TBP_Buff_HolyincenseShield.TBP_Buff_HolyincenseShield_C.ExecuteUbergraph_TBP_Buff_HolyincenseShield
	void ExecuteUbergraph_TBP_Buff_HolyincenseShield(int32_t EntryPoint);                                                    // [0x197e4f0] Final                
};

/// Class /Game/GameBlueprints/AimAssist/TBP_AimAssist_Default.TBP_AimAssist_Default_C
/// Size: 0x0000 (0x000240 - 0x000240)
class UTBP_AimAssist_Default_C : public UTigerAimAssistSettings
{ 
public:
};

/// Class /Game/GameBlueprints/AimAssist/TBP_AimAssist_Melee.TBP_AimAssist_Melee_C
/// Size: 0x0000 (0x000240 - 0x000240)
class UTBP_AimAssist_Melee_C : public UTBP_AimAssist_Default_C
{ 
public:
};

/// Class /Game/GameBlueprints/AimAssist/TBP_AimAssist_Ranged.TBP_AimAssist_Ranged_C
/// Size: 0x0000 (0x000240 - 0x000240)
class UTBP_AimAssist_Ranged_C : public UTBP_AimAssist_Default_C
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/PresetBlueprints/Main/Actions/TBP_CamConf_Aiming.TBP_CamConf_Aiming_C
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UTBP_CamConf_Aiming_C : public UTigerCameraPreset
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/CameraShakes/TBP_CamShake_Light.TBP_CamShake_Light_C
/// Size: 0x0000 (0x000180 - 0x000180)
class UTBP_CamShake_Light_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/GameBlueprints/AimAssist/Ranged/TBP_AimAssist_Dual_Pistols.TBP_AimAssist_Dual_Pistols_C
/// Size: 0x0000 (0x000240 - 0x000240)
class UTBP_AimAssist_Dual_Pistols_C : public UTBP_AimAssist_Default_C
{ 
public:
};

/// Class /Game/GameBlueprints/World/TBP_HolyIncense.TBP_HolyIncense_C
/// Size: 0x0090 (0x0002B0 - 0x000340)
class ATBP_HolyIncense_C : public ATigerHolyIncense
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02B0   (0x0008)  
	USceneCaptureComponent2D*                          HeightmapCaptureComponent;                                  // 0x02B8   (0x0008)  
	UStaticMeshComponent*                              VolumetricHolySmoke;                                        // 0x02C0   (0x0008)  
	float                                              TotalProgression;                                           // 0x02C8   (0x0004)  
	bool                                               ShouldIncreaseTotalProgression;                             // 0x02CC   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x02CD   (0x0003)  MISSED
	float                                              Padding;                                                    // 0x02D0   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x02D4   (0x0004)  MISSED
	UTexture2D*                                        HeightTexture;                                              // 0x02D8   (0x0008)  
	float                                              HeightFade;                                                 // 0x02E0   (0x0004)  
	float                                              HeightFadeFar;                                              // 0x02E4   (0x0004)  
	float                                              MinHeightOffset;                                            // 0x02E8   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x02EC   (0x0004)  MISSED
	TWeakObjectPtr<UMaterialInterface*>                LowSpecWallMaterial;                                        // 0x02F0   (0x0028)  
	TWeakObjectPtr<UMaterialInterface*>                WallMaterial;                                               // 0x0318   (0x0028)  


	/// Functions
	// Function /Game/GameBlueprints/World/TBP_HolyIncense.TBP_HolyIncense_C.QualityOptionChanged
	void QualityOptionChanged(FTigerGraphicsSettings& GraphicsSettings, FTigerGraphicsSettingsPS5& GraphicsSettingsPS5);     // [0x197e4f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/World/TBP_HolyIncense.TBP_HolyIncense_C.SetupQualityOptions
	void SetupQualityOptions();                                                                                              // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/World/TBP_HolyIncense.TBP_HolyIncense_C.OnMaterialLoaded
	void OnMaterialLoaded(TArray<UObject*>& InLoadedObjects);                                                                // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/World/TBP_HolyIncense.TBP_HolyIncense_C.MakeVolumeFitSpline
	void MakeVolumeFitSpline();                                                                                              // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/World/TBP_HolyIncense.TBP_HolyIncense_C.SetMinMaxHeightMPC
	void SetMinMaxHeightMPC();                                                                                               // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/World/TBP_HolyIncense.TBP_HolyIncense_C.UpdateMPC
	void UpdateMPC();                                                                                                        // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/World/TBP_HolyIncense.TBP_HolyIncense_C.Initialize
	void Initialize();                                                                                                       // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/World/TBP_HolyIncense.TBP_HolyIncense_C.UserConstructionScript
	void UserConstructionScript();                                                                                           // [0x197e4f0] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/World/TBP_HolyIncense.TBP_HolyIncense_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/World/TBP_HolyIncense.TBP_HolyIncense_C.OnMatchStateChanged
	void OnMatchStateChanged(ETigerMatchState OldState, ETigerMatchState NewState);                                          // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/World/TBP_HolyIncense.TBP_HolyIncense_C.ReceiveTick
	void ReceiveTick(float DeltaSeconds);                                                                                    // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/World/TBP_HolyIncense.TBP_HolyIncense_C.OnWaveStartMovement_Event
	void OnWaveStartMovement_Event();                                                                                        // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/World/TBP_HolyIncense.TBP_HolyIncense_C.RenderHeightmap
	void RenderHeightmap();                                                                                                  // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/World/TBP_HolyIncense.TBP_HolyIncense_C.OnPreMatchStateChanged
	void OnPreMatchStateChanged(FTigerPreMatchStateInfo PreMatchState);                                                      // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/World/TBP_HolyIncense.TBP_HolyIncense_C.ForceBlueprintInitialise
	void ForceBlueprintInitialise();                                                                                         // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/World/TBP_HolyIncense.TBP_HolyIncense_C.ExecuteUbergraph_TBP_HolyIncense
	void ExecuteUbergraph_TBP_HolyIncense(int32_t EntryPoint);                                                               // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile.TBP_BulletProjectile_C
/// Size: 0x0168 (0x0002D0 - 0x000438)
class ATBP_BulletProjectile_C : public ATigerProjectile
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02D0   (0x0008)  
	UMaterialInstanceDynamic*                          Decal_Concrete;                                             // 0x02D8   (0x0008)  
	FVector                                            StartPosition;                                              // 0x02E0   (0x000C)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x02EC   (0x0004)  MISSED
	FSoftObjectPath                                    NiagaraTrailPath;                                           // 0x02F0   (0x0018)  
	FSoftObjectPath                                    RemoteNiagaraTrailPath;                                     // 0x0308   (0x0018)  
	UNiagaraSystem*                                    CachedTrailEffect;                                          // 0x0320   (0x0008)  
	FVector                                            StartVelocity;                                              // 0x0328   (0x000C)  
	FVector                                            LastTraceLocation;                                          // 0x0334   (0x000C)  
	int32_t                                            TotalTraces;                                                // 0x0340   (0x0004)  
	FVector                                            TraceEndLocation;                                           // 0x0344   (0x000C)  
	FLinearColor                                       TraceColor;                                                 // 0x0350   (0x0010)  
	float                                              SmokeWidth;                                                 // 0x0360   (0x0004)  
	float                                              SmokeLifetime;                                              // 0x0364   (0x0004)  
	float                                              SmokeVisibility;                                            // 0x0368   (0x0004)  
	float                                              DotSize;                                                    // 0x036C   (0x0004)  
	float                                              SmokeCurlAmount;                                            // 0x0370   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0374   (0x0004)  MISSED
	TMap<TEnumAsByte, FName>                           SurfaceToAudioName;                                         // 0x0378   (0x0050)  
	float                                              TraceLifetime;                                              // 0x03C8   (0x0004)  
	float                                              TraceWidth;                                                 // 0x03CC   (0x0004)  
	int32_t                                            FlyByAkEventID;                                             // 0x03D0   (0x0004)  
	bool                                               HasSmokeTrail;                                              // 0x03D4   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x03D5   (0x0003)  MISSED
	FName                                              RangedWeaponToAudioSwitch;                                  // 0x03D8   (0x0008)  
	TMap<TEnumAsByte, FName>                           WeaponTypeToAudioName;                                      // 0x03E0   (0x0050)  
	UClass*                                            BloodDecalBlueprint;                                        // 0x0430   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile.TBP_BulletProjectile_C.SelectCharacterSurfaceType
	void SelectCharacterSurfaceType(TEnumAsByte<EPhysicalSurface> InSurfaceType, ATigerCharacter* Character, TEnumAsByte<EPhysicalSurface>& OutSurfaceType); // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile.TBP_BulletProjectile_C.GetParticleSystem
	UNiagaraSystem* GetParticleSystem(TEnumAsByte<ENetRole> Index);                                                          // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile.TBP_BulletProjectile_C.PlayHitAudio
	void PlayHitAudio(TEnumAsByte<EPhysicalSurface> SurfaceType, UPrimitiveComponent* HitComponent);                         // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile.TBP_BulletProjectile_C.CreateWorldImpactParticles
	void CreateWorldImpactParticles(AActor*& Actor, UParticleSystem*& ParticleSystem, FVector& ImpactPoint, FRotator& Rotation, UPrimitiveComponent*& Component); // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile.TBP_BulletProjectile_C.CreateBloodParticles
	void CreateBloodParticles(ATigerCharacter*& Character, TEnumAsByte<EPhysicalSurface> SurfaceType, FVector& ImpactPoint, FRotator& Rotation, UPrimitiveComponent*& Component, UParticleSystem* PS_BodyShot, UParticleSystem* PS_HeadShot, UParticleSystem* PS_ShieldShot, UParticleSystem* PS_VentrueShield, bool& Spawn Decal); // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile.TBP_BulletProjectile_C.CreateBloodDecals
	void CreateBloodDecals(FVector HitLocation);                                                                             // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile.TBP_BulletProjectile_C.GetTraceHit
	void GetTraceHit(FHitResult InHit, bool& UsingTrace, AActor*& Actor, UPrimitiveComponent*& Component, UPhysicalMaterial*& PhysMat, FVector& Impact Point, FVector& Normal, bool& BlockingHit); // [0x197e4f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile.TBP_BulletProjectile_C.ReportPlayerAction
	void ReportPlayerAction(FHitResult Hit);                                                                                 // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile.TBP_BulletProjectile_C.SelectParticleSystem
	void SelectParticleSystem(TEnumAsByte<EPhysicalSurface> Surface Type, UParticleSystem*& NewParam);                       // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile.TBP_BulletProjectile_C.ValidatedTriggerEffects
	void ValidatedTriggerEffects(UPhysicalMaterial*& PhysMaterial, FVector& ImpactPoint, FVector& Normal, UPrimitiveComponent*& PotentialSceneComponent); // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile.TBP_BulletProjectile_C.InstantaneousSpawnParticles
	void InstantaneousSpawnParticles(TEnumAsByte<EPhysicalSurface> Surface Type, FVector Impact Point, FRotator Rotation, UPrimitiveComponent* Potential Scene Component, bool BlockingHit); // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile.TBP_BulletProjectile_C.InstantaneousTriggerEffects
	void InstantaneousTriggerEffects(UPhysicalMaterial*& PhysMaterial, UPrimitiveComponent*& Hit Component, FVector& ImpactPoint, FVector& Normal, bool& BlockingHit); // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile.TBP_BulletProjectile_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile.TBP_BulletProjectile_C.TriggerHitEffects
	void TriggerHitEffects(FHitResult& Hit);                                                                                 // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile.TBP_BulletProjectile_C.ReceiveTick
	void ReceiveTick(float DeltaSeconds);                                                                                    // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile.TBP_BulletProjectile_C.OnReactivate
	void OnReactivate();                                                                                                     // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile.TBP_BulletProjectile_C.TriggerInstantaneousHitEffects
	void TriggerInstantaneousHitEffects(FHitResult& Hit);                                                                    // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile.TBP_BulletProjectile_C.TriggerValidatedHitEffects
	void TriggerValidatedHitEffects(FHitResult& Hit);                                                                        // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile.TBP_BulletProjectile_C.DoTransparentTrace
	void DoTransparentTrace();                                                                                               // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile.TBP_BulletProjectile_C.CreateProjectileParticleSystem
	void CreateProjectileParticleSystem(TEnumAsByte<ENetRole> InLocalNetRole);                                               // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile.TBP_BulletProjectile_C.Reactivate
	void Reactivate();                                                                                                       // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile.TBP_BulletProjectile_C.Spawn particle
	void Spawn particle();                                                                                                   // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile.TBP_BulletProjectile_C.SetupParticle
	void SetupParticle(UNiagaraSystem* System);                                                                              // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile.TBP_BulletProjectile_C.ExecuteUbergraph_TBP_BulletProjectile
	void ExecuteUbergraph_TBP_BulletProjectile(int32_t EntryPoint);                                                          // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile_Large.TBP_BulletProjectile_Large_C
/// Size: 0x0000 (0x000438 - 0x000438)
class ATBP_BulletProjectile_Large_C : public ATBP_BulletProjectile_C
{ 
public:
};

/// Class /Game/GameBlueprints/Weapons/RangedWeapons/TBP_StakeProjectile.TBP_StakeProjectile_C
/// Size: 0x0008 (0x000438 - 0x000440)
class ATBP_StakeProjectile_C : public ATBP_BulletProjectile_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0438   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/TBP_StakeProjectile.TBP_StakeProjectile_C.SpawnVFX
	void SpawnVFX(FVector Location, FRotator Rotation);                                                                      // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/TBP_StakeProjectile.TBP_StakeProjectile_C.InstantaneousSpawnParticles
	void InstantaneousSpawnParticles(TEnumAsByte<EPhysicalSurface> Surface Type, FVector Impact Point, FRotator Rotation, UPrimitiveComponent* Potential Scene Component, bool BlockingHit); // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/TBP_StakeProjectile.TBP_StakeProjectile_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/TBP_StakeProjectile.TBP_StakeProjectile_C.ExecuteUbergraph_TBP_StakeProjectile
	void ExecuteUbergraph_TBP_StakeProjectile(int32_t EntryPoint);                                                           // [0x197e4f0] Final                
};

/// Class /Game/GameBlueprints/Weapons/RangedWeapons/TBP_PoisonProjectile.TBP_PoisonProjectile_C
/// Size: 0x0008 (0x000438 - 0x000440)
class ATBP_PoisonProjectile_C : public ATBP_BulletProjectile_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0438   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/TBP_PoisonProjectile.TBP_PoisonProjectile_C.SpawnVFX
	void SpawnVFX(FVector Location, FRotator Rotation);                                                                      // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/TBP_PoisonProjectile.TBP_PoisonProjectile_C.InstantaneousSpawnParticles
	void InstantaneousSpawnParticles(TEnumAsByte<EPhysicalSurface> Surface Type, FVector Impact Point, FRotator Rotation, UPrimitiveComponent* Potential Scene Component, bool BlockingHit); // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/TBP_PoisonProjectile.TBP_PoisonProjectile_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/TBP_PoisonProjectile.TBP_PoisonProjectile_C.ExecuteUbergraph_TBP_PoisonProjectile
	void ExecuteUbergraph_TBP_PoisonProjectile(int32_t EntryPoint);                                                          // [0x197e4f0] Final                
};

/// Class /Game/GameBlueprints/Weapons/RangedWeapons/TBP_NailProjectile.TBP_NailProjectile_C
/// Size: 0x0000 (0x000438 - 0x000438)
class ATBP_NailProjectile_C : public ATBP_BulletProjectile_C
{ 
public:
};

/// Class /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile_Small.TBP_BulletProjectile_Small_C
/// Size: 0x0000 (0x000438 - 0x000438)
class ATBP_BulletProjectile_Small_C : public ATBP_BulletProjectile_C
{ 
public:
};

/// Class /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile_Small_Fiery.TBP_BulletProjectile_Small_Fiery_C
/// Size: 0x0000 (0x000438 - 0x000438)
class ATBP_BulletProjectile_Small_Fiery_C : public ATBP_BulletProjectile_Small_C
{ 
public:
};

/// Class /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile_Small_Entity.TBP_BulletProjectile_Small_Entity_C
/// Size: 0x0000 (0x000438 - 0x000438)
class ATBP_BulletProjectile_Small_Entity_C : public ATBP_BulletProjectile_Small_C
{ 
public:
};

/// Class /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile_Medium.TBP_BulletProjectile_Medium_C
/// Size: 0x0000 (0x000438 - 0x000438)
class ATBP_BulletProjectile_Medium_C : public ATBP_BulletProjectile_Large_C
{ 
public:
};

/// Class /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile_Medium_Entity.TBP_BulletProjectile_Medium_Entity_C
/// Size: 0x0000 (0x000438 - 0x000438)
class ATBP_BulletProjectile_Medium_Entity_C : public ATBP_BulletProjectile_Medium_C
{ 
public:
};

/// Class /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile_Large_Fiery.TBP_BulletProjectile_Large_Fiery_C
/// Size: 0x0000 (0x000438 - 0x000438)
class ATBP_BulletProjectile_Large_Fiery_C : public ATBP_BulletProjectile_Large_C
{ 
public:
};

/// Class /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile_Large_Entity.TBP_BulletProjectile_Large_Entity_C
/// Size: 0x0000 (0x000438 - 0x000438)
class ATBP_BulletProjectile_Large_Entity_C : public ATBP_BulletProjectile_Large_C
{ 
public:
};

/// Class /Game/GameBlueprints/Weapons/RangedWeapons/TBP_BulletProjectile_ExplosiveArrow.TBP_BulletProjectile_ExplosiveArrow_C
/// Size: 0x0000 (0x000438 - 0x000438)
class ATBP_BulletProjectile_ExplosiveArrow_C : public ATBP_BulletProjectile_C
{ 
public:
};

/// Class /Game/GameBlueprints/Weapons/RangedWeapons/RangedWeaponBlueprints/TBP_RangedWeapon_Master.TBP_RangedWeapon_Master_C
/// Size: 0x002C (0x000208 - 0x000234)
class UTBP_RangedWeapon_Master_C : public UTigerRangedWeapon
{ 
public:
	UClass*                                            CrouchingAimingCameraPreset;                                // 0x0208   (0x0008)  
	FVector                                            SpreadOfCurrentShot;                                        // 0x0210   (0x000C)  
	float                                              Slowed_Time;                                                // 0x021C   (0x0004)  
	TEnumAsByte<ENUM_RangedWeaponCategories>           AnimRangedWeaponCategory;                                   // 0x0220   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0221   (0x0003)  MISSED
	FLinearColor                                       MuzzleFlashColor;                                           // 0x0224   (0x0010)  


	/// Functions
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/RangedWeaponBlueprints/TBP_RangedWeapon_Master.TBP_RangedWeapon_Master_C.GetRangedWeaponCategory
	void GetRangedWeaponCategory(TEnumAsByte<ENUM_RangedWeaponCategories>& RangedWeaponCategory);                            // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/RangedWeaponBlueprints/TBP_RangedWeapon_Master.TBP_RangedWeapon_Master_C.StandardSpread 24
	FVector StandardSpread 24(UTigerRangedWeaponComponent* RangedWeaponComponent, int32_t BulletIndex, FVector In Dir, FTigerRangedRandomState& RandomState); // [0x197e4f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/RangedWeaponBlueprints/TBP_RangedWeapon_Master.TBP_RangedWeapon_Master_C.StandardSpread 16
	FVector StandardSpread 16(UTigerRangedWeaponComponent* RangedWeaponComponent, int32_t BulletIndex, FVector In Dir, FTigerRangedRandomState& RandomState); // [0x197e4f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/RangedWeaponBlueprints/TBP_RangedWeapon_Master.TBP_RangedWeapon_Master_C.Horizontal Line
	FVector Horizontal Line(UTigerRangedWeaponComponent* RangedWeaponComponent, int32_t BulletIndex, FVector In Dir, FTigerRangedRandomState& RandomState); // [0x197e4f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/RangedWeaponBlueprints/TBP_RangedWeapon_Master.TBP_RangedWeapon_Master_C.Tri
	FVector Tri(UTigerRangedWeaponComponent* RangedWeaponComponent, int32_t BulletIndex, FVector In Dir, FTigerRangedRandomState& RandomState); // [0x197e4f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/RangedWeaponBlueprints/TBP_RangedWeapon_Master.TBP_RangedWeapon_Master_C.Vertical Line
	FVector Vertical Line(UTigerRangedWeaponComponent* RangedWeaponComponent, int32_t BulletIndex, FVector In Dir, FTigerRangedRandomState& RandomState); // [0x197e4f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/RangedWeaponBlueprints/TBP_RangedWeapon_Master.TBP_RangedWeapon_Master_C.StandardSpread 8
	FVector StandardSpread 8(UTigerRangedWeaponComponent* RangedWeaponComponent, int32_t BulletIndex, FVector In Dir, FTigerRangedRandomState& RandomState); // [0x197e4f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/RangedWeaponBlueprints/TBP_RangedWeapon_Master.TBP_RangedWeapon_Master_C.StandardSpread 12
	FVector StandardSpread 12(UTigerRangedWeaponComponent* RangedWeaponComponent, int32_t BulletIndex, FVector In Dir, FTigerRangedRandomState& RandomState); // [0x197e4f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/RangedWeaponBlueprints/TBP_RangedWeapon_Master.TBP_RangedWeapon_Master_C.NeoArmstrongCycloneJetArmstrongCannon
	FVector NeoArmstrongCycloneJetArmstrongCannon(UTigerRangedWeaponComponent* RangedWeaponComponent, int32_t BulletIndex, FVector In Dir, FTigerRangedRandomState& RandomState); // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/RangedWeaponBlueprints/TBP_RangedWeapon_Master.TBP_RangedWeapon_Master_C.ProjectileDirectionList
	FVector ProjectileDirectionList(UTigerRangedWeaponComponent* RangedWeaponComponent, int32_t BulletIndex, FVector In Dir, FTigerRangedRandomState& RandomState); // [0x197e4f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/RangedWeaponBlueprints/TBP_RangedWeapon_Master.TBP_RangedWeapon_Master_C.DefaultShotgunSpread
	FVector DefaultShotgunSpread(UTigerRangedWeaponComponent* RangedWeaponComponent, int32_t BulletIndex, FVector In Dir, FTigerRangedRandomState& RandomState); // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/RangedWeaponBlueprints/TBP_RangedWeapon_Master.TBP_RangedWeapon_Master_C.RowBasedGrid
	FVector RowBasedGrid(UTigerRangedWeaponComponent* RangedWeaponComponent, int32_t BulletIndex, FVector In Dir, bool ShouldBeInsideSpreadRadius, int32_t Rows); // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/RangedWeaponBlueprints/TBP_RangedWeapon_Master.TBP_RangedWeapon_Master_C.SmileyFace :D
	FVector SmileyFace :D(UTigerRangedWeaponComponent* RangedWeaponComponent, int32_t BulletIndex, FVector In Dir);          // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/RangedWeaponBlueprints/TBP_RangedWeapon_Master.TBP_RangedWeapon_Master_C.CircularSpread
	FVector CircularSpread(UTigerRangedWeaponComponent* RangedWeaponComponent, int32_t BulletIndex, FVector In Dir);         // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/RangedWeaponBlueprints/TBP_RangedWeapon_Master.TBP_RangedWeapon_Master_C.TrueShotgunSpread
	FVector TrueShotgunSpread(UTigerRangedWeaponComponent* RangedWeaponComponent, int32_t BulletIndex, FVector In Dir, FTigerRangedRandomState& RandomState); // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/RangedWeaponBlueprints/TBP_RangedWeapon_Master.TBP_RangedWeapon_Master_C.Triangle
	FVector Triangle(UTigerRangedWeaponComponent* RangedWeaponComponent, int32_t BulletIndex, FVector In Dir);               // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/GameBlueprints/Weapons/RangedWeapons/RangedWeaponBlueprints/Pistols/TBP_RangedWeapon_Pistol_Common.TBP_RangedWeapon_Pistol_Common_C
/// Size: 0x0000 (0x000234 - 0x000234)
class UTBP_RangedWeapon_Pistol_Common_C : public UTBP_RangedWeapon_Master_C
{ 
public:
};

/// Class /Game/GameBlueprints/Weapons/RangedWeapons/RangedWeaponBlueprints/BPI_RangedWeapon.BPI_RangedWeapon_C
/// Size: 0x0000 (0x000028 - 0x000028)
class UBPI_RangedWeapon_C : public UInterface
{ 
public:
};

/// Class /Game/GameBlueprints/Weapons/MeleeWeapons/MeleeWeaponBlueprints/TBP_Weapon_Unarmed.TBP_Weapon_Unarmed_C
/// Size: 0x0000 (0x000201 - 0x000201)
class UTBP_Weapon_Unarmed_C : public UTBP_MeleeWeapon_Master_C
{ 
public:
};

/// Class /Game/GameBlueprints/Props/StunVisuals.StunVisuals_C
/// Size: 0x0010 (0x000228 - 0x000238)
class AStunVisuals_C : public AActor
{ 
public:
	UStaticMeshComponent*                              StaticMesh;                                                 // 0x0228   (0x0008)  
	USceneComponent*                                   DefaultSceneRoot;                                           // 0x0230   (0x0008)  
};

/// Class /Game/GameBlueprints/Player/TBP_SprintConfig.TBP_SprintConfig_C
/// Size: 0x0008 (0x000130 - 0x000138)
class UTBP_SprintConfig_C : public UTigerSprintConfig
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0130   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/Player/TBP_SprintConfig.TBP_SprintConfig_C.OnSprintDelayCompleted
	void OnSprintDelayCompleted(ATigerPlayer* InPlayer);                                                                     // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/TBP_SprintConfig.TBP_SprintConfig_C.ExecuteUbergraph_TBP_SprintConfig
	void ExecuteUbergraph_TBP_SprintConfig(int32_t EntryPoint);                                                              // [0x197e4f0] Final                
};

/// Class /Game/GameBlueprints/Player/TBP_PhysInteraction_Revive.TBP_PhysInteraction_Revive_C
/// Size: 0x0000 (0x000048 - 0x000048)
class UTBP_PhysInteraction_Revive_C : public UTigerPhysicalInteractionRevive
{ 
public:
};

/// Class /Game/GameBlueprints/Player/TBP_PhysInteraction_Diablerize.TBP_PhysInteraction_Diablerize_C
/// Size: 0x0000 (0x0000D0 - 0x0000D0)
class UTBP_PhysInteraction_Diablerize_C : public UTigerPhysicalInteractionDiablerize
{ 
public:
};

/// Class /Game/GameBlueprints/Character/BPI_PlayerBuffs.BPI_PlayerBuffs_C
/// Size: 0x0000 (0x000028 - 0x000028)
class UBPI_PlayerBuffs_C : public UInterface
{ 
public:
};

/// Class /Game/GameBlueprints/Character/BPI_PlayerAnimation.BPI_PlayerAnimation_C
/// Size: 0x0000 (0x000028 - 0x000028)
class UBPI_PlayerAnimation_C : public UInterface
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/PresetBlueprints/Main/Actions/TBP_CamConf_Dodge.TBP_CamConf_Dodge_C
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UTBP_CamConf_Dodge_C : public UTigerCameraPreset
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/PresetBlueprints/Disciplines/TBP_CamConf_FistOfTheTitans.TBP_CamConf_FistOfTheTitans_C
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UTBP_CamConf_FistOfTheTitans_C : public UTigerCameraPreset
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/ResonanceBuffs/TBP_Buff_Sanguine.TBP_Buff_Sanguine_7_C
/// Size: 0x0000 (0x000270 - 0x000270)
class UTBP_Buff_Sanguine_7_C : public UTigerBuffHealthRegenBase
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/ResonanceBuffs/TBP_Buff_Sanguine.TBP_Buff_Sanguine_6_C
/// Size: 0x0000 (0x000270 - 0x000270)
class UTBP_Buff_Sanguine_6_C : public UTigerBuffHealthRegenBase
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/ResonanceBuffs/TBP_Buff_Sanguine.TBP_Buff_Sanguine_5_C
/// Size: 0x0000 (0x000270 - 0x000270)
class UTBP_Buff_Sanguine_5_C : public UTigerBuffHealthRegenBase
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/ResonanceBuffs/TBP_Buff_Sanguine.TBP_Buff_Sanguine_4_C
/// Size: 0x0000 (0x000270 - 0x000270)
class UTBP_Buff_Sanguine_4_C : public UTigerBuffHealthRegenBase
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/ResonanceBuffs/TBP_Buff_Sanguine.TBP_Buff_Sanguine_3_C
/// Size: 0x0000 (0x000270 - 0x000270)
class UTBP_Buff_Sanguine_3_C : public UTigerBuffHealthRegenBase
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/ResonanceBuffs/TBP_Buff_Sanguine.TBP_Buff_Sanguine_2_C
/// Size: 0x0000 (0x000270 - 0x000270)
class UTBP_Buff_Sanguine_2_C : public UTigerBuffHealthRegenBase
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/ResonanceBuffs/TBP_Buff_Sanguine.TBP_Buff_Sanguine_1_C
/// Size: 0x0000 (0x000270 - 0x000270)
class UTBP_Buff_Sanguine_1_C : public UTigerBuffHealthRegenBase
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/ResonanceBuffs/TBP_Buff_Phlegmatic.TBP_Buff_Phlegmatic_7_C
/// Size: 0x0000 (0x000270 - 0x000270)
class UTBP_Buff_Phlegmatic_7_C : public UTigerBuffHealthRegenBase
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/ResonanceBuffs/TBP_Buff_Phlegmatic.TBP_Buff_Phlegmatic_6_C
/// Size: 0x0000 (0x000270 - 0x000270)
class UTBP_Buff_Phlegmatic_6_C : public UTigerBuffHealthRegenBase
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/ResonanceBuffs/TBP_Buff_Phlegmatic.TBP_Buff_Phlegmatic_5_C
/// Size: 0x0000 (0x000270 - 0x000270)
class UTBP_Buff_Phlegmatic_5_C : public UTigerBuffHealthRegenBase
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/ResonanceBuffs/TBP_Buff_Phlegmatic.TBP_Buff_Phlegmatic_4_C
/// Size: 0x0000 (0x000270 - 0x000270)
class UTBP_Buff_Phlegmatic_4_C : public UTigerBuffHealthRegenBase
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/ResonanceBuffs/TBP_Buff_Phlegmatic.TBP_Buff_Phlegmatic_3_C
/// Size: 0x0000 (0x000270 - 0x000270)
class UTBP_Buff_Phlegmatic_3_C : public UTigerBuffHealthRegenBase
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/ResonanceBuffs/TBP_Buff_Phlegmatic.TBP_Buff_Phlegmatic_2_C
/// Size: 0x0000 (0x000270 - 0x000270)
class UTBP_Buff_Phlegmatic_2_C : public UTigerBuffHealthRegenBase
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/ResonanceBuffs/TBP_Buff_Phlegmatic.TBP_Buff_Phlegmatic_1_C
/// Size: 0x0000 (0x000270 - 0x000270)
class UTBP_Buff_Phlegmatic_1_C : public UTigerBuffHealthRegenBase
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/ResonanceBuffs/TBP_Buff_Melancholic.TBP_Buff_Melancholic_7_C
/// Size: 0x0000 (0x000268 - 0x000268)
class UTBP_Buff_Melancholic_7_C : public UTigerBuff
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/ResonanceBuffs/TBP_Buff_Melancholic.TBP_Buff_Melancholic_6_C
/// Size: 0x0000 (0x000268 - 0x000268)
class UTBP_Buff_Melancholic_6_C : public UTigerBuff
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/ResonanceBuffs/TBP_Buff_Melancholic.TBP_Buff_Melancholic_5_C
/// Size: 0x0000 (0x000268 - 0x000268)
class UTBP_Buff_Melancholic_5_C : public UTigerBuff
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/ResonanceBuffs/TBP_Buff_Melancholic.TBP_Buff_Melancholic_4_C
/// Size: 0x0000 (0x000268 - 0x000268)
class UTBP_Buff_Melancholic_4_C : public UTigerBuff
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/ResonanceBuffs/TBP_Buff_Melancholic.TBP_Buff_Melancholic_3_C
/// Size: 0x0000 (0x000268 - 0x000268)
class UTBP_Buff_Melancholic_3_C : public UTigerBuff
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/ResonanceBuffs/TBP_Buff_Melancholic.TBP_Buff_Melancholic_2_C
/// Size: 0x0000 (0x000268 - 0x000268)
class UTBP_Buff_Melancholic_2_C : public UTigerBuff
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/ResonanceBuffs/TBP_Buff_Melancholic.TBP_Buff_Melancholic_1_C
/// Size: 0x0000 (0x000268 - 0x000268)
class UTBP_Buff_Melancholic_1_C : public UTigerBuff
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/ResonanceBuffs/TBP_Buff_Choleric.TBP_Buff_Choleric_7_C
/// Size: 0x0000 (0x000268 - 0x000268)
class UTBP_Buff_Choleric_7_C : public UTigerBuff
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/ResonanceBuffs/TBP_Buff_Choleric.TBP_Buff_Choleric_6_C
/// Size: 0x0000 (0x000268 - 0x000268)
class UTBP_Buff_Choleric_6_C : public UTigerBuff
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/ResonanceBuffs/TBP_Buff_Choleric.TBP_Buff_Choleric_5_C
/// Size: 0x0000 (0x000268 - 0x000268)
class UTBP_Buff_Choleric_5_C : public UTigerBuff
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/ResonanceBuffs/TBP_Buff_Choleric.TBP_Buff_Choleric_4_C
/// Size: 0x0000 (0x000268 - 0x000268)
class UTBP_Buff_Choleric_4_C : public UTigerBuff
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/ResonanceBuffs/TBP_Buff_Choleric.TBP_Buff_Choleric_3_C
/// Size: 0x0000 (0x000268 - 0x000268)
class UTBP_Buff_Choleric_3_C : public UTigerBuff
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/ResonanceBuffs/TBP_Buff_Choleric.TBP_Buff_Choleric_2_C
/// Size: 0x0000 (0x000268 - 0x000268)
class UTBP_Buff_Choleric_2_C : public UTigerBuff
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/ResonanceBuffs/TBP_Buff_Choleric.TBP_Buff_Choleric_1_C
/// Size: 0x0000 (0x000268 - 0x000268)
class UTBP_Buff_Choleric_1_C : public UTigerBuff
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/Items/TBP_Buff_UsingConsumableWithMovement.TBP_Buff_UsingConsumableWithMovement_C
/// Size: 0x0000 (0x000268 - 0x000268)
class UTBP_Buff_UsingConsumableWithMovement_C : public UTigerBuff
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/Items/Artifacts/TBP_Buff_SacrificedHand_Unseen.TBP_Buff_SacrificedHand_Unseen_C
/// Size: 0x0008 (0x000268 - 0x000270)
class UTBP_Buff_SacrificedHand_Unseen_C : public UTigerBuff
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0268   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/Buffs/Items/Artifacts/TBP_Buff_SacrificedHand_Unseen.TBP_Buff_SacrificedHand_Unseen_C.SetShaderParameter
	void SetShaderParameter(ATigerCharacter* InOwner);                                                                       // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Buffs/Items/Artifacts/TBP_Buff_SacrificedHand_Unseen.TBP_Buff_SacrificedHand_Unseen_C.OnActivated
	void OnActivated(ATigerCharacter* InBuffOwner, ATigerCharacter* InBuffCaster);                                           // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Buffs/Items/Artifacts/TBP_Buff_SacrificedHand_Unseen.TBP_Buff_SacrificedHand_Unseen_C.OnDeactivated
	void OnDeactivated(ATigerCharacter* InBuffOwner, ATigerCharacter* InBuffCaster);                                         // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Buffs/Items/Artifacts/TBP_Buff_SacrificedHand_Unseen.TBP_Buff_SacrificedHand_Unseen_C.OnRefreshed
	void OnRefreshed(ATigerCharacter* InBuffOwner, ATigerCharacter* InBuffCaster);                                           // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Buffs/Items/Artifacts/TBP_Buff_SacrificedHand_Unseen.TBP_Buff_SacrificedHand_Unseen_C.ExecuteUbergraph_TBP_Buff_SacrificedHand_Unseen
	void ExecuteUbergraph_TBP_Buff_SacrificedHand_Unseen(int32_t EntryPoint);                                                // [0x197e4f0] Final                
};

/// Class /Game/GameBlueprints/Buffs/Archetypes/Vanish/TBP_VanishBuff_Master.TBP_VanishBuff_Master_C
/// Size: 0x0008 (0x000288 - 0x000290)
class UTBP_VanishBuff_Master_C : public UTigerBuffVanish
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0288   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/Buffs/Archetypes/Vanish/TBP_VanishBuff_Master.TBP_VanishBuff_Master_C.OnActivated
	void OnActivated(ATigerCharacter* InBuffOwner, ATigerCharacter* InBuffCaster);                                           // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Buffs/Archetypes/Vanish/TBP_VanishBuff_Master.TBP_VanishBuff_Master_C.OnDeactivated
	void OnDeactivated(ATigerCharacter* InBuffOwner, ATigerCharacter* InBuffCaster);                                         // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Buffs/Archetypes/Vanish/TBP_VanishBuff_Master.TBP_VanishBuff_Master_C.ExecuteUbergraph_TBP_VanishBuff_Master
	void ExecuteUbergraph_TBP_VanishBuff_Master(int32_t EntryPoint);                                                         // [0x197e4f0] Final                
};

/// Class /Game/GameBlueprints/Buffs/Archetypes/TBP_Buff_FleshOfMarble.TBP_Buff_FleshOfMarble_C
/// Size: 0x0014 (0x000268 - 0x00027C)
class UTBP_Buff_FleshOfMarble_C : public UTigerBuffDisciplineVentrueClan
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0268   (0x0008)  
	FVector                                            SpeedColor;                                                 // 0x0270   (0x000C)  


	/// Functions
	// Function /Game/GameBlueprints/Buffs/Archetypes/TBP_Buff_FleshOfMarble.TBP_Buff_FleshOfMarble_C.OnActivated
	void OnActivated(ATigerCharacter* InBuffOwner, ATigerCharacter* InBuffCaster);                                           // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Buffs/Archetypes/TBP_Buff_FleshOfMarble.TBP_Buff_FleshOfMarble_C.OnDeactivated
	void OnDeactivated(ATigerCharacter* InBuffOwner, ATigerCharacter* InBuffCaster);                                         // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Buffs/Archetypes/TBP_Buff_FleshOfMarble.TBP_Buff_FleshOfMarble_C.ExecuteUbergraph_TBP_Buff_FleshOfMarble
	void ExecuteUbergraph_TBP_Buff_FleshOfMarble(int32_t EntryPoint);                                                        // [0x197e4f0] Final                
};

/// Class /Game/GameBlueprints/Buffs/Archetypes/Muse/NightingaleBuffs/TBP_Buff_BurstHeal.TBP_Buff_BurstHeal_C
/// Size: 0x0000 (0x000274 - 0x000274)
class UTBP_Buff_BurstHeal_C : public UTBP_Buff_Heal_C
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/PresetBlueprints/Main/Actions/TBP_CamConf_HardLand.TBP_CamConf_HardLand_C
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UTBP_CamConf_HardLand_C : public UTigerCameraPreset
{ 
public:
};

/// Class /Game/GameBlueprints/Powers/TBP_BuffPostProcess_Master.TBP_BuffPostProcess_Master_C
/// Size: 0x0029 (0x000238 - 0x000261)
class ATBP_BuffPostProcess_Master_C : public ATigerBuffPostProcess
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0238   (0x0008)  
	UCurveFloat*                                       VisibilityCurve;                                            // 0x0240   (0x0008)  
	float                                              CurrentDuration;                                            // 0x0248   (0x0004)  
	float                                              TotalDuration;                                              // 0x024C   (0x0004)  
	float                                              CurrentHideDuration;                                        // 0x0250   (0x0004)  
	float                                              TotalHideDuration;                                          // 0x0254   (0x0004)  
	int32_t                                            CurrentlyShownID;                                           // 0x0258   (0x0004)  
	float                                              AdditionalDuration;                                         // 0x025C   (0x0004)  
	bool                                               UseHideDuration;                                            // 0x0260   (0x0001)  


	/// Functions
	// Function /Game/GameBlueprints/Powers/TBP_BuffPostProcess_Master.TBP_BuffPostProcess_Master_C.SetParameters
	void SetParameters(float NormalizedDuration);                                                                            // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/TBP_BuffPostProcess_Master.TBP_BuffPostProcess_Master_C.Refresh
	void Refresh(float NewDuration);                                                                                         // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/TBP_BuffPostProcess_Master.TBP_BuffPostProcess_Master_C.Remove
	void Remove();                                                                                                           // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/TBP_BuffPostProcess_Master.TBP_BuffPostProcess_Master_C.Initialize
	void Initialize(int32_t BuffID, float TotalDuration);                                                                    // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/TBP_BuffPostProcess_Master.TBP_BuffPostProcess_Master_C.ReceiveTick
	void ReceiveTick(float DeltaSeconds);                                                                                    // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/TBP_BuffPostProcess_Master.TBP_BuffPostProcess_Master_C.UpdateDuration
	void UpdateDuration();                                                                                                   // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/TBP_BuffPostProcess_Master.TBP_BuffPostProcess_Master_C.ExecuteUbergraph_TBP_BuffPostProcess_Master
	void ExecuteUbergraph_TBP_BuffPostProcess_Master(int32_t EntryPoint);                                                    // [0x197e4f0] Final                
};

/// Class /Game/GameBlueprints/Items/Consumables/PostProcessing/TBP_BuffPostProcess_BloodBag.TBP_BuffPostProcess_BloodBag_C
/// Size: 0x0000 (0x000261 - 0x000261)
class ATBP_BuffPostProcess_BloodBag_C : public ATBP_BuffPostProcess_Master_C
{ 
public:
};

/// Class /Game/GameBlueprints/Items/Consumables/PostProcessing/TBP_BuffPostProcess_StimPack_SuccessfulUse.TBP_BuffPostProcess_StimPack_SuccessfulUse_C
/// Size: 0x0000 (0x000261 - 0x000261)
class ATBP_BuffPostProcess_StimPack_SuccessfulUse_C : public ATBP_BuffPostProcess_Master_C
{ 
public:
};

/// Class /Game/GameBlueprints/Traversal/BlueprintStates/TBP_PlayerWallGrindState.TBP_PlayerWallGrindState_C
/// Size: 0x00A8 (0x000180 - 0x000228)
class UTBP_PlayerWallGrindState_C : public UTigerTraversalWallGrindState
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0180   (0x0008)  
	TMap<FName, UParticleSystemComponent*>             ParticleSystems;                                            // 0x0188   (0x0050)  
	TMap<FName, TEnumAsByte>                           PhysicalMaterial;                                           // 0x01D8   (0x0050)  


	/// Functions
	// Function /Game/GameBlueprints/Traversal/BlueprintStates/TBP_PlayerWallGrindState.TBP_PlayerWallGrindState_C.AssignPhysicalMaterial
	void AssignPhysicalMaterial(FHitResult& Hit, FName& BoneName);                                                           // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Traversal/BlueprintStates/TBP_PlayerWallGrindState.TBP_PlayerWallGrindState_C.CheckForParticleSystemUpdate
	void CheckForParticleSystemUpdate(FName BoneName, FHitResult HitResult, ACharacter* Character);                          // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Traversal/BlueprintStates/TBP_PlayerWallGrindState.TBP_PlayerWallGrindState_C.DestroyParticleSystem
	void DestroyParticleSystem(FName& BoneName);                                                                             // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Traversal/BlueprintStates/TBP_PlayerWallGrindState.TBP_PlayerWallGrindState_C.CreateParticleSystem
	void CreateParticleSystem(FName BoneName, FHitResult HitResult, ACharacter* Character);                                  // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Traversal/BlueprintStates/TBP_PlayerWallGrindState.TBP_PlayerWallGrindState_C.StartEffect
	void StartEffect(FName& InAssociatedBoneName, FHitResult& InHitResult, ATigerCharacter* InTigerCharacter);               // [0x197e4f0] Event|Protected|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/Traversal/BlueprintStates/TBP_PlayerWallGrindState.TBP_PlayerWallGrindState_C.StopEffect
	void StopEffect(FName& InAssociatedBoneName, ATigerCharacter* InTigerCharacter);                                         // [0x197e4f0] Event|Protected|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/Traversal/BlueprintStates/TBP_PlayerWallGrindState.TBP_PlayerWallGrindState_C.UpdateEffect
	void UpdateEffect(FName& InAssociatedBoneName, FHitResult& InHitResult, ATigerCharacter* InTigerCharacter);              // [0x197e4f0] Event|Protected|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/Traversal/BlueprintStates/TBP_PlayerWallGrindState.TBP_PlayerWallGrindState_C.ExecuteUbergraph_TBP_PlayerWallGrindState
	void ExecuteUbergraph_TBP_PlayerWallGrindState(int32_t EntryPoint);                                                      // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/GameBlueprints/Traversal/Configs/TBP_Traversal_WallJump_Config.TBP_Traversal_WallJump_Config_C
/// Size: 0x0000 (0x0000E0 - 0x0000E0)
class UTBP_Traversal_WallJump_Config_C : public UTigerTraversalStateWallJumpConfig
{ 
public:
};

/// Class /Game/GameBlueprints/Traversal/Configs/TBP_Traversal_WallHang_Config.TBP_Traversal_WallHang_Config_C
/// Size: 0x0000 (0x000068 - 0x000068)
class UTBP_Traversal_WallHang_Config_C : public UTigerTraversalStateWallHangConfig
{ 
public:
};

/// Class /Game/GameBlueprints/Traversal/Configs/TBP_Traversal_WallGrind_Config.TBP_Traversal_WallGrind_Config_C
/// Size: 0x0000 (0x0000C0 - 0x0000C0)
class UTBP_Traversal_WallGrind_Config_C : public UTigerTraversalStateWallGrindConfig
{ 
public:
};

/// Class /Game/GameBlueprints/Traversal/Configs/TBP_Traversal_Walk_Config.TBP_Traversal_Walk_Config_C
/// Size: 0x0000 (0x000050 - 0x000050)
class UTBP_Traversal_Walk_Config_C : public UTigerTraversalStateConfigBase
{ 
public:
};

/// Class /Game/GameBlueprints/Traversal/Configs/TBP_Traversal_Sliding_Config.TBP_Traversal_Sliding_Config_C
/// Size: 0x0000 (0x0000D0 - 0x0000D0)
class UTBP_Traversal_Sliding_Config_C : public UTigerTraversalStateSlidingConfig
{ 
public:
};

/// Class /Game/GameBlueprints/Traversal/Configs/TBP_Traversal_SlideJump_Config.TBP_Traversal_SlideJump_Config_C
/// Size: 0x0000 (0x000088 - 0x000088)
class UTBP_Traversal_SlideJump_Config_C : public UTigerTraversalStateSlideJumpConfig
{ 
public:
};

/// Class /Game/GameBlueprints/Traversal/Configs/TBP_Traversal_LowVault_Config.TBP_Traversal_LowVault_Config_C
/// Size: 0x0000 (0x000088 - 0x000088)
class UTBP_Traversal_LowVault_Config_C : public UTigerTraversalStateLowVaultConfig
{ 
public:
};

/// Class /Game/GameBlueprints/Traversal/Configs/TBP_Traversal_LedgeGrab_Config.TBP_Traversal_LedgeGrab_Config_C
/// Size: 0x0000 (0x0000C0 - 0x0000C0)
class UTBP_Traversal_LedgeGrab_Config_C : public UTigerTraversalStateLedgeGrabConfig
{ 
public:
};

/// Class /Game/GameBlueprints/Traversal/Configs/TBP_Traversal_Jump_Config.TBP_Traversal_Jump_Config_C
/// Size: 0x0000 (0x000078 - 0x000078)
class UTBP_Traversal_Jump_Config_C : public UTigerTraversalStateJumpConfig
{ 
public:
};

/// Class /Game/GameBlueprints/Traversal/Configs/TBP_Traversal_ForcedMove_Config.TBP_Traversal_ForcedMove_Config_C
/// Size: 0x0000 (0x000050 - 0x000050)
class UTBP_Traversal_ForcedMove_Config_C : public UTigerTraversaleStateForcedMoveConfig
{ 
public:
};

/// Class /Game/GameBlueprints/Traversal/Configs/TBP_Traversal_Flying_Config.TBP_Traversal_Flying_Config_C
/// Size: 0x0000 (0x000050 - 0x000050)
class UTBP_Traversal_Flying_Config_C : public UTigerTraversalStateFlyConfig
{ 
public:
};

/// Class /Game/GameBlueprints/Traversal/Configs/TBP_Traversal_Fall_Config.TBP_Traversal_Fall_Config_C
/// Size: 0x0000 (0x000058 - 0x000058)
class UTBP_Traversal_Fall_Config_C : public UTigerTraversalStateFallConfig
{ 
public:
};

/// Class /Game/GameBlueprints/Traversal/Configs/TBP_Traversal_Downed_Config.TBP_Traversal_Downed_Config_C
/// Size: 0x0000 (0x000050 - 0x000050)
class UTBP_Traversal_Downed_Config_C : public UTigerTraversalStateConfigBase
{ 
public:
};

/// Class /Game/GameBlueprints/Traversal/Configs/TBP_Traversal_Crouch_Config.TBP_Traversal_Crouch_Config_C
/// Size: 0x0000 (0x000050 - 0x000050)
class UTBP_Traversal_Crouch_Config_C : public UTigerTraversalStateConfigBase
{ 
public:
};

/// Class /Game/GameBlueprints/Traversal/Configs/TBP_Traversal_Climb_Config.TBP_Traversal_Climb_Config_C
/// Size: 0x0000 (0x000100 - 0x000100)
class UTBP_Traversal_Climb_Config_C : public UTigerTraversalStateClimbingConfig
{ 
public:
};

/// Class /Game/GameBlueprints/Traversal/Configs/TBP_Traversal_AirDash_Config.TBP_Traversal_AirDash_Config_C
/// Size: 0x0000 (0x000068 - 0x000068)
class UTBP_Traversal_AirDash_Config_C : public UTigerTraversalStateAirDashConfig
{ 
public:
};

/// Class /Game/GameBlueprints/Traversal/TBP_PlayerTraversalStateMachine.TBP_PlayerTraversalStateMachine_C
/// Size: 0x0000 (0x0001E8 - 0x0001E8)
class UTBP_PlayerTraversalStateMachine_C : public UTigerTraversalFiniteStateMachine
{ 
public:
};

/// Class /Game/GameBlueprints/TBP_PlayerVFXComponent.TBP_PlayerVFXComponent_C
/// Size: 0x0018 (0x0000B0 - 0x0000C8)
class UTBP_PlayerVFXComponent_C : public UActorComponent
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00B0   (0x0008)  
	ATBP_Player_C*                                     OwnerPlayer;                                                // 0x00B8   (0x0008)  
	UParticleSystemComponent*                          HeavyAttackPS;                                              // 0x00C0   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/TBP_PlayerVFXComponent.TBP_PlayerVFXComponent_C.OnCharacterCustomizationChanged
	void OnCharacterCustomizationChanged();                                                                                  // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_PlayerVFXComponent.TBP_PlayerVFXComponent_C.OnHeavyAttackChargeEnd
	void OnHeavyAttackChargeEnd();                                                                                           // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_PlayerVFXComponent.TBP_PlayerVFXComponent_C.OnHeavyAttackChargeBegin
	void OnHeavyAttackChargeBegin();                                                                                         // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_PlayerVFXComponent.TBP_PlayerVFXComponent_C.OnAppearance Changed
	void OnAppearance Changed(ETigerPlayerApperanceChangeReason InReason);                                                   // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_PlayerVFXComponent.TBP_PlayerVFXComponent_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_PlayerVFXComponent.TBP_PlayerVFXComponent_C.ExecuteUbergraph_TBP_PlayerVFXComponent
	void ExecuteUbergraph_TBP_PlayerVFXComponent(int32_t EntryPoint);                                                        // [0x197e4f0] Final                
};

/// Class /Game/GameBlueprints/TBP_FeedingComponent.TBP_FeedingComponent_C
/// Size: 0x0000 (0x000200 - 0x000200)
class UTBP_FeedingComponent_C : public UTigerFeedingComponent
{ 
public:
};

/// Class /Game/GameBlueprints/Powers/TBP_BuffPostProcessHandler.TBP_BuffPostProcessHandler_C
/// Size: 0x00A8 (0x000200 - 0x0002A8)
class UTBP_BuffPostProcessHandler_C : public USceneComponent
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0200   (0x0008)  
	TMap<int32_t, ATBP_BuffPostProcess_Master_C*>      ActiveList;                                                 // 0x0208   (0x0050)  
	TMap<int32_t, ATBP_BuffPostProcess_Master_C*>      ActiveConsumableList;                                       // 0x0258   (0x0050)  


	/// Functions
	// Function /Game/GameBlueprints/Powers/TBP_BuffPostProcessHandler.TBP_BuffPostProcessHandler_C.GetConsumableBuffDuration
	void GetConsumableBuffDuration(UTigerConsumableAsset* InConsumable, float& OutDuration);                                 // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/GameBlueprints/Powers/TBP_BuffPostProcessHandler.TBP_BuffPostProcessHandler_C.GetConsumableID
	void GetConsumableID(UTigerConsumableAsset* InConsumable, int32_t& OutID);                                               // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/GameBlueprints/Powers/TBP_BuffPostProcessHandler.TBP_BuffPostProcessHandler_C.AddPostProcess
	void AddPostProcess(UClass* PostProcess, float Duration, int32_t ID, ATBP_BuffPostProcess_Master_C*& PostProcessActor);  // [0x197e4f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/TBP_BuffPostProcessHandler.TBP_BuffPostProcessHandler_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/TBP_BuffPostProcessHandler.TBP_BuffPostProcessHandler_C.OnBuffAdded
	void OnBuffAdded(UTigerBuff* Buff, int32_t ID, float Duration);                                                          // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/TBP_BuffPostProcessHandler.TBP_BuffPostProcessHandler_C.OnBuffRefreshed
	void OnBuffRefreshed(UTigerBuff* Buff, int32_t ID, float Duration);                                                      // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/TBP_BuffPostProcessHandler.TBP_BuffPostProcessHandler_C.OnBuffRemoved
	void OnBuffRemoved(UTigerBuff* Buff, int32_t ID, float Duration);                                                        // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/TBP_BuffPostProcessHandler.TBP_BuffPostProcessHandler_C.OnClientBuffIdUpdated
	void OnClientBuffIdUpdated(int32_t OldId, int32_t NewId);                                                                // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/TBP_BuffPostProcessHandler.TBP_BuffPostProcessHandler_C.OnUseConsumableStarted
	void OnUseConsumableStarted(UTigerConsumableAsset* Consumable);                                                          // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/TBP_BuffPostProcessHandler.TBP_BuffPostProcessHandler_C.OnUseConsumableFinished
	void OnUseConsumableFinished(UTigerConsumableAsset* Consumable);                                                         // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/TBP_BuffPostProcessHandler.TBP_BuffPostProcessHandler_C.OnUseConsumableCancelled
	void OnUseConsumableCancelled(UTigerConsumableAsset* Consumable);                                                        // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/TBP_BuffPostProcessHandler.TBP_BuffPostProcessHandler_C.ExecuteUbergraph_TBP_BuffPostProcessHandler
	void ExecuteUbergraph_TBP_BuffPostProcessHandler(int32_t EntryPoint);                                                    // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/GameBlueprints/Character/Customization/TBP_CharacterCustomizationComp.TBP_CharacterCustomizationComp_C
/// Size: 0x0000 (0x000100 - 0x000100)
class UTBP_CharacterCustomizationComp_C : public UTigerCharCustomizationComponent
{ 
public:
};

/// Class /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C
/// Size: 0x04EC (0x001080 - 0x00156C)
class ATBP_Player_C : public ATigerPlayer
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x1080   (0x0008)  
	USpringArmComponent*                               ListenerSpringArm;                                          // 0x1088   (0x0008)  
	USceneComponent*                                   ListenerParent;                                             // 0x1090   (0x0008)  
	UAkComponent*                                      TakeDamageAkComp;                                           // 0x1098   (0x0008)  
	UTBP_PlayerVFXComponent_C*                         TBP_PlayerVFXComponent;                                     // 0x10A0   (0x0008)  
	UPostProcessComponent*                             RainOnCameraPostProcess;                                    // 0x10A8   (0x0008)  
	USceneComponent*                                   ListenerComponent;                                          // 0x10B0   (0x0008)  
	UPostProcessComponent*                             DeathPostProcess;                                           // 0x10B8   (0x0008)  
	UParticleSystemComponent*                          PS_VFX_GasDebuff;                                           // 0x10C0   (0x0008)  
	UStaticMeshComponent*                              OutlineBillboard;                                           // 0x10C8   (0x0008)  
	UTBP_PlayerTraversalStateMachine_C*                PlayerTraversalStateMachine;                                // 0x10D0   (0x0008)  
	UTBP_BuffPostProcessHandler_C*                     BuffPostProcessHandler;                                     // 0x10D8   (0x0008)  
	UPostProcessComponent*                             ScopePostProcess;                                           // 0x10E0   (0x0008)  
	UPostProcessComponent*                             TraversalZoomBlurPostProcess;                               // 0x10E8   (0x0008)  
	UParticleSystemComponent*                          TraversalSmokeTrailFeet;                                    // 0x10F0   (0x0008)  
	UParticleSystemComponent*                          TraversalSmokeTrail;                                        // 0x10F8   (0x0008)  
	USphereComponent*                                  AudioTrigger;                                               // 0x1100   (0x0008)  
	USkeletalMeshComponent*                            SecondaryWeapon;                                            // 0x1108   (0x0008)  
	UPointLightComponent*                              SecondaryMuzzleLight;                                       // 0x1110   (0x0008)  
	UArrowComponent*                                   SecondaryProjectileSpawnLocator;                            // 0x1118   (0x0008)  
	UArrowComponent*                                   SecondaryMuzzleLocator;                                     // 0x1120   (0x0008)  
	UPostProcessComponent*                             RedGasPostProcess;                                          // 0x1128   (0x0008)  
	UPointLightComponent*                              HairLight;                                                  // 0x1130   (0x0008)  
	UTigerHSensesTargetComponent*                      TigerHSensesTarget;                                         // 0x1138   (0x0008)  
	UPostProcessComponent*                             FeedingPostProcess;                                         // 0x1140   (0x0008)  
	UTBP_FeedingComponent_C*                           TBP_FeedingComponent;                                       // 0x1148   (0x0008)  
	USpotLightComponent*                               FeedingLight;                                               // 0x1150   (0x0008)  
	UTBP_CharacterCustomizationComp_C*                 CharacterCustomization;                                     // 0x1158   (0x0008)  
	USpotLightComponent*                               Fill_Light;                                                 // 0x1160   (0x0008)  
	USpotLightComponent*                               Rim_Light;                                                  // 0x1168   (0x0008)  
	USpotLightComponent*                               Key_Light;                                                  // 0x1170   (0x0008)  
	UVectorFieldComponent*                             VectorField;                                                // 0x1178   (0x0008)  
	UPointLightComponent*                              MuzzleLight;                                                // 0x1180   (0x0008)  
	UPostProcessComponent*                             DownedPostProcess;                                          // 0x1188   (0x0008)  
	UArrowComponent*                                   ProjectileSpawnRoot;                                        // 0x1190   (0x0008)  
	UWidgetComponent*                                  HealthBarWidget;                                            // 0x1198   (0x0008)  
	UArrowComponent*                                   ProjectileSpawnLocator;                                     // 0x11A0   (0x0008)  
	UBoxComponent*                                     InteractionVolume;                                          // 0x11A8   (0x0008)  
	UPostProcessComponent*                             LowHealthPostProcess;                                       // 0x11B0   (0x0008)  
	UPostProcessComponent*                             HeightenedSensesPostProcess;                                // 0x11B8   (0x0008)  
	UBoxComponent*                                     FullscreenEffectsVolume;                                    // 0x11C0   (0x0008)  
	UPawnNoiseEmitterComponent*                        PawnNoiseEmitter;                                           // 0x11C8   (0x0008)  
	UArrowComponent*                                   MuzzleLocator;                                              // 0x11D0   (0x0008)  
	UBoxComponent*                                     TriggerVolume;                                              // 0x11D8   (0x0008)  
	USkeletalMeshComponent*                            Weapon;                                                     // 0x11E0   (0x0008)  
	float                                              GasDebuffBurnTimeline_NewTrack_0_84279FD2437A84CAF9924F81F64E1CED; // 0x11E8   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    GasDebuffBurnTimeline__Direction_84279FD2437A84CAF9924F81F64E1CED; // 0x11EC   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x11ED   (0x0003)  MISSED
	UTimelineComponent*                                GasDebuffBurnTimeline;                                      // 0x11F0   (0x0008)  
	float                                              GasDebuffTimeline_NewTrack_0_1887B31C4D0B0FDB42B539B4308CF7BD; // 0x11F8   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    GasDebuffTimeline__Direction_1887B31C4D0B0FDB42B539B4308CF7BD; // 0x11FC   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x11FD   (0x0003)  MISSED
	UTimelineComponent*                                GasDebuffTimeline;                                          // 0x1200   (0x0008)  
	float                                              OutlineTimeline_Visibility_EAAB304D4327221D27448EAC650058F1; // 0x1208   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    OutlineTimeline__Direction_EAAB304D4327221D27448EAC650058F1; // 0x120C   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x120D   (0x0003)  MISSED
	UTimelineComponent*                                OutlineTimeline;                                            // 0x1210   (0x0008)  
	float                                              MuzzleFlashLight2Timeline_Intensity_CEEB9A454434A38325252583A6A3B6F4; // 0x1218   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    MuzzleFlashLight2Timeline__Direction_CEEB9A454434A38325252583A6A3B6F4; // 0x121C   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x121D   (0x0003)  MISSED
	UTimelineComponent*                                MuzzleFlashLight2Timeline;                                  // 0x1220   (0x0008)  
	FVector                                            ScopeTimeline_FocusPosition_9CD21C2B43ADAB5B313DF2BE583E31DA; // 0x1228   (0x000C)  
	float                                              ScopeTimeline_IsScoped_9CD21C2B43ADAB5B313DF2BE583E31DA;    // 0x1234   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    ScopeTimeline__Direction_9CD21C2B43ADAB5B313DF2BE583E31DA;  // 0x1238   (0x0001)  
	unsigned char                                      UnknownData04_5[0x7];                                       // 0x1239   (0x0007)  MISSED
	UTimelineComponent*                                ScopeTimeline;                                              // 0x1240   (0x0008)  
	float                                              MuzzleFlashLightTimeline_Intensity_051DB23B4BC6020389CC78B6EF022930; // 0x1248   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    MuzzleFlashLightTimeline__Direction_051DB23B4BC6020389CC78B6EF022930; // 0x124C   (0x0001)  
	unsigned char                                      UnknownData05_5[0x3];                                       // 0x124D   (0x0003)  MISSED
	UTimelineComponent*                                MuzzleFlashLightTimeline;                                   // 0x1250   (0x0008)  
	TEnumAsByte<ETimelineDirection>                    Check_Dodge__Direction_2340BDC0451DB765FEDE2CB7146A5511;    // 0x1258   (0x0001)  
	unsigned char                                      UnknownData06_5[0x7];                                       // 0x1259   (0x0007)  MISSED
	UTimelineComponent*                                Check_Dodge;                                                // 0x1260   (0x0008)  
	float                                              Timeline_Diablerize_Short_NewTrack_0_6970392F467F11B38587869BF53D9986; // 0x1268   (0x0004)  
	float                                              Timeline_Diablerize_Short_Transition_6970392F467F11B38587869BF53D9986; // 0x126C   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Timeline_Diablerize_Short__Direction_6970392F467F11B38587869BF53D9986; // 0x1270   (0x0001)  
	unsigned char                                      UnknownData07_5[0x7];                                       // 0x1271   (0x0007)  MISSED
	UTimelineComponent*                                Timeline_Diablerize_Short;                                  // 0x1278   (0x0008)  
	TEnumAsByte<ETimelineDirection>                    Timeline_13__Direction_8F0808F345D8234F85595F9450BAE209;    // 0x1280   (0x0001)  
	unsigned char                                      UnknownData08_5[0x7];                                       // 0x1281   (0x0007)  MISSED
	UTimelineComponent*                                Timeline;                                                   // 0x1288   (0x0008)  
	float                                              Timeline_8_Opacity_7E2D82864AB41D91CE8753A3A2E4951C;        // 0x1290   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Timeline_8__Direction_7E2D82864AB41D91CE8753A3A2E4951C;     // 0x1294   (0x0001)  
	unsigned char                                      UnknownData09_5[0x3];                                       // 0x1295   (0x0003)  MISSED
	UTimelineComponent*                                Timeline;                                                   // 0x1298   (0x0008)  
	float                                              Timeline_7_Zoom_30D72BD24E1509A1AF3FB099FA1C9EB6;           // 0x12A0   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Timeline_7__Direction_30D72BD24E1509A1AF3FB099FA1C9EB6;     // 0x12A4   (0x0001)  
	unsigned char                                      UnknownData10_5[0x3];                                       // 0x12A5   (0x0003)  MISSED
	UTimelineComponent*                                Timeline;                                                   // 0x12A8   (0x0008)  
	float                                              Timeline_2_RainMultiplier_CECBE516414697453F25FAB3B5FB331C; // 0x12B0   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Timeline_2__Direction_CECBE516414697453F25FAB3B5FB331C;     // 0x12B4   (0x0001)  
	unsigned char                                      UnknownData11_5[0x3];                                       // 0x12B5   (0x0003)  MISSED
	UTimelineComponent*                                Timeline;                                                   // 0x12B8   (0x0008)  
	float                                              Timeline_1_Sprint_Strength_2AEA3DD140966E986A8A2A830078C114; // 0x12C0   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Timeline_1__Direction_2AEA3DD140966E986A8A2A830078C114;     // 0x12C4   (0x0001)  
	unsigned char                                      UnknownData12_5[0x3];                                       // 0x12C5   (0x0003)  MISSED
	UTimelineComponent*                                Timeline;                                                   // 0x12C8   (0x0008)  
	float                                              Timeline_0_FOV_Animation_CF5E7F2B4EE15F828E27CEACA36BC0AB;  // 0x12D0   (0x0004)  
	float                                              Timeline_0_Sprint_Strength_CF5E7F2B4EE15F828E27CEACA36BC0AB; // 0x12D4   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Timeline_0__Direction_CF5E7F2B4EE15F828E27CEACA36BC0AB;     // 0x12D8   (0x0001)  
	unsigned char                                      UnknownData13_5[0x7];                                       // 0x12D9   (0x0007)  MISSED
	UTimelineComponent*                                Timeline;                                                   // 0x12E0   (0x0008)  
	float                                              Timeline_4_Zoom_1CA12BEA4ECFEA2FB018C7BE4DE80E72;           // 0x12E8   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Timeline_4__Direction_1CA12BEA4ECFEA2FB018C7BE4DE80E72;     // 0x12EC   (0x0001)  
	unsigned char                                      UnknownData14_5[0x3];                                       // 0x12ED   (0x0003)  MISSED
	UTimelineComponent*                                Timeline;                                                   // 0x12F0   (0x0008)  
	float                                              Timeline_3_Opacity_B82857664678EB85DC4CA0A80BD4542E;        // 0x12F8   (0x0004)  
	TEnumAsByte<ETimelineDirection>                    Timeline_3__Direction_B82857664678EB85DC4CA0A80BD4542E;     // 0x12FC   (0x0001)  
	unsigned char                                      UnknownData15_5[0x3];                                       // 0x12FD   (0x0003)  MISSED
	UTimelineComponent*                                Timeline;                                                   // 0x1300   (0x0008)  
	float                                              Inside;                                                     // 0x1308   (0x0004)  
	int32_t                                            FeedingAudioAkEventID;                                      // 0x130C   (0x0004)  
	float                                              DownedBlendWeight;                                          // 0x1310   (0x0004)  
	float                                              InAssaultedZoneBlendWeight;                                 // 0x1314   (0x0004)  
	float                                              NearAssaultedZoneBlendWeight;                               // 0x1318   (0x0004)  
	unsigned char                                      UnknownData16_5[0x4];                                       // 0x131C   (0x0004)  MISSED
	UAudioComponent*                                   HeightenedSensesSoundLoop;                                  // 0x1320   (0x0008)  
	float                                              OriginalRainRate;                                           // 0x1328   (0x0004)  
	unsigned char                                      UnknownData17_5[0x4];                                       // 0x132C   (0x0004)  MISSED
	FTimerHandle                                       HSensesDelayHandle;                                         // 0x1330   (0x0008)  
	TArray<USkeletalMeshComponent*>                    SkeletalMeshDuplicates;                                     // 0x1338   (0x0010)  
	int32_t                                            CurrentTrailLoop;                                           // 0x1348   (0x0004)  
	float                                              AnimFloat1;                                                 // 0x134C   (0x0004)  
	float                                              AnimFloat2;                                                 // 0x1350   (0x0004)  
	unsigned char                                      UnknownData18_5[0x4];                                       // 0x1354   (0x0004)  MISSED
	USkeletalMeshComponent*                            HeartMesh_Smoke;                                            // 0x1358   (0x0008)  
	ATBP_AshPile_C*                                    AshFxActor;                                                 // 0x1360   (0x0008)  
	bool                                               DiablerizeFinished;                                         // 0x1368   (0x0001)  
	bool                                               IsBeingDiablerized;                                         // 0x1369   (0x0001)  
	ETigerPlayerLifeStatus                             LifeStatus;                                                 // 0x136A   (0x0001)  
	unsigned char                                      UnknownData19_5[0x1];                                       // 0x136B   (0x0001)  MISSED
	FVector                                            PreviousCameraLocation;                                     // 0x136C   (0x000C)  
	FVector                                            Previous;                                                   // 0x1378   (0x000C)  
	unsigned char                                      UnknownData20_5[0x4];                                       // 0x1384   (0x0004)  MISSED
	UParticleSystemComponent*                          ScoutedParticles;                                           // 0x1388   (0x0008)  
	float                                              BloodVisibility;                                            // 0x1390   (0x0004)  
	unsigned char                                      UnknownData21_5[0x4];                                       // 0x1394   (0x0004)  MISSED
	ATigerNPC*                                         CurrentNPCBeingFedOn;                                       // 0x1398   (0x0008)  
	bool                                               bWasAimGliding;                                             // 0x13A0   (0x0001)  
	unsigned char                                      UnknownData22_5[0x3];                                       // 0x13A1   (0x0003)  MISSED
	int32_t                                            FeedingBloodIndex;                                          // 0x13A4   (0x0004)  
	TArray<float>                                      FeedingBloodVisibility;                                     // 0x13A8   (0x0010)  
	float                                              CurrentFeedingVisibility;                                   // 0x13B8   (0x0004)  
	unsigned char                                      UnknownData23_5[0x4];                                       // 0x13BC   (0x0004)  MISSED
	FMulticastInlineDelegate                           SpeedFullscreenEffectEventDispatch;                         // 0x13C0   (0x0010)  
	UAkAudioEvent*                                     ProjectileCloseFlyby;                                       // 0x13D0   (0x0008)  
	bool                                               Was_Previously_Inside_Holy_Incense;                         // 0x13D8   (0x0001)  
	unsigned char                                      UnknownData24_5[0x7];                                       // 0x13D9   (0x0007)  MISSED
	FTimerHandle                                       TraversalMostRecentTimer;                                   // 0x13E0   (0x0008)  
	int32_t                                            WallGrindAkEventID;                                         // 0x13E8   (0x0004)  
	int32_t                                            DiablerizeVictimAkEventID;                                  // 0x13EC   (0x0004)  
	int32_t                                            DiablerizeAkEventID;                                        // 0x13F0   (0x0004)  
	int32_t                                            ReviveAkEventID;                                            // 0x13F4   (0x0004)  
	int32_t                                            SlideAkEventID;                                             // 0x13F8   (0x0004)  
	FVector                                            PositionLastFrame;                                          // 0x13FC   (0x000C)  
	int32_t                                            ShieldShaderCount;                                          // 0x1408   (0x0004)  
	unsigned char                                      UnknownData25_5[0x4];                                       // 0x140C   (0x0004)  MISSED
	TMap<TEnumAsByte, FName>                           SurfaceToAudioName;                                         // 0x1410   (0x0050)  
	float                                              FeedingProgress;                                            // 0x1460   (0x0004)  
	unsigned char                                      UnknownData26_5[0x4];                                       // 0x1464   (0x0004)  MISSED
	UNiagaraSystem*                                    CashedDownedParticle;                                       // 0x1468   (0x0008)  
	FSoftObjectPath                                    NiagaraDownedPath;                                          // 0x1470   (0x0018)  
	UNiagaraComponent*                                 DownedNiagara;                                              // 0x1488   (0x0008)  
	UNiagaraComponent*                                 DownedNiagara2;                                             // 0x1490   (0x0008)  
	int32_t                                            FeedingLoopAkEventID;                                       // 0x1498   (0x0004)  
	bool                                               ExposePlayerInHeightenedSenses;                             // 0x149C   (0x0001)  
	unsigned char                                      UnknownData27_5[0x3];                                       // 0x149D   (0x0003)  MISSED
	float                                              DistanceToHolyIncenseVolume;                                // 0x14A0   (0x0004)  
	bool                                               ShouldUpdateListenerPosition;                               // 0x14A4   (0x0001)  
	unsigned char                                      UnknownData28_5[0x3];                                       // 0x14A5   (0x0003)  MISSED
	FVector2D                                          InterpolatedDirectionToRedGasEdge;                          // 0x14A8   (0x0008)  
	bool                                               bEnableHealthBars;                                          // 0x14B0   (0x0001)  
	unsigned char                                      UnknownData29_5[0x3];                                       // 0x14B1   (0x0003)  MISSED
	FVector                                            TakeDamageLocation;                                         // 0x14B4   (0x000C)  
	float                                              FeedingFadeOutTime;                                         // 0x14C0   (0x0004)  
	FVector                                            ListenerOffset;                                             // 0x14C4   (0x000C)  
	FVector                                            Intersection;                                               // 0x14D0   (0x000C)  
	float                                              RedGasPostProcessMaxFadeDistance;                           // 0x14DC   (0x0004)  
	bool                                               bWasScopedIn;                                               // 0x14E0   (0x0001)  
	unsigned char                                      UnknownData30_5[0x7];                                       // 0x14E1   (0x0007)  MISSED
	UParticleSystem*                                   FleshOfMarbleOverrideHitEffect;                             // 0x14E8   (0x0008)  
	TMap<TEnumAsByte, FName>                           WeaponTypeToAudioName;                                      // 0x14F0   (0x0050)  
	bool                                               MotionBlurEnabled;                                          // 0x1540   (0x0001)  
	unsigned char                                      UnknownData31_5[0x7];                                       // 0x1541   (0x0007)  MISSED
	TArray<UPostProcessComponent*>                     PostProcessesEnabledByDefault;                              // 0x1548   (0x0010)  
	bool                                               bPostProcessesEnabled;                                      // 0x1558   (0x0001)  
	bool                                               bIsWallGrinding;                                            // 0x1559   (0x0001)  
	unsigned char                                      UnknownData32_5[0x2];                                       // 0x155A   (0x0002)  MISSED
	FName                                              CurrentPhysMaterial;                                        // 0x155C   (0x0008)  
	FName                                              PhysMaterialSet;                                            // 0x1564   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.GetWeapon
	void GetWeapon(USkeletalMeshComponent*& OutWeapon, USkeletalMeshComponent*& OutSecondWeapon);                            // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.UpdateMaterialSwitchForAudio
	void UpdateMaterialSwitchForAudio();                                                                                     // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.CheckForSpectator
	void CheckForSpectator();                                                                                                // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.EnablePostProcesses
	void EnablePostProcesses();                                                                                              // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.Collect Post Processes Enabled by Default
	void Collect Post Processes Enabled by Default();                                                                        // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.QualityOptionChanged
	void QualityOptionChanged(FTigerGraphicsSettings& GraphicsSettings, FTigerGraphicsSettingsPS5& GraphicsSettingsPS5);     // [0x197e4f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.HandleFeedingStopForAudio
	void HandleFeedingStopForAudio();                                                                                        // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.Handle Feeding Start for Audio
	void Handle Feeding Start for Audio();                                                                                   // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.SetShieldShaderParameters
	void SetShieldShaderParameters();                                                                                        // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.HandleRedGasProximityAudio
	void HandleRedGasProximityAudio();                                                                                       // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.SetupBodyPartPrimitiveData
	void SetupBodyPartPrimitiveData();                                                                                       // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.PostFlybyAudio
	void PostFlybyAudio(TEnumAsByte<ENUM_RangedWeaponCategories>& Key, FVector Location, UAkAudioEvent* AkEvent);            // [0x197e4f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.SendArchetypeToMaterial
	void SendArchetypeToMaterial();                                                                                          // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.SetCullCustomDepth
	void SetCullCustomDepth(bool InValue);                                                                                   // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.SetUpMasqueradeAudio
	void SetUpMasqueradeAudio();                                                                                             // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnRedGasPostProcessMaterialLoaded
	void OnRedGasPostProcessMaterialLoaded(TArray<UObject*>& InLoadedObjects);                                               // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.SetupQualityOptions
	void SetupQualityOptions();                                                                                              // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.InitHealthBars
	void InitHealthBars();                                                                                                   // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.UpdateSPCPlayerMaterialCollection
	void UpdateSPCPlayerMaterialCollection();                                                                                // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.Update Red Gas MPC
	void Update Red Gas MPC();                                                                                               // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.StartRedGasAudio
	void StartRedGasAudio();                                                                                                 // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.StopRedGasAudio
	void StopRedGasAudio();                                                                                                  // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.CheckShouldUpdateListenerPosition
	bool CheckShouldUpdateListenerPosition(APlayerController* Player Controller);                                            // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.EnableCharacterlighting
	void EnableCharacterlighting();                                                                                          // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.SetLodOnLocalPlayer
	void SetLodOnLocalPlayer();                                                                                              // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.SetAudioListenerOverride
	void SetAudioListenerOverride();                                                                                         // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.SetDamageTakenAudioSwitch
	void SetDamageTakenAudioSwitch(float Value, AActor* InInstigator);                                                       // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.StartSlidingAudio
	void StartSlidingAudio();                                                                                                // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.DetermineOwnerOfProjectile
	void DetermineOwnerOfProjectile(UObject* Object, ATigerProjectile*& AsTiger Projectile);                                 // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.SetRTPC:AltitudePlayer
	void SetRTPC:AltitudePlayer();                                                                                           // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.SetReverbStateOnExit
	void SetReverbStateOnExit(UObject* Object);                                                                              // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.SetReverbStateOnEnter
	void SetReverbStateOnEnter(UObject* Object);                                                                             // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.DisableScreenCullSize
	void DisableScreenCullSize();                                                                                            // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.PostLandingAudio
	void PostLandingAudio();                                                                                                 // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.PlayBeingDiablerizedAudio
	void PlayBeingDiablerizedAudio();                                                                                        // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.PlayDiablerizeAudio
	void PlayDiablerizeAudio();                                                                                              // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.PlayReviveAudio
	void PlayReviveAudio();                                                                                                  // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.DisableAllPostProcess
	void DisableAllPostProcess();                                                                                            // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.StopCloseToRedGasAudio
	void StopCloseToRedGasAudio();                                                                                           // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.StartCloseToRedGasAudio
	void StartCloseToRedGasAudio();                                                                                          // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnTraversalPostProcessEnded
	void OnTraversalPostProcessEnded();                                                                                      // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.UpdateTraversalPostProcess
	void UpdateTraversalPostProcess(float Duration, float Strength, FVector2D FocusPosition);                                // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.GetDiablerizeEffectStartTime
	float GetDiablerizeEffectStartTime();                                                                                    // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.DeactivateHeavyChargeFX
	void DeactivateHeavyChargeFX();                                                                                          // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.UpdateAimGlideCosmetic
	void UpdateAimGlideCosmetic();                                                                                           // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.DisableSkeletonSmokeEffects
	void DisableSkeletonSmokeEffects();                                                                                      // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.SetupCharacterDuplicates
	void SetupCharacterDuplicates(USkeletalMeshComponent* SkeletalMeshOriginal);                                             // [0x197e4f0] Private|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.SwiftStrikeFX
	void SwiftStrikeFX();                                                                                                    // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnGroupMemberLifeStatusChanged
	void OnGroupMemberLifeStatusChanged(ETigerPlayerLifeStatus NewLifeStatus);                                               // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.UpdateInRedGasEffect
	void UpdateInRedGasEffect(float Delta Time);                                                                             // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.UpdateDownedFX
	void UpdateDownedFX(float DeltaTime);                                                                                    // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.IsLocalClient
	void IsLocalClient(bool& Client);                                                                                        // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.UpdateFeedingFX
	void UpdateFeedingFX(float Delta);                                                                                       // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.Set Rain Amount
	void Set Rain Amount();                                                                                                  // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.StunVisualEffect
	void StunVisualEffect(AActor* self2);                                                                                    // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.UserConstructionScript
	void UserConstructionScript();                                                                                           // [0x197e4f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.Timeline_3__FinishedFunc
	void Timeline_3__FinishedFunc();                                                                                         // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.Timeline_3__UpdateFunc
	void Timeline_3__UpdateFunc();                                                                                           // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.Timeline_4__FinishedFunc
	void Timeline_4__FinishedFunc();                                                                                         // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.Timeline_4__UpdateFunc
	void Timeline_4__UpdateFunc();                                                                                           // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.Timeline_0__FinishedFunc
	void Timeline_0__FinishedFunc();                                                                                         // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.Timeline_0__UpdateFunc
	void Timeline_0__UpdateFunc();                                                                                           // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.Timeline_1__FinishedFunc
	void Timeline_1__FinishedFunc();                                                                                         // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.Timeline_1__UpdateFunc
	void Timeline_1__UpdateFunc();                                                                                           // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.Timeline_2__FinishedFunc
	void Timeline_2__FinishedFunc();                                                                                         // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.Timeline_2__UpdateFunc
	void Timeline_2__UpdateFunc();                                                                                           // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.Timeline_7__FinishedFunc
	void Timeline_7__FinishedFunc();                                                                                         // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.Timeline_7__UpdateFunc
	void Timeline_7__UpdateFunc();                                                                                           // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.Timeline_8__FinishedFunc
	void Timeline_8__FinishedFunc();                                                                                         // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.Timeline_8__UpdateFunc
	void Timeline_8__UpdateFunc();                                                                                           // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.ScopeTimeline__FinishedFunc
	void ScopeTimeline__FinishedFunc();                                                                                      // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.ScopeTimeline__UpdateFunc
	void ScopeTimeline__UpdateFunc();                                                                                        // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.Timeline_13__FinishedFunc
	void Timeline_13__FinishedFunc();                                                                                        // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.Timeline_13__UpdateFunc
	void Timeline_13__UpdateFunc();                                                                                          // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.Timeline_13__InvulnerabilityTrigger__EventFunc
	void Timeline_13__InvulnerabilityTrigger__EventFunc();                                                                   // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.Timeline_13__ToggleCharacterVisibility__EventFunc
	void Timeline_13__ToggleCharacterVisibility__EventFunc();                                                                // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.Timeline_Diablerize_Short__FinishedFunc
	void Timeline_Diablerize_Short__FinishedFunc();                                                                          // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.Timeline_Diablerize_Short__UpdateFunc
	void Timeline_Diablerize_Short__UpdateFunc();                                                                            // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.Check Dodge__FinishedFunc
	void Check Dodge__FinishedFunc();                                                                                        // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.Check Dodge__UpdateFunc
	void Check Dodge__UpdateFunc();                                                                                          // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.MuzzleFlashLightTimeline__FinishedFunc
	void MuzzleFlashLightTimeline__FinishedFunc();                                                                           // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.MuzzleFlashLightTimeline__UpdateFunc
	void MuzzleFlashLightTimeline__UpdateFunc();                                                                             // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.MuzzleFlashLight2Timeline__FinishedFunc
	void MuzzleFlashLight2Timeline__FinishedFunc();                                                                          // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.MuzzleFlashLight2Timeline__UpdateFunc
	void MuzzleFlashLight2Timeline__UpdateFunc();                                                                            // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OutlineTimeline__FinishedFunc
	void OutlineTimeline__FinishedFunc();                                                                                    // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OutlineTimeline__UpdateFunc
	void OutlineTimeline__UpdateFunc();                                                                                      // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.GasDebuffTimeline__FinishedFunc
	void GasDebuffTimeline__FinishedFunc();                                                                                  // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.GasDebuffTimeline__UpdateFunc
	void GasDebuffTimeline__UpdateFunc();                                                                                    // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.GasDebuffBurnTimeline__FinishedFunc
	void GasDebuffBurnTimeline__FinishedFunc();                                                                              // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.GasDebuffBurnTimeline__UpdateFunc
	void GasDebuffBurnTimeline__UpdateFunc();                                                                                // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.InpActEvt_Left_K2Node_InputKeyEvent
	void InpActEvt_Left_K2Node_InputKeyEvent(FKey Key);                                                                      // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.InpActEvt_Right_K2Node_InputKeyEvent
	void InpActEvt_Right_K2Node_InputKeyEvent(FKey Key);                                                                     // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.InpActEvt_PageUp_K2Node_InputKeyEvent
	void InpActEvt_PageUp_K2Node_InputKeyEvent(FKey Key);                                                                    // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.InpActEvt_PageDown_K2Node_InputKeyEvent
	void InpActEvt_PageDown_K2Node_InputKeyEvent(FKey Key);                                                                  // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnLocalDisciplineUse
	void OnLocalDisciplineUse(FDisciplineUse& DisciplineUse, float ExpectedDuration);                                        // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.DisciplineJumpFinished
	void DisciplineJumpFinished();                                                                                           // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnLocalDisciplineUseFailed
	void OnLocalDisciplineUseFailed(FDisciplineUse& DisciplineUse);                                                          // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.LocalPlayer BeginPlay
	void LocalPlayer BeginPlay();                                                                                            // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnLocalSprintStarted
	void OnLocalSprintStarted();                                                                                             // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnLocalSprintEnded
	void OnLocalSprintEnded();                                                                                               // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnLocalEnteredIndoor
	void OnLocalEnteredIndoor();                                                                                             // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnLocalExitedIndoor
	void OnLocalExitedIndoor();                                                                                              // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnStartedFeedingApproach
	void OnStartedFeedingApproach(float TravelTime);                                                                         // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnFeedingDoneEvent
	void OnFeedingDoneEvent(bool bTargetIsDrained, ATigerCharacter* InTargetFedOn);                                          // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnTigerMovementModeChanged
	void OnTigerMovementModeChanged(TEnumAsByte<EMovementMode> PrevMovementMode, ETigerMovementMode PrevCustomMode, TEnumAsByte<EMovementMode> NewMovementMode, ETigerMovementMode NewCustomMode); // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnExtraHealthDepleted
	void OnExtraHealthDepleted();                                                                                            // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnStartedAimingCameraTransition
	void OnStartedAimingCameraTransition();                                                                                  // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnStoppedAimingCameraTransition
	void OnStoppedAimingCameraTransition();                                                                                  // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnMasqueradeStateChanged_Event
	void OnMasqueradeStateChanged_Event(bool InIsMasqueradeBreached, ETigerAIPlayerAction InPlayerAction);                   // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.ReceiveActorBeginOverlap
	void ReceiveActorBeginOverlap(AActor* OtherActor);                                                                       // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.ReceiveActorEndOverlap
	void ReceiveActorEndOverlap(AActor* OtherActor);                                                                         // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnShieldDepleted
	void OnShieldDepleted(ATigerPlayer* InInstigator);                                                                       // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnModEquipped
	void OnModEquipped();                                                                                                    // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.Client On Mod Equipped
	void Client On Mod Equipped();                                                                                           // [0x197e4f0] Net|NetClient|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.K2_OnEndViewTarget
	void K2_OnEndViewTarget(APlayerController* PC);                                                                          // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.LocalPlayerTick
	void LocalPlayerTick(float InDeltaSeconds);                                                                              // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.BndEvt__TBP_Player_AudioTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
	void BndEvt__TBP_Player_AudioTrigger_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x197e4f0] HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnBuffAdded
	void OnBuffAdded(UTigerBuff* Buff, int32_t ID, float Duration);                                                          // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnDisciplineUseSucceeded
	void OnDisciplineUseSucceeded(FDisciplineUse& DisciplineUse);                                                            // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnLanded
	void OnLanded(FHitResult& Hit);                                                                                          // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.ReceivePossessed
	void ReceivePossessed(AController* NewController);                                                                       // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnShowDamageAmount
	void OnShowDamageAmount(FVector& InHitLocation, FLinearColor& InDamageColor, int32_t InTotalDamageAmount, int32_t InHealthDamageAmount, bool bInHasExtraHealth, bool bInHasShield, float InRangedDamageFalloffPercent); // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnWeaponFired
	void OnWeaponFired(bool bSecondaryWeaponFired);                                                                          // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnRep_PlayerClan
	void OnRep_PlayerClan();                                                                                                 // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.LifeStatusChanged
	void LifeStatusChanged(ETigerPlayerLifeStatus NewLifeStatus);                                                            // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnGotPlayerState
	void OnGotPlayerState();                                                                                                 // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnRep_PowerKit
	void OnRep_PowerKit();                                                                                                   // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnDodged
	void OnDodged(bool IsControllingPlayer, bool bLaunchedInAir, FVector LaunchDirection, char DodgeStage);                  // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.ReceiveEndPlay
	void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason);                                                          // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnGotScouted
	void OnGotScouted();                                                                                                     // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnNoLongerScouted
	void OnNoLongerScouted();                                                                                                // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnAboutToBeHitByDisplacement
	void OnAboutToBeHitByDisplacement();                                                                                     // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnDamageTaken
	void OnDamageTaken(float DamageTaken, AActor* DamageInstigator);                                                         // [0x197e4f0] BlueprintCosmetic|Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnDoubleJump
	void OnDoubleJump(FVector& Direction);                                                                                   // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnPlayMeleeHitEffects
	void OnPlayMeleeHitEffects(UTigerMeleeWeapon* WeaponHitBy, FVector& ImpactLocation, FVector& HitDirection);              // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnStartedPhysicalInteraction
	void OnStartedPhysicalInteraction(UClass* PhysInteractionClass, bool bIsTargetPlayer);                                   // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnInterruptedPhysicalInteraction
	void OnInterruptedPhysicalInteraction(UClass* PhysInteractionClass, bool bIsTargetPlayer);                               // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnFinishedPhysicalInteraction
	void OnFinishedPhysicalInteraction(UClass* PhysInteractionClass, bool bIsTargetPlayer);                                  // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnWeaponVisualChangedEvent
	void OnWeaponVisualChangedEvent();                                                                                       // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnWallJump
	void OnWallJump(FVector& InVelocity);                                                                                    // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnClimbStarted
	void OnClimbStarted(FVector& InVelocity);                                                                                // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnClimbEnded
	void OnClimbEnded(FVector& InVelocity);                                                                                  // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnWallGrindStarted
	void OnWallGrindStarted(FVector& InVelocity);                                                                            // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnWallGrindEnded
	void OnWallGrindEnded(FVector& InVelocity);                                                                              // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnHardLanding
	void OnHardLanding(FVector& InVelocity);                                                                                 // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnSlideJump
	void OnSlideJump(FVector& InVelocity);                                                                                   // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnSlidingStarted
	void OnSlidingStarted(FVector& InVelocity);                                                                              // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnSlidingEnded
	void OnSlidingEnded(FVector& InVelocity);                                                                                // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnBecameSpectator
	void OnBecameSpectator();                                                                                                // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnBecameGroupMember
	void OnBecameGroupMember(bool bInExtendedGroupMember);                                                                   // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnStoppedBeingGroupMember
	void OnStoppedBeingGroupMember();                                                                                        // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.BndEvt__OutlineComponent_K2Node_ComponentBoundEvent_2_OnOutlineModeRefreshed__DelegateSignature
	void BndEvt__OutlineComponent_K2Node_ComponentBoundEvent_2_OnOutlineModeRefreshed__DelegateSignature(ETigerOutlineMode HighestPrioOutline); // [0x197e4f0] BlueprintEvent       
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.UpdateHolyIncenseEffect
	void UpdateHolyIncenseEffect(float InDeltaTime);                                                                         // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.IncrementShieldShaderCounter
	void IncrementShieldShaderCounter();                                                                                     // [0x197e4f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.DecrementShieldShaderCounter
	void DecrementShieldShaderCounter();                                                                                     // [0x197e4f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.IncrementFeedingBloodIndex
	void IncrementFeedingBloodIndex();                                                                                       // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnGoneBelowHalfHealth
	void OnGoneBelowHalfHealth();                                                                                            // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.StopDeathTransition
	void StopDeathTransition();                                                                                              // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnGotHitForAudio
	void OnGotHitForAudio(FName& InSurfaceForAudio);                                                                         // [0x197e4f0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnStartedFeedingForAudio
	void OnStartedFeedingForAudio(float TravelTime);                                                                         // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnFeedingDoneForAudio
	void OnFeedingDoneForAudio(bool bTargetIsDrained, ATigerCharacter* InTargetFedOn);                                       // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.UpdateHolyIncenseAudio
	void UpdateHolyIncenseAudio();                                                                                           // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.OnRestart
	void OnRestart();                                                                                                        // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.ExecuteUbergraph_TBP_Player
	void ExecuteUbergraph_TBP_Player(int32_t EntryPoint);                                                                    // [0x197e4f0] Final|HasDefaults    
	// Function /Game/GameBlueprints/Character/TBP_Player.TBP_Player_C.SpeedFullscreenEffectEventDispatch__DelegateSignature
	void SpeedFullscreenEffectEventDispatch__DelegateSignature(float TravelTime, bool bIsFeedingApproach);                   // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/GameBlueprints/Powers/HeightenedSenses/TBP_FeralSenses_Component.TBP_FeralSenses_Component_C
/// Size: 0x0070 (0x000148 - 0x0001B8)
class UTBP_FeralSenses_Component_C : public UTigerUtilityPowerHSenseComponent
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0148   (0x0008)  
	UCurveFloat*                                       ActivatedOpacityCurve;                                      // 0x0150   (0x0008)  
	UCurveFloat*                                       DeactivatedOpacityCurve;                                    // 0x0158   (0x0008)  
	UCurveFloat*                                       ActivatedBurstCurve;                                        // 0x0160   (0x0008)  
	FTimerHandle                                       TimerHandle;                                                // 0x0168   (0x0008)  
	UCurveFloat*                                       ActivatedDesaturationCurve;                                 // 0x0170   (0x0008)  
	UCurveFloat*                                       DeactivatedDesaturationCurve;                               // 0x0178   (0x0008)  
	FLinearColor                                       FogColor;                                                   // 0x0180   (0x0010)  
	FLinearColor                                       FogNearColor;                                               // 0x0190   (0x0010)  
	float                                              FogStartRange;                                              // 0x01A0   (0x0004)  
	float                                              FogEndRange;                                                // 0x01A4   (0x0004)  
	float                                              TimeMultiplier;                                             // 0x01A8   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x01AC   (0x0004)  MISSED
	ATBP_Player_C*                                     Player;                                                     // 0x01B0   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/Powers/HeightenedSenses/TBP_FeralSenses_Component.TBP_FeralSenses_Component_C.HandleBloodTrackUpgrades
	void HandleBloodTrackUpgrades();                                                                                         // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/HeightenedSenses/TBP_FeralSenses_Component.TBP_FeralSenses_Component_C.GetCurrentHeightenedSensesViewLength
	float GetCurrentHeightenedSensesViewLength();                                                                            // [0x197e4f0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/GameBlueprints/Powers/HeightenedSenses/TBP_FeralSenses_Component.TBP_FeralSenses_Component_C.ContinueUpdatingBurst
	void ContinueUpdatingBurst();                                                                                            // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/HeightenedSenses/TBP_FeralSenses_Component.TBP_FeralSenses_Component_C.FadeoutSetup
	void FadeoutSetup();                                                                                                     // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/HeightenedSenses/TBP_FeralSenses_Component.TBP_FeralSenses_Component_C.FadeInSetup2
	void FadeInSetup2();                                                                                                     // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/HeightenedSenses/TBP_FeralSenses_Component.TBP_FeralSenses_Component_C.FadeInSetup1
	void FadeInSetup1();                                                                                                     // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/HeightenedSenses/TBP_FeralSenses_Component.TBP_FeralSenses_Component_C.UpdateHeightenedSenses
	void UpdateHeightenedSenses();                                                                                           // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/HeightenedSenses/TBP_FeralSenses_Component.TBP_FeralSenses_Component_C.FinishHeightenedSenses
	void FinishHeightenedSenses();                                                                                           // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/HeightenedSenses/TBP_FeralSenses_Component.TBP_FeralSenses_Component_C.GetOwnersBloodScanPostFX
	void GetOwnersBloodScanPostFX(UPostProcessComponent*& BloodScanPostFX);                                                  // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/GameBlueprints/Powers/HeightenedSenses/TBP_FeralSenses_Component.TBP_FeralSenses_Component_C.GetOwnersHeartScan
	void GetOwnersHeartScan(UParticleSystemComponent*& Heart Scan Effect Plane);                                             // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/GameBlueprints/Powers/HeightenedSenses/TBP_FeralSenses_Component.TBP_FeralSenses_Component_C.OnActivateHeightenedSenses
	void OnActivateHeightenedSenses();                                                                                       // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/HeightenedSenses/TBP_FeralSenses_Component.TBP_FeralSenses_Component_C.OnDeactivateHeightenedSenses
	void OnDeactivateHeightenedSenses();                                                                                     // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/HeightenedSenses/TBP_FeralSenses_Component.TBP_FeralSenses_Component_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/HeightenedSenses/TBP_FeralSenses_Component.TBP_FeralSenses_Component_C.ReceiveTick
	void ReceiveTick(float DeltaSeconds);                                                                                    // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/HeightenedSenses/TBP_FeralSenses_Component.TBP_FeralSenses_Component_C.ExecuteUbergraph_TBP_FeralSenses_Component
	void ExecuteUbergraph_TBP_FeralSenses_Component(int32_t EntryPoint);                                                     // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/GameBlueprints/Player/TBP_ChatComponent.TBP_ChatComponent_C
/// Size: 0x0028 (0x0000D0 - 0x0000F8)
class UTBP_ChatComponent_C : public UTigerChatComponent
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00D0   (0x0008)  
	UUserWidget*                                       ChatWindow;                                                 // 0x00D8   (0x0008)  
	bool                                               bPreventMessages;                                           // 0x00E0   (0x0001)  
	bool                                               bIsSoloMatch;                                               // 0x00E1   (0x0001)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x00E2   (0x0006)  MISSED
	TArray<FTigerChatMessage>                          BufferedMessages;                                           // 0x00E8   (0x0010)  


	/// Functions
	// Function /Game/GameBlueprints/Player/TBP_ChatComponent.TBP_ChatComponent_C.CanOpenChat
	void CanOpenChat(bool& Result);                                                                                          // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/GameBlueprints/Player/TBP_ChatComponent.TBP_ChatComponent_C.OnFailedToJoinParty
	void OnFailedToJoinParty(ETigerJoinedPartyFailedReason InJoinedPartyFailedReason);                                       // [0x197e4f0] Event|Protected|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/TBP_ChatComponent.TBP_ChatComponent_C.OnBlockedPlayerWasRemovedFromParty
	void OnBlockedPlayerWasRemovedFromParty(bool bInWasBlockedByMe);                                                         // [0x197e4f0] Event|Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/TBP_ChatComponent.TBP_ChatComponent_C.OnLeftPartyDueToBlockedPlayerJoinBlueprint
	void OnLeftPartyDueToBlockedPlayerJoinBlueprint(bool bInWasKicked);                                                      // [0x197e4f0] Event|Protected|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/TBP_ChatComponent.TBP_ChatComponent_C.OnLoaded_5480FD144B182ADDBFA34EB41371AFF7
	void OnLoaded_5480FD144B182ADDBFA34EB41371AFF7(UClass* Loaded);                                                          // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/TBP_ChatComponent.TBP_ChatComponent_C.Server_SendChatMessageToClients
	void Server_SendChatMessageToClients(FText MessageText, bool bWriteOnlyToGroupMembers);                                  // [0x197e4f0] Net|NetReliableNetServer|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/TBP_ChatComponent.TBP_ChatComponent_C.OnMessageInput
	void OnMessageInput(FText MessageText, bool OnlyGroup);                                                                  // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/TBP_ChatComponent.TBP_ChatComponent_C.OnChatMessageReceived
	void OnChatMessageReceived(FTigerChatMessage& InMessage);                                                                // [0x197e4f0] Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/TBP_ChatComponent.TBP_ChatComponent_C.OpenChatWindow
	void OpenChatWindow();                                                                                                   // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/TBP_ChatComponent.TBP_ChatComponent_C.PreventChatUntilInElysium
	void PreventChatUntilInElysium();                                                                                        // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/TBP_ChatComponent.TBP_ChatComponent_C.Welcome Players In Chat
	void Welcome Players In Chat();                                                                                          // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/TBP_ChatComponent.TBP_ChatComponent_C.CreateChatWindow
	void CreateChatWindow();                                                                                                 // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/TBP_ChatComponent.TBP_ChatComponent_C.OnBanStatusUpdated
	void OnBanStatusUpdated(FTigerMuteInfo& InMuteInfo);                                                                     // [0x197e4f0] Event|Protected|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/TBP_ChatComponent.TBP_ChatComponent_C.AddChatMessage
	void AddChatMessage(FTigerChatMessage InMessage);                                                                        // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/TBP_ChatComponent.TBP_ChatComponent_C.SendBufferedMessages
	void SendBufferedMessages();                                                                                             // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/TBP_ChatComponent.TBP_ChatComponent_C.OnGameModeSelectionClosed
	void OnGameModeSelectionClosed(UTigerMenuWidget* InMenuWidget);                                                          // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Player/TBP_ChatComponent.TBP_ChatComponent_C.ExecuteUbergraph_TBP_ChatComponent
	void ExecuteUbergraph_TBP_ChatComponent(int32_t EntryPoint);                                                             // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/GameBlueprints/Online/TBP_TigerSessionSeeker.TBP_TigerSessionSeeker_C
/// Size: 0x0038 (0x0001B0 - 0x0001E8)
class UTBP_TigerSessionSeeker_C : public UTigerSessionSeeker
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x01B0   (0x0008)  
	FTigerBpFindSessionResultList                      FindSessionResults;                                         // 0x01B8   (0x0028)  
	UTBP_TigerGameInstance_C*                          GameInstanceBP;                                             // 0x01E0   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/Online/TBP_TigerSessionSeeker.TBP_TigerSessionSeeker_C.OnFailed_911A3FB24EB46568E8895DBD29076B9E
	void OnFailed_911A3FB24EB46568E8895DBD29076B9E();                                                                        // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Online/TBP_TigerSessionSeeker.TBP_TigerSessionSeeker_C.OnSuccess_911A3FB24EB46568E8895DBD29076B9E
	void OnSuccess_911A3FB24EB46568E8895DBD29076B9E();                                                                       // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Online/TBP_TigerSessionSeeker.TBP_TigerSessionSeeker_C.SettingSynced_0F49896A4CCC5EF51613AEA169C1C444
	void SettingSynced_0F49896A4CCC5EF51613AEA169C1C444();                                                                   // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Online/TBP_TigerSessionSeeker.TBP_TigerSessionSeeker_C.OnFailed_0146C451405A7ED2AEDCEF977F1EB70D
	void OnFailed_0146C451405A7ED2AEDCEF977F1EB70D();                                                                        // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Online/TBP_TigerSessionSeeker.TBP_TigerSessionSeeker_C.OnUnmatched_0146C451405A7ED2AEDCEF977F1EB70D
	void OnUnmatched_0146C451405A7ED2AEDCEF977F1EB70D();                                                                     // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Online/TBP_TigerSessionSeeker.TBP_TigerSessionSeeker_C.OnMatched_0146C451405A7ED2AEDCEF977F1EB70D
	void OnMatched_0146C451405A7ED2AEDCEF977F1EB70D();                                                                       // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Online/TBP_TigerSessionSeeker.TBP_TigerSessionSeeker_C.OnSuccess_0146C451405A7ED2AEDCEF977F1EB70D
	void OnSuccess_0146C451405A7ED2AEDCEF977F1EB70D(FTigerBpFindSessionResultList& Result);                                  // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Online/TBP_TigerSessionSeeker.TBP_TigerSessionSeeker_C.JoinBPImpl
	void JoinBPImpl();                                                                                                       // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Online/TBP_TigerSessionSeeker.TBP_TigerSessionSeeker_C.SeekBPImpl
	void SeekBPImpl(FString InGameModeId, int32_t InGameModeIndex, ESessionType InSessionType);                              // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Online/TBP_TigerSessionSeeker.TBP_TigerSessionSeeker_C.ServerSelectionCancelled
	void ServerSelectionCancelled();                                                                                         // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Online/TBP_TigerSessionSeeker.TBP_TigerSessionSeeker_C.OnServerSelected
	void OnServerSelected(FTigerBpFindSessionSelectedSession Session);                                                       // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Online/TBP_TigerSessionSeeker.TBP_TigerSessionSeeker_C.ExecuteUbergraph_TBP_TigerSessionSeeker
	void ExecuteUbergraph_TBP_TigerSessionSeeker(int32_t EntryPoint);                                                        // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/GameBlueprints/Online/TBP_TigerOnlineStatusMessages.TBP_TigerOnlineStatusMessages_C
/// Size: 0x0000 (0x0000E8 - 0x0000E8)
class UTBP_TigerOnlineStatusMessages_C : public UTigerOnlineStatusMessages
{ 
public:
};

/// Class /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C
/// Size: 0x0231 (0x000B40 - 0x000D71)
class UTBP_TigerGameInstance_C : public UTigerGameInstance
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0B40   (0x0008)  
	UTBP_UI_JoinElysiumScreen_C*                       JoinElysiumScreenWB;                                        // 0x0B48   (0x0008)  
	UTBP_UI_LobbyMenu_C*                               LobbyMenuWB;                                                // 0x0B50   (0x0008)  
	UTBP_UI_HostMenu_C*                                HostMenuWB;                                                 // 0x0B58   (0x0008)  
	UTBP_UI_FindGameFailedMenu_C*                      FindGameFailedMenuWB;                                       // 0x0B60   (0x0008)  
	int32_t                                            MaxPlayers;                                                 // 0x0B68   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0B6C   (0x0004)  MISSED
	FText                                              ServerName;                                                 // 0x0B70   (0x0018)  
	UTBP_UI_MatchMenu_C*                               MatchMenuWB;                                                // 0x0B88   (0x0008)  
	FString                                            PlayerSettingsSave;                                         // 0x0B90   (0x0010)  
	bool                                               bMainMenuIsOpen;                                            // 0x0BA0   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0BA1   (0x0007)  MISSED
	UTBP_UI_JoinGameMenu_C*                            JoinGameMenuWB;                                             // 0x0BA8   (0x0008)  
	UTBP_UI_GroupInvitationList_C*                     InvitationListWB;                                           // 0x0BB0   (0x0008)  
	UTBP_UI_ServerSelection_C*                         ServerSelectionMenuWB;                                      // 0x0BB8   (0x0008)  
	FMulticastInlineDelegate                           OnJoinGameCountdownBegin;                                   // 0x0BC0   (0x0010)  
	UTBP_UI_TutorialMenu_C*                            TutorialMenuWB;                                             // 0x0BD0   (0x0008)  
	UTBP_UI_JoinPartyElysiumScreen_C*                  JoinPartyElysiumScreenWB;                                   // 0x0BD8   (0x0008)  
	TWeakObjectPtr<UObject*>                           ErrorStringTable;                                           // 0x0BE0   (0x0028)  
	FString                                            TraveledFrom;                                               // 0x0C08   (0x0010)  
	FTigerBpFindSessionSelectedSession                 SelectedSession;                                            // 0x0C18   (0x0110)  
	UAkAudioEvent*                                     MenuMusicEvent;                                             // 0x0D28   (0x0008)  
	UTBP_UI_Tutorial_IntroText_C*                      TutorialIntroWB;                                            // 0x0D30   (0x0008)  
	FMulticastInlineDelegate                           OnTitleScreenFadeOutStarted;                                // 0x0D38   (0x0010)  
	UTBP_UI_VoiceChatPopup_C*                          VoiceChatPopup;                                             // 0x0D48   (0x0008)  
	FMulticastInlineDelegate                           OnForceCloseMainMenu;                                       // 0x0D50   (0x0010)  
	FMulticastInlineDelegate                           OnHealthWarningShown;                                       // 0x0D60   (0x0010)  
	bool                                               bHasSeenEpilepsyWarning;                                    // 0x0D70   (0x0001)  


	/// Functions
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.CheckMainMenuConditionsAndForceClose
	void CheckMainMenuConditionsAndForceClose();                                                                             // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.GetIngameMenuUI
	void GetIngameMenuUI(UTigerIngameMenuWidget*& IngameMenuUI);                                                             // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.GetUIColor
	FLinearColor GetUIColor(ETigerUIColor UIColor, ETigerColourSpace ColorSpace);                                            // [0x197e4f0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.IsAllowedToOpenMainMenu
	bool IsAllowedToOpenMainMenu();                                                                                          // [0x197e4f0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.GetJoinErrorText
	void GetJoinErrorText(FText& OutErrorText, bool& bHadError);                                                             // [0x197e4f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.GetErrorStringTableId
	void GetErrorStringTableId(FName& TableId);                                                                              // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.IsInMatch
	void IsInMatch(bool& InMatch);                                                                                           // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.IsElysiumGameMenuOpen
	void IsElysiumGameMenuOpen(bool& bIsOpen);                                                                               // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.CreateJoinGameMenu
	void CreateJoinGameMenu(UTBP_UI_JoinGameMenu_C*& Output_Get);                                                            // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.CloseMenuWidget
	void CloseMenuWidget(UTigerMenuWidget* Widget);                                                                          // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OpenMenuWidget
	void OpenMenuWidget(UTigerMenuWidget* Widget, int32_t ZOrder, bool IgnoreMatched);                                       // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.TravelErrorToString
	void TravelErrorToString(TEnumAsByte<ETravelFailure> FailureType, FString& OutString);                                   // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.NetErrorToString
	void NetErrorToString(TEnumAsByte<ENetworkFailure> FailureType, FString& OutString);                                     // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnPreLoadingDone_CA1249C244C7069F7709069D760517F5
	void OnPreLoadingDone_CA1249C244C7069F7709069D760517F5();                                                                // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnEnterElysium_CA1249C244C7069F7709069D760517F5
	void OnEnterElysium_CA1249C244C7069F7709069D760517F5();                                                                  // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnEnterElysiumFirstTime_CA1249C244C7069F7709069D760517F5
	void OnEnterElysiumFirstTime_CA1249C244C7069F7709069D760517F5();                                                         // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnLaunchTutorial_CA1249C244C7069F7709069D760517F5
	void OnLaunchTutorial_CA1249C244C7069F7709069D760517F5();                                                                // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.SettingSynced_F84C62744FD1A855B9C1AD9954A00F97
	void SettingSynced_F84C62744FD1A855B9C1AD9954A00F97();                                                                   // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnFailed_1E6BE8B346DD94D56C97728AB4E9C7C5
	void OnFailed_1E6BE8B346DD94D56C97728AB4E9C7C5();                                                                        // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnUnmatched_1E6BE8B346DD94D56C97728AB4E9C7C5
	void OnUnmatched_1E6BE8B346DD94D56C97728AB4E9C7C5();                                                                     // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnMatched_1E6BE8B346DD94D56C97728AB4E9C7C5
	void OnMatched_1E6BE8B346DD94D56C97728AB4E9C7C5();                                                                       // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnSuccess_1E6BE8B346DD94D56C97728AB4E9C7C5
	void OnSuccess_1E6BE8B346DD94D56C97728AB4E9C7C5(FTigerBpFindSessionResultList& Result);                                  // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.ShowHostMenu
	void ShowHostMenu();                                                                                                     // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OpenLobbyMenu
	void OpenLobbyMenu();                                                                                                    // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.LaunchElysiumServer
	void LaunchElysiumServer(int32_t NumberOfPlayers, bool EnableLan?, FText ServerName);                                    // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnLoginSucceeded
	void OnLoginSucceeded(TArray<FTigerPersistentPlayerCharacter>& AvailableCharacters);                                     // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnLoginFailed
	void OnLoginFailed(FTigerLoginFailedInfo& InLoginFailedInfo);                                                            // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.HandleNetworkError
	void HandleNetworkError(TEnumAsByte<ENetworkFailure> FailureType, bool bIsServer);                                       // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.HandleTravelError
	void HandleTravelError(TEnumAsByte<ETravelFailure> FailureType);                                                         // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.EnterBootFlow
	void EnterBootFlow();                                                                                                    // [0x197e4f0] Net|NetReliableNetClient|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.ToggleLobbyMeny
	void ToggleLobbyMeny();                                                                                                  // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.CloseLobbyMenu
	void CloseLobbyMenu();                                                                                                   // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnLegalDocumentAcceptanceResult
	void OnLegalDocumentAcceptanceResult(TArray<ETigerLegalDocumentType>& InDocumentTypes);                                  // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.CloseFindGameFailedMenu
	void CloseFindGameFailedMenu();                                                                                          // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnGetUserPrivileges
	void OnGetUserPrivileges();                                                                                              // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnCreateCharacterResult
	void OnCreateCharacterResult(FTigerPersistentCharacterID& CharacterId, bool bWasCharacterCreated);                       // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnCharacterSelected
	void OnCharacterSelected();                                                                                              // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OpenFindElysiumMenu
	void OpenFindElysiumMenu(bool bStartSearch, bool bStartHidden, bool bFirstTime);                                         // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.CloseFindElysiumMenu
	void CloseFindElysiumMenu();                                                                                             // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OpenMatchMenu
	void OpenMatchMenu();                                                                                                    // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OpenLoadingScreen
	void OpenLoadingScreen(TWeakObjectPtr<UClass*> TigerGameMode);                                                           // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.CloseLoadingScreen
	void CloseLoadingScreen();                                                                                               // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.ReturnToCharacterSelection
	void ReturnToCharacterSelection();                                                                                       // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OpenJoinGameMenu
	void OpenJoinGameMenu(FTigerBpFindSessionSelectedSession SessionToJoin);                                                 // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.CloseJoinGameMenu
	void CloseJoinGameMenu();                                                                                                // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.ReceiveInvitation
	void ReceiveInvitation(FTigerGroupInvitation& Invitation, ATigerPlayerState* Inviter);                                   // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.RemoveInvitationList
	void RemoveInvitationList();                                                                                             // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OpenServerSelectionMenu
	void OpenServerSelectionMenu(FTigerBpFindSessionResultList Sessions);                                                    // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.CloseServerSelectionMenu
	void CloseServerSelectionMenu();                                                                                         // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OpenFindGameFailedMenu
	void OpenFindGameFailedMenu();                                                                                           // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnSelected
	void OnSelected(FTigerBpFindSessionSelectedSession Session);                                                             // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.FadeInLoadingScreen
	void FadeInLoadingScreen(TWeakObjectPtr<UClass*> TigerGameMode);                                                         // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.FadeOutLoadingScreen
	void FadeOutLoadingScreen();                                                                                             // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnInitialLevelStreamingCompleted
	void OnInitialLevelStreamingCompleted();                                                                                 // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnClosedJoinElysium
	void OnClosedJoinElysium(FString ErrorString);                                                                           // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnSuccessfulJoin
	void OnSuccessfulJoin();                                                                                                 // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.ReturnToBootStartMapTransfer
	void ReturnToBootStartMapTransfer();                                                                                     // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.PostLoadMapWithWorld
	void PostLoadMapWithWorld();                                                                                             // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnGetValidGameVersionResult
	void OnGetValidGameVersionResult(ETigerVersionIsValidResult Result);                                                     // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnIgnored_Dispatch_Event
	void OnIgnored_Dispatch_Event();                                                                                         // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.FindMatch
	void FindMatch(FString InGameModeId, int32_t InGameModeIndex);                                                           // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.RetryPostLoadMap
	void RetryPostLoadMap();                                                                                                 // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.CancelJoinGame
	void CancelJoinGame();                                                                                                   // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.ReceiveInit
	void ReceiveInit();                                                                                                      // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OpenTutorialMenu
	void OpenTutorialMenu();                                                                                                 // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.CloseTutorialMenu
	void CloseTutorialMenu();                                                                                                // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnTransferLoadingScreenOpaque
	void OnTransferLoadingScreenOpaque();                                                                                    // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.TransferFromMatch
	void TransferFromMatch();                                                                                                // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnJoinPartyElysiumFailed
	void OnJoinPartyElysiumFailed(FString ErrorString);                                                                      // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.CloseJoinPartyElysiumMenu
	void CloseJoinPartyElysiumMenu();                                                                                        // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnJoinPartyElysiumSuccess
	void OnJoinPartyElysiumSuccess();                                                                                        // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnTransferToPartyElysiumFadeComplete
	void OnTransferToPartyElysiumFadeComplete();                                                                             // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OpenJoinPartyElysiumScreen
	void OpenJoinPartyElysiumScreen();                                                                                       // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.KickToLoginScreen
	void KickToLoginScreen();                                                                                                // [0x197e4f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnLoadingScreenFullyOpaque_Event
	void OnLoadingScreenFullyOpaque_Event();                                                                                 // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnCreateGameSessionFailed
	void OnCreateGameSessionFailed();                                                                                        // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.JoinSessionThroughUrl
	void JoinSessionThroughUrl(FString SessionURL);                                                                          // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.ShowMoviesAndTitleScreen
	void ShowMoviesAndTitleScreen();                                                                                         // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.Cheat_QuitTutorial
	void Cheat_QuitTutorial();                                                                                               // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.Transfer from Match
	void Transfer from Match();                                                                                              // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.CloseMatchMenu
	void CloseMatchMenu();                                                                                                   // [0x197e4f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.ToggleTutorialMenu
	void ToggleTutorialMenu();                                                                                               // [0x197e4f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.ReturnToElysium
	void ReturnToElysium();                                                                                                  // [0x197e4f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.ShowPostMatchScreen
	void ShowPostMatchScreen(bool bInShouldLeaveParty);                                                                      // [0x197e4f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.ToggleMatchMeny
	void ToggleMatchMeny();                                                                                                  // [0x197e4f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.ReturnToBootWithError
	void ReturnToBootWithError(FString InError);                                                                             // [0x197e4f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.TransferToPartyElysium
	void TransferToPartyElysium();                                                                                           // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.LoadingToTuorialFullyOpaque
	void LoadingToTuorialFullyOpaque();                                                                                      // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.RetryTutorial
	void RetryTutorial();                                                                                                    // [0x197e4f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.GameStateSet
	void GameStateSet();                                                                                                     // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.EnableVoipPopups
	void EnableVoipPopups(bool InEnable);                                                                                    // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.TransferToElysium
	void TransferToElysium();                                                                                                // [0x197e4f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.WaitForJoinParty
	void WaitForJoinParty();                                                                                                 // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnJoinedParty
	void OnJoinedParty(FTigerParty& InParty);                                                                                // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnJoinPartyFailed
	void OnJoinPartyFailed(ETigerJoinedPartyFailedReason InJoinedPartyFailedReason);                                         // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.ReturnToCharacterSelectionDispatcher
	void ReturnToCharacterSelectionDispatcher();                                                                             // [0x197e4f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnSessionsFound
	void OnSessionsFound(FTigerBpFindSessionResultList ResultsList);                                                         // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.TravelToTutorial
	void TravelToTutorial();                                                                                                 // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnWinScreenShown
	void OnWinScreenShown();                                                                                                 // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.ShowHealthWarning
	void ShowHealthWarning();                                                                                                // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnDone
	void OnDone();                                                                                                           // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnLogosCompleted
	void OnLogosCompleted();                                                                                                 // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnEpilepsyWarningshown
	void OnEpilepsyWarningshown();                                                                                           // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnCinematicsCompleted
	void OnCinematicsCompleted();                                                                                            // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnTitleClosed
	void OnTitleClosed();                                                                                                    // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnTitleScreenBeginFadeOut
	void OnTitleScreenBeginFadeOut();                                                                                        // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnHealthWarningDisplayed
	void OnHealthWarningDisplayed();                                                                                         // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnSkipVideos
	void OnSkipVideos();                                                                                                     // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.CloseTitleScreen
	void CloseTitleScreen();                                                                                                 // [0x197e4f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.ExecuteUbergraph_TBP_TigerGameInstance
	void ExecuteUbergraph_TBP_TigerGameInstance(int32_t EntryPoint);                                                         // [0x197e4f0] Final|HasDefaults    
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnHealthWarningShown__DelegateSignature
	void OnHealthWarningShown__DelegateSignature();                                                                          // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnForceCloseMainMenu__DelegateSignature
	void OnForceCloseMainMenu__DelegateSignature();                                                                          // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnTitleScreenFadeOutStarted__DelegateSignature
	void OnTitleScreenFadeOutStarted__DelegateSignature();                                                                   // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/TBP_TigerGameInstance.TBP_TigerGameInstance_C.OnJoinGameCountdownBegin__DelegateSignature
	void OnJoinGameCountdownBegin__DelegateSignature();                                                                      // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/GameBlueprints/Powers/Toreador/Specializations/ProjectionDash/TBP_BuffPostProcess_ProjectionDash.TBP_BuffPostProcess_ProjectionDash_C
/// Size: 0x0037 (0x000261 - 0x000298)
class ATBP_BuffPostProcess_ProjectionDash_C : public ATBP_BuffPostProcess_Master_C
{ 
public:
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0261   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0268   (0x0008)  
	UMaterialInterface*                                Material;                                                   // 0x0270   (0x0008)  
	FLinearColor                                       Color;                                                      // 0x0278   (0x0010)  
	FMulticastInlineDelegate                           Tick;                                                       // 0x0288   (0x0010)  


	/// Functions
	// Function /Game/GameBlueprints/Powers/Toreador/Specializations/ProjectionDash/TBP_BuffPostProcess_ProjectionDash.TBP_BuffPostProcess_ProjectionDash_C.UserConstructionScript
	void UserConstructionScript();                                                                                           // [0x197e4f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Toreador/Specializations/ProjectionDash/TBP_BuffPostProcess_ProjectionDash.TBP_BuffPostProcess_ProjectionDash_C.ReceiveTick
	void ReceiveTick(float DeltaSeconds);                                                                                    // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Toreador/Specializations/ProjectionDash/TBP_BuffPostProcess_ProjectionDash.TBP_BuffPostProcess_ProjectionDash_C.ExecuteUbergraph_TBP_BuffPostProcess_ProjectionDash
	void ExecuteUbergraph_TBP_BuffPostProcess_ProjectionDash(int32_t EntryPoint);                                            // [0x197e4f0] Final                
	// Function /Game/GameBlueprints/Powers/Toreador/Specializations/ProjectionDash/TBP_BuffPostProcess_ProjectionDash.TBP_BuffPostProcess_ProjectionDash_C.Tick__DelegateSignature
	void Tick__DelegateSignature();                                                                                          // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/GameBlueprints/Powers/Toreador/Specializations/BlindingBeauty/TBP_BuffPostProcess_BlindingBeauty.TBP_BuffPostProcess_BlindingBeauty_C
/// Size: 0x0017 (0x000261 - 0x000278)
class ATBP_BuffPostProcess_BlindingBeauty_C : public ATBP_BuffPostProcess_Master_C
{ 
public:
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0261   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0268   (0x0008)  
	UCurveFloat*                                       FlashCurve;                                                 // 0x0270   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/Powers/Toreador/Specializations/BlindingBeauty/TBP_BuffPostProcess_BlindingBeauty.TBP_BuffPostProcess_BlindingBeauty_C.SetParameters
	void SetParameters(float NormalizedDuration);                                                                            // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Toreador/Specializations/BlindingBeauty/TBP_BuffPostProcess_BlindingBeauty.TBP_BuffPostProcess_BlindingBeauty_C.ExecuteUbergraph_TBP_BuffPostProcess_BlindingBeauty
	void ExecuteUbergraph_TBP_BuffPostProcess_BlindingBeauty(int32_t EntryPoint);                                            // [0x197e4f0] Final                
};

/// Class /Game/GameBlueprints/Buffs/Archetypes/Saboteur/TechnocratBuff/TBP_Buff_Trap.TBP_Buff_Trap_C
/// Size: 0x0000 (0x000278 - 0x000278)
class UTBP_Buff_Trap_C : public UTigerBuffDOT
{ 
public:
};

/// Class /Game/GameBlueprints/EmitterSpawnStrategies/TBP_DefaultColorCoding.TBP_DefaultColorCoding_C
/// Size: 0x0000 (0x000058 - 0x000058)
class UTBP_DefaultColorCoding_C : public UTigerDisciplineParticleStrategy
{ 
public:
};

/// Class /Game/GameBlueprints/Buffs/Archetypes/Prowler/TBP_Buff_Revealed.TBP_Buff_Revealed_C
/// Size: 0x0000 (0x000268 - 0x000268)
class UTBP_Buff_Revealed_C : public UTigerBuff
{ 
public:
};

/// Class /Game/GameBlueprints/Disciplines/WorldRepresentation/TBP_ShockwaveWallTrail.TBP_ShockwaveWallTrail_C
/// Size: 0x0018 (0x000228 - 0x000240)
class ATBP_ShockwaveWallTrail_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0228   (0x0008)  
	UParticleSystemComponent*                          ParticleSystem_trail;                                       // 0x0230   (0x0008)  
	USceneComponent*                                   DefaultSceneRoot;                                           // 0x0238   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/Disciplines/WorldRepresentation/TBP_ShockwaveWallTrail.TBP_ShockwaveWallTrail_C.StopSpawningParticles
	void StopSpawningParticles();                                                                                            // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Disciplines/WorldRepresentation/TBP_ShockwaveWallTrail.TBP_ShockwaveWallTrail_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Disciplines/WorldRepresentation/TBP_ShockwaveWallTrail.TBP_ShockwaveWallTrail_C.ReceiveTick
	void ReceiveTick(float DeltaSeconds);                                                                                    // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Disciplines/WorldRepresentation/TBP_ShockwaveWallTrail.TBP_ShockwaveWallTrail_C.ExecuteUbergraph_TBP_ShockwaveWallTrail
	void ExecuteUbergraph_TBP_ShockwaveWallTrail(int32_t EntryPoint);                                                        // [0x197e4f0] Final                
};

/// Class /Game/GameBlueprints/Buffs/Archetypes/Outlaw/TBP_Buff_EarthShock_Stunned.TBP_Buff_EarthShock_Stunned_C
/// Size: 0x0000 (0x000268 - 0x000268)
class UTBP_Buff_EarthShock_Stunned_C : public UTigerBuff
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/CameraShakes/TBP_CamShake_MeleeAttack_Heavy.TBP_CamShake_MeleeAttack_Heavy_C
/// Size: 0x0000 (0x000180 - 0x000180)
class UTBP_CamShake_MeleeAttack_Heavy_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/CameraShakes/TBP_CamShake_VetruePowerTwo.TBP_CamShake_VetruePowerTwo_C
/// Size: 0x0000 (0x000180 - 0x000180)
class UTBP_CamShake_VetruePowerTwo_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/CameraShakes/TBP_CamShake_VetruePowerTwo_Trigger.TBP_CamShake_VetruePowerTwo_Trigger_C
/// Size: 0x0000 (0x000180 - 0x000180)
class UTBP_CamShake_VetruePowerTwo_Trigger_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/CameraShakes/TBP_CamShake_UnyieldingCharge.TBP_CamShake_UnyieldingCharge_C
/// Size: 0x0000 (0x000180 - 0x000180)
class UTBP_CamShake_UnyieldingCharge_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/CameraShakes/TBP_CamShake_Groundslam_Low.TBP_CamShake_Groundslam_Low_C
/// Size: 0x0000 (0x000180 - 0x000180)
class UTBP_CamShake_Groundslam_Low_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/GameBlueprints/Powers/Brujah/Clan/MightyLeap/TBP_MightyLeap.TBP_MightyLeap_C
/// Size: 0x0008 (0x000168 - 0x000170)
class UTBP_MightyLeap_C : public UTigerDisciplineJump
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0168   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/Powers/Brujah/Clan/MightyLeap/TBP_MightyLeap.TBP_MightyLeap_C.GetTargetPosition
	FVector GetTargetPosition(FVector& PlayerEyeLocation, FRotator& CameraRotation, float JumpCheckDistance);                // [0x197e4f0] Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Brujah/Clan/MightyLeap/TBP_MightyLeap.TBP_MightyLeap_C.OnLeapEnded
	void OnLeapEnded();                                                                                                      // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Brujah/Clan/MightyLeap/TBP_MightyLeap.TBP_MightyLeap_C.OnLeapStarted
	void OnLeapStarted();                                                                                                    // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Brujah/Clan/MightyLeap/TBP_MightyLeap.TBP_MightyLeap_C.ExecuteUbergraph_TBP_MightyLeap
	void ExecuteUbergraph_TBP_MightyLeap(int32_t EntryPoint);                                                                // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/GameBlueprints/Camera/PresetBlueprints/Other/TBP_CamConf_MightyLeap.TBP_CamConf_MightyLeap_C
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UTBP_CamConf_MightyLeap_C : public UTigerCameraPreset
{ 
public:
};

/// Class /Game/GameBlueprints/Powers/Brujah/Specializations/GroundSlam/TBP_EarthShock.TBP_EarthShock_C
/// Size: 0x0064 (0x000178 - 0x0001DC)
class UTBP_EarthShock_C : public UTigerDisciplineEarthshock
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0178   (0x0008)  
	UDecalComponent*                                   Indicator;                                                  // 0x0180   (0x0008)  
	float                                              IndicatorOffset;                                            // 0x0188   (0x0004)  
	int32_t                                            AimingAkEventID;                                            // 0x018C   (0x0004)  
	UCurveFloat*                                       LeapTimeCurve;                                              // 0x0190   (0x0008)  
	UStaticMeshComponent*                              IndicatorMesh;                                              // 0x0198   (0x0008)  
	ATBP_Vfx_GroundSlam_Marker_C*                      Indicator_Actor;                                            // 0x01A0   (0x0008)  
	bool                                               Target_Is_Wall;                                             // 0x01A8   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x01A9   (0x0007)  MISSED
	ATBP_VFX_GroundSlam_Impact_C*                      Impact_VFX_Actor;                                           // 0x01B0   (0x0008)  
	FRotator                                           Calculated_Rotation;                                        // 0x01B8   (0x000C)  
	FVector                                            Calculated_Position;                                        // 0x01C4   (0x000C)  
	FVector                                            Base_Position;                                              // 0x01D0   (0x000C)  


	/// Functions
	// Function /Game/GameBlueprints/Powers/Brujah/Specializations/GroundSlam/TBP_EarthShock.TBP_EarthShock_C.Set Indicator Location & Rotation
	void Set Indicator Location & Rotation(FVector Location, FRotator Rotation);                                             // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Brujah/Specializations/GroundSlam/TBP_EarthShock.TBP_EarthShock_C.Set Indicator Visibility
	void Set Indicator Visibility(bool Has Valid Target Location);                                                           // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Brujah/Specializations/GroundSlam/TBP_EarthShock.TBP_EarthShock_C.Spawn Impact VFX Actor Check
	void Spawn Impact VFX Actor Check();                                                                                     // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Brujah/Specializations/GroundSlam/TBP_EarthShock.TBP_EarthShock_C.Set Variables
	void Set Variables(bool Target Is Wall, FRotator Calculated Rotation, FVector Calculated Position, FVector Base Position); // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Brujah/Specializations/GroundSlam/TBP_EarthShock.TBP_EarthShock_C.CalculateKnockbackForce
	FVector CalculateKnockbackForce(ATigerCharacter* InHitCharacter);                                                        // [0x197e4f0] Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/GameBlueprints/Powers/Brujah/Specializations/GroundSlam/TBP_EarthShock.TBP_EarthShock_C.EvaluateIsTargetLocationValid
	bool EvaluateIsTargetLocationValid(bool bIsWall, FHitResult& InHitSurface);                                              // [0x197e4f0] Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/GameBlueprints/Powers/Brujah/Specializations/GroundSlam/TBP_EarthShock.TBP_EarthShock_C.GetLeapTime
	float GetLeapTime(FVector& InLeapVector);                                                                                // [0x197e4f0] Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/GameBlueprints/Powers/Brujah/Specializations/GroundSlam/TBP_EarthShock.TBP_EarthShock_C.CalculateDecalLocationAndRotation
	void CalculateDecalLocationAndRotation(FVector TargetLocation, FVector SurfaceNormal, FRotator& Rotation, FVector& DecalOffset); // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/GameBlueprints/Powers/Brujah/Specializations/GroundSlam/TBP_EarthShock.TBP_EarthShock_C.OnLanded
	void OnLanded(FVector InLocation, FVector InSurfaceNormal, bool bInTargetIsWall);                                        // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Brujah/Specializations/GroundSlam/TBP_EarthShock.TBP_EarthShock_C.OnRemoveTargetIndicator
	void OnRemoveTargetIndicator();                                                                                          // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Brujah/Specializations/GroundSlam/TBP_EarthShock.TBP_EarthShock_C.OnSpawnTargetIndicator
	void OnSpawnTargetIndicator();                                                                                           // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Brujah/Specializations/GroundSlam/TBP_EarthShock.TBP_EarthShock_C.OnTargetIndicatorUpdated
	void OnTargetIndicatorUpdated(bool bInHasTargetLocation, FVector InTargetLocation, FVector InSurfaceNormal, bool bInTargetIsWall); // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Brujah/Specializations/GroundSlam/TBP_EarthShock.TBP_EarthShock_C.OnEnemyCharacterHit
	void OnEnemyCharacterHit(ATigerCharacter* InHitCharacter);                                                               // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Brujah/Specializations/GroundSlam/TBP_EarthShock.TBP_EarthShock_C.ExecuteUbergraph_TBP_EarthShock
	void ExecuteUbergraph_TBP_EarthShock(int32_t EntryPoint);                                                                // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/GameBlueprints/Camera/PresetBlueprints/Disciplines/TBP_CamConf_Groundslam.TBP_CamConf_Groundslam_C
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UTBP_CamConf_Groundslam_C : public UTigerCameraPreset
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/CameraShakes/TBP_CamShake_MeleeAttack_Heavy.TBP_CamShake_MeleeAttack_Heavy_2_C
/// Size: 0x0000 (0x000180 - 0x000180)
class UTBP_CamShake_MeleeAttack_Heavy_2_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/GameBlueprints/Camera/CameraShakes/TBP_CamShake_Groundslam_Air.TBP_CamShake_Groundslam_Air_C
/// Size: 0x0000 (0x000180 - 0x000180)
class UTBP_CamShake_Groundslam_Air_C : public UMatineeCameraShake
{ 
public:
};

/// Class /Game/GameBlueprints/Powers/Brujah/Specializations/ShockwavePunch/TBP_ShockwavePunch.TBP_ShockwavePunch_C
/// Size: 0x0000 (0x000120 - 0x000120)
class UTBP_ShockwavePunch_C : public UTigerDisciplineShockwavePunch
{ 
public:
};

/// Class /Game/GameBlueprints/Disciplines/WorldRepresentation/TBP_ShockwaveWall.TBP_ShockwaveWall_C
/// Size: 0x0050 (0x0002C0 - 0x000310)
class ATBP_ShockwaveWall_C : public ATigerShockwaveWall
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	UParticleSystemComponent*                          PS_Vfx_ShockwavePunch;                                      // 0x02C8   (0x0008)  
	float                                              KnockbackPitchOffsetInDegrees;                              // 0x02D0   (0x0004)  
	float                                              KnockbackForce;                                             // 0x02D4   (0x0004)  
	bool                                               bShouldDrawHitboxes;                                        // 0x02D8   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x02D9   (0x0003)  MISSED
	int32_t                                            ShockwaveWallAkEventID;                                     // 0x02DC   (0x0004)  
	ATBP_ShockwaveWallTrail_C*                         TrailActor;                                                 // 0x02E0   (0x0008)  
	float                                              ShockTrailParticleRate;                                     // 0x02E8   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x02EC   (0x0004)  MISSED
	UCurveFloat*                                       KnockbackCurve;                                             // 0x02F0   (0x0008)  
	float                                              ForceOnDynamicObjects;                                      // 0x02F8   (0x0004)  
	float                                              DistancePercentTravelled;                                   // 0x02FC   (0x0004)  
	UCurveFloat*                                       DamageCurve;                                                // 0x0300   (0x0008)  
	float                                              Shockwave_Damage;                                           // 0x0308   (0x0004)  
	int32_t                                            CachedDamageBlockedProgress;                                // 0x030C   (0x0004)  


	/// Functions
	// Function /Game/GameBlueprints/Disciplines/WorldRepresentation/TBP_ShockwaveWall.TBP_ShockwaveWall_C.StrongBarrierTrait
	void StrongBarrierTrait(bool& isStrong);                                                                                 // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Disciplines/WorldRepresentation/TBP_ShockwaveWall.TBP_ShockwaveWall_C.DetermineDamageOnEnemy
	float DetermineDamageOnEnemy(ATigerCharacter* InEnemyCharacter);                                                         // [0x197e4f0] Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
	// Function /Game/GameBlueprints/Disciplines/WorldRepresentation/TBP_ShockwaveWall.TBP_ShockwaveWall_C.SlowBarrierTrait
	void SlowBarrierTrait(ATigerCharacter* Actor);                                                                           // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Disciplines/WorldRepresentation/TBP_ShockwaveWall.TBP_ShockwaveWall_C.PlayBarrierImpactPlayerAudio
	void PlayBarrierImpactPlayerAudio();                                                                                     // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Disciplines/WorldRepresentation/TBP_ShockwaveWall.TBP_ShockwaveWall_C.PlayBarrierAudio
	void PlayBarrierAudio();                                                                                                 // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Disciplines/WorldRepresentation/TBP_ShockwaveWall.TBP_ShockwaveWall_C.StopBarrierAudio
	void StopBarrierAudio();                                                                                                 // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Disciplines/WorldRepresentation/TBP_ShockwaveWall.TBP_ShockwaveWall_C.StopBarrierAudioPlayImpactAudio
	void StopBarrierAudioPlayImpactAudio();                                                                                  // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Disciplines/WorldRepresentation/TBP_ShockwaveWall.TBP_ShockwaveWall_C.CalculateKnockbackVector
	FVector CalculateKnockbackVector(ATigerCharacter* InHitEnemyCharacter);                                                  // [0x197e4f0] Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Disciplines/WorldRepresentation/TBP_ShockwaveWall.TBP_ShockwaveWall_C.OnShockwaveWallDestroyed
	void OnShockwaveWallDestroyed(EShockwaveWallDestroyReason InDestroyReason);                                              // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Disciplines/WorldRepresentation/TBP_ShockwaveWall.TBP_ShockwaveWall_C.ReceiveTick
	void ReceiveTick(float DeltaSeconds);                                                                                    // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Disciplines/WorldRepresentation/TBP_ShockwaveWall.TBP_ShockwaveWall_C.OnCharacterHit
	void OnCharacterHit(ATigerCharacter* InCharacterHit);                                                                    // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Disciplines/WorldRepresentation/TBP_ShockwaveWall.TBP_ShockwaveWall_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Disciplines/WorldRepresentation/TBP_ShockwaveWall.TBP_ShockwaveWall_C.OnEffectBoxOverlap
	void OnEffectBoxOverlap(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Disciplines/WorldRepresentation/TBP_ShockwaveWall.TBP_ShockwaveWall_C.ReceiveEndPlay
	void ReceiveEndPlay(TEnumAsByte<EEndPlayReason> EndPlayReason);                                                          // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Disciplines/WorldRepresentation/TBP_ShockwaveWall.TBP_ShockwaveWall_C.ReceiveDestroyed
	void ReceiveDestroyed();                                                                                                 // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Disciplines/WorldRepresentation/TBP_ShockwaveWall.TBP_ShockwaveWall_C.ExecuteUbergraph_TBP_ShockwaveWall
	void ExecuteUbergraph_TBP_ShockwaveWall(int32_t EntryPoint);                                                             // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/GameBlueprints/Camera/PresetBlueprints/Other/TBP_CamConf_ShockwavePunch.TBP_CamConf_ShockwavePunch_C
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UTBP_CamConf_ShockwavePunch_C : public UTigerCameraPreset
{ 
public:
};

/// Class /Game/GameBlueprints/Powers/Epsilon/TBP_Discipline_EpsilonClan.TBP_Discipline_EpsilonClan_C
/// Size: 0x0028 (0x000098 - 0x0000C0)
class UTBP_Discipline_EpsilonClan_C : public UTigerDisciplineEpsilonClan
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0098   (0x0008)  
	UTBP_UI_EpsilonResourceMeter_C*                    ResourceUI;                                                 // 0x00A0   (0x0008)  
	UParticleSystemComponent*                          LevitateParticles;                                          // 0x00A8   (0x0008)  
	float                                              CurrentResource;                                            // 0x00B0   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x00B4   (0x0004)  MISSED
	UParticleSystemComponent*                          FadingLevitateParticles;                                    // 0x00B8   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/Powers/Epsilon/TBP_Discipline_EpsilonClan.TBP_Discipline_EpsilonClan_C.CreateResourceUI
	void CreateResourceUI();                                                                                                 // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Epsilon/TBP_Discipline_EpsilonClan.TBP_Discipline_EpsilonClan_C.UpdateAudio
	void UpdateAudio(float Value);                                                                                           // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Epsilon/TBP_Discipline_EpsilonClan.TBP_Discipline_EpsilonClan_C.OnLevitateStart
	void OnLevitateStart();                                                                                                  // [0x197e4f0] BlueprintCosmetic|Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Epsilon/TBP_Discipline_EpsilonClan.TBP_Discipline_EpsilonClan_C.OnLevitateEnd
	void OnLevitateEnd();                                                                                                    // [0x197e4f0] BlueprintCosmetic|Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Epsilon/TBP_Discipline_EpsilonClan.TBP_Discipline_EpsilonClan_C.OnResourceChanged
	void OnResourceChanged(float InNewValue, float InPreviousValue);                                                         // [0x197e4f0] BlueprintCosmetic|Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Epsilon/TBP_Discipline_EpsilonClan.TBP_Discipline_EpsilonClan_C.OnDisciplineCreated
	void OnDisciplineCreated();                                                                                              // [0x197e4f0] BlueprintCosmetic|Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Epsilon/TBP_Discipline_EpsilonClan.TBP_Discipline_EpsilonClan_C.OnLevitateFailed
	void OnLevitateFailed();                                                                                                 // [0x197e4f0] BlueprintCosmetic|Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Epsilon/TBP_Discipline_EpsilonClan.TBP_Discipline_EpsilonClan_C.ExecuteUbergraph_TBP_Discipline_EpsilonClan
	void ExecuteUbergraph_TBP_Discipline_EpsilonClan(int32_t EntryPoint);                                                    // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/GameBlueprints/Weapons/RangedWeapons/AoE_Blueprints/Epsilon_One_Execute.Epsilon_One_Execute_C
/// Size: 0x0008 (0x0004F8 - 0x000500)
class AEpsilon_One_Execute_C : public ATigerAreaEffect
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x04F8   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/AoE_Blueprints/Epsilon_One_Execute.Epsilon_One_Execute_C.OnTriggerClient
	void OnTriggerClient();                                                                                                  // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/AoE_Blueprints/Epsilon_One_Execute.Epsilon_One_Execute_C.OnVehicleHit
	void OnVehicleHit(AActor* InActor);                                                                                      // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/AoE_Blueprints/Epsilon_One_Execute.Epsilon_One_Execute_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Weapons/RangedWeapons/AoE_Blueprints/Epsilon_One_Execute.Epsilon_One_Execute_C.ExecuteUbergraph_Epsilon_One_Execute
	void ExecuteUbergraph_Epsilon_One_Execute(int32_t EntryPoint);                                                           // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/GameBlueprints/Powers/Epsilon/TBP_Discipline_EpsilonOne_Projectile.TBP_Discipline_EpsilonOne_Projectile_C
/// Size: 0x0018 (0x0002E0 - 0x0002F8)
class ATBP_Discipline_EpsilonOne_Projectile_C : public ATigerEpsilonOneProjectile
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02E0   (0x0008)  
	UParticleSystemComponent*                          PS_VFX_EpsilonArchetypePower__TrailTest;                    // 0x02E8   (0x0008)  
	UStaticMeshComponent*                              SM_VFX_EpsilonArchetypePower_BloodNeedleTest;               // 0x02F0   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/Powers/Epsilon/TBP_Discipline_EpsilonOne_Projectile.TBP_Discipline_EpsilonOne_Projectile_C.OnDamagedCharacter
	void OnDamagedCharacter(ATigerCharacter* InCharacter, FVector& InHitLocation, bool bInGotDowned, bool bInCasterWasHealed); // [0x197e4f0] BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Epsilon/TBP_Discipline_EpsilonOne_Projectile.TBP_Discipline_EpsilonOne_Projectile_C.OnHealedCharacter
	void OnHealedCharacter(ATigerCharacter* InCharacter, FVector& InHitLocation);                                            // [0x197e4f0] BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Epsilon/TBP_Discipline_EpsilonOne_Projectile.TBP_Discipline_EpsilonOne_Projectile_C.OnEnteredObject
	void OnEnteredObject(FVector& InLocation);                                                                               // [0x197e4f0] BlueprintCosmetic|Event|Protected|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Epsilon/TBP_Discipline_EpsilonOne_Projectile.TBP_Discipline_EpsilonOne_Projectile_C.OnExitedObject
	void OnExitedObject(FVector& InLocation);                                                                                // [0x197e4f0] BlueprintCosmetic|Event|Protected|HasOutParms|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Epsilon/TBP_Discipline_EpsilonOne_Projectile.TBP_Discipline_EpsilonOne_Projectile_C.ReceiveBeginPlay
	void ReceiveBeginPlay();                                                                                                 // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Epsilon/TBP_Discipline_EpsilonOne_Projectile.TBP_Discipline_EpsilonOne_Projectile_C.ExecuteUbergraph_TBP_Discipline_EpsilonOne_Projectile
	void ExecuteUbergraph_TBP_Discipline_EpsilonOne_Projectile(int32_t EntryPoint);                                          // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/GameBlueprints/Powers/Epsilon/TBP_Discipline_EpsilonOne.TBP_Discipline_EpsilonOne_C
/// Size: 0x0010 (0x000100 - 0x000110)
class UTBP_Discipline_EpsilonOne_C : public UTigerDisciplineEpsilonOne
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0100   (0x0008)  
	UParticleSystemComponent*                          WindupParticle;                                             // 0x0108   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/Powers/Epsilon/TBP_Discipline_EpsilonOne.TBP_Discipline_EpsilonOne_C.OnExecute
	void OnExecute();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Epsilon/TBP_Discipline_EpsilonOne.TBP_Discipline_EpsilonOne_C.OnStop
	void OnStop();                                                                                                           // [0x197e4f0] BlueprintCosmetic|Event|Protected|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Epsilon/TBP_Discipline_EpsilonOne.TBP_Discipline_EpsilonOne_C.ExecuteUbergraph_TBP_Discipline_EpsilonOne
	void ExecuteUbergraph_TBP_Discipline_EpsilonOne(int32_t EntryPoint);                                                     // [0x197e4f0] Final                
};

/// Class /Game/GameBlueprints/Camera/PresetBlueprints/Disciplines/TBP_CamConf_EpsilonOne.TBP_CamConf_EpsilonOne_C
/// Size: 0x0000 (0x0000A8 - 0x0000A8)
class UTBP_CamConf_EpsilonOne_C : public UTigerCameraPreset
{ 
public:
};

/// Class /Game/GameBlueprints/AimAssist/Powers/TBP_AimAssist_EpsilonOne.TBP_AimAssist_EpsilonOne_C
/// Size: 0x0000 (0x000240 - 0x000240)
class UTBP_AimAssist_EpsilonOne_C : public UTBP_AimAssist_Ranged_C
{ 
public:
};

/// Class /Game/GameBlueprints/Powers/Nosferatu/Specializations/ScoutingFamiliar/TBP_ScoutingFamiliarPassive.TBP_ScoutingFamiliarPassive_C
/// Size: 0x0019 (0x0000F0 - 0x000109)
class UTBP_ScoutingFamiliarPassive_C : public UTigerFamiliarScoutPassive
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x00F0   (0x0008)  
	ATigerFamiliarScout*                               Scout;                                                      // 0x00F8   (0x0008)  
	bool                                               Replicated_Passive_Activated;                               // 0x0100   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0101   (0x0003)  MISSED
	float                                              TimeStart;                                                  // 0x0104   (0x0004)  
	bool                                               bParticleVisibility;                                        // 0x0108   (0x0001)  


	/// Functions
	// Function /Game/GameBlueprints/Powers/Nosferatu/Specializations/ScoutingFamiliar/TBP_ScoutingFamiliarPassive.TBP_ScoutingFamiliarPassive_C.OnRep_Replicated Passive Activated
	void OnRep_Replicated Passive Activated();                                                                               // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Nosferatu/Specializations/ScoutingFamiliar/TBP_ScoutingFamiliarPassive.TBP_ScoutingFamiliarPassive_C.CreateOrbitingParticles
	UParticleSystemComponent* CreateOrbitingParticles();                                                                     // [0x197e4f0] Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Nosferatu/Specializations/ScoutingFamiliar/TBP_ScoutingFamiliarPassive.TBP_ScoutingFamiliarPassive_C.ScoutSpawned
	void ScoutSpawned(ATigerFamiliarScout* SpawnedScout);                                                                    // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Nosferatu/Specializations/ScoutingFamiliar/TBP_ScoutingFamiliarPassive.TBP_ScoutingFamiliarPassive_C.Scout Destroyed
	void Scout Destroyed(AActor* DestroyedActor);                                                                            // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Nosferatu/Specializations/ScoutingFamiliar/TBP_ScoutingFamiliarPassive.TBP_ScoutingFamiliarPassive_C.Begin Fade Out
	void Begin Fade Out();                                                                                                   // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Nosferatu/Specializations/ScoutingFamiliar/TBP_ScoutingFamiliarPassive.TBP_ScoutingFamiliarPassive_C.Begin Fade In
	void Begin Fade In();                                                                                                    // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Nosferatu/Specializations/ScoutingFamiliar/TBP_ScoutingFamiliarPassive.TBP_ScoutingFamiliarPassive_C.EvaluateVisibility
	void EvaluateVisibility();                                                                                               // [0x197e4f0] Event|Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Nosferatu/Specializations/ScoutingFamiliar/TBP_ScoutingFamiliarPassive.TBP_ScoutingFamiliarPassive_C.ExecuteUbergraph_TBP_ScoutingFamiliarPassive
	void ExecuteUbergraph_TBP_ScoutingFamiliarPassive(int32_t EntryPoint);                                                   // [0x197e4f0] Final                
};

/// Class /Game/GameBlueprints/Powers/Nosferatu/Specializations/ScoutingFamiliar/TBP_ScoutingFamiliar.TBP_ScoutingFamiliar_C
/// Size: 0x00A0 (0x0002B8 - 0x000358)
class ATBP_ScoutingFamiliar_C : public ATigerFamiliarScout
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02B8   (0x0008)  
	UParticleSystemComponent*                          BatProjectileUpgrade;                                       // 0x02C0   (0x0008)  
	UParticleSystemComponent*                          BatProjectile;                                              // 0x02C8   (0x0008)  
	TArray<ATigerCharacter*>                           RevealedCharacters;                                         // 0x02D0   (0x0010)  
	UAkAudioEvent*                                     AKEvent_StartScanning;                                      // 0x02E0   (0x0008)  
	UParticleSystemComponent*                          ScoutEchoLocationSphereEffect;                              // 0x02E8   (0x0008)  
	FVector                                            ForwardVector;                                              // 0x02F0   (0x000C)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x02FC   (0x0004)  MISSED
	UAkAudioEvent*                                     AKEvent_StopScanning;                                       // 0x0300   (0x0008)  
	UParticleSystemComponent*                          ScoutBatEffect;                                             // 0x0308   (0x0008)  
	UParticleSystemComponent*                          Projectile_Smoke_Trail;                                     // 0x0310   (0x0008)  
	int32_t                                            ScanEffectAkEventID;                                        // 0x0318   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x031C   (0x0004)  MISSED
	FSoftObjectPath                                    NiagaraParticlePath;                                        // 0x0320   (0x0018)  
	UNiagaraSystem*                                    CachedEffect;                                               // 0x0338   (0x0008)  
	UNiagaraComponent*                                 NiagaraBats;                                                // 0x0340   (0x0008)  
	UTBP_UI_Discipline_Scout_WorldMarker_C*            WorldMarkerWidget;                                          // 0x0348   (0x0008)  
	ATigerPlayer*                                      CachedPlayer;                                               // 0x0350   (0x0008)  


	/// Functions
	// Function /Game/GameBlueprints/Powers/Nosferatu/Specializations/ScoutingFamiliar/TBP_ScoutingFamiliar.TBP_ScoutingFamiliar_C.CreateInWorldWidget
	void CreateInWorldWidget(APawn* OwningPawn);                                                                             // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Nosferatu/Specializations/ScoutingFamiliar/TBP_ScoutingFamiliar.TBP_ScoutingFamiliar_C.Ravaging Bats Trait
	void Ravaging Bats Trait(AActor* DamagedActor, AActor* DamageCauser, ATigerPlayer* Player);                              // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Nosferatu/Specializations/ScoutingFamiliar/TBP_ScoutingFamiliar.TBP_ScoutingFamiliar_C.StartScanAudio
	void StartScanAudio();                                                                                                   // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Nosferatu/Specializations/ScoutingFamiliar/TBP_ScoutingFamiliar.TBP_ScoutingFamiliar_C.ColorCodeEffect
	void ColorCodeEffect(UParticleSystemComponent* ParticleComponentToColor, bool bShouldOverrideDefaultColor, FLinearColor StandardColorOverride, FLinearColor EnemyColorOverride, bool bShouldOverrideEnemyCoor); // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Nosferatu/Specializations/ScoutingFamiliar/TBP_ScoutingFamiliar.TBP_ScoutingFamiliar_C.SpawnEmitterColorCoded
	void SpawnEmitterColorCoded(UParticleSystem* InParticleAssetToSpawn, FTransform InRelativeTransform, FName InAttachPointName, USceneComponent* InComponentAttachedTo, bool bInShouldSpawnForEnemy, bool bInShouldSpawnForAlly, UParticleSystemComponent*& SpawnedParticle); // [0x197e4f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Nosferatu/Specializations/ScoutingFamiliar/TBP_ScoutingFamiliar.TBP_ScoutingFamiliar_C.Deactivate Projectile Effects
	void Deactivate Projectile Effects();                                                                                    // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Nosferatu/Specializations/ScoutingFamiliar/TBP_ScoutingFamiliar.TBP_ScoutingFamiliar_C.Activate Projectile Effects
	void Activate Projectile Effects();                                                                                      // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Nosferatu/Specializations/ScoutingFamiliar/TBP_ScoutingFamiliar.TBP_ScoutingFamiliar_C.Spawn Projectile Trail
	void Spawn Projectile Trail();                                                                                           // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Nosferatu/Specializations/ScoutingFamiliar/TBP_ScoutingFamiliar.TBP_ScoutingFamiliar_C.Despawn Projectile Trail
	void Despawn Projectile Trail();                                                                                         // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Nosferatu/Specializations/ScoutingFamiliar/TBP_ScoutingFamiliar.TBP_ScoutingFamiliar_C.Try Hide World Marker Detection
	void Try Hide World Marker Detection();                                                                                  // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/GameBlueprints/Powers/Nosferatu/Specializations/ScoutingFamiliar/TBP_ScoutingFamiliar.TBP_ScoutingFamiliar_C.Try Show World Marker Detection
	void Try Show World Marker Detection();                                                                                  // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
