/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

/// Package OnlineServicesSettingsProvider.

/// Class /Script/OnlineServicesSettingsProvider.ShOnlineServicesSettings
/// Size: 0x01B0 (0x000038 - 0x0001E8)
class UShOnlineServicesSettings : public UDeveloperSettings
{ 
public:
	unsigned char                                      UnknownData00_2[0x18];                                      // 0x0038   (0x0018)  MISSED
	FString                                            AccountRecoveryUrlProd;                                     // 0x0050   (0x0010)  
	FString                                            AccountRecoveryUrlUat;                                      // 0x0060   (0x0010)  
	FString                                            AccountRecoveryUrlDev;                                      // 0x0070   (0x0010)  
	FString                                            CdnBaseUrlDev;                                              // 0x0080   (0x0010)  
	FString                                            CdnBaseUrlUat;                                              // 0x0090   (0x0010)  
	FString                                            CdnBaseUrlProd;                                             // 0x00A0   (0x0010)  
	FString                                            BaseUrlLocal;                                               // 0x00B0   (0x0010)  
	FString                                            BaseUrlDev;                                                 // 0x00C0   (0x0010)  
	FString                                            BaseUrlMain;                                                // 0x00D0   (0x0010)  
	FString                                            BaseUrlStaging;                                             // 0x00E0   (0x0010)  
	FString                                            BaseUrlRelease;                                             // 0x00F0   (0x0010)  
	FString                                            BaseUrlPs5Submission;                                       // 0x0100   (0x0010)  
	FString                                            BaseUrlLive;                                                // 0x0110   (0x0010)  
	FString                                            PushBaseUrlLocal;                                           // 0x0120   (0x0010)  
	FString                                            PushBaseUrlDev;                                             // 0x0130   (0x0010)  
	FString                                            PushBaseUrlMain;                                            // 0x0140   (0x0010)  
	FString                                            PushBaseUrlStaging;                                         // 0x0150   (0x0010)  
	FString                                            PushBaseUrlRelease;                                         // 0x0160   (0x0010)  
	FString                                            PushBaseUrlPs5Submission;                                   // 0x0170   (0x0010)  
	FString                                            PushBaseUrlLive;                                            // 0x0180   (0x0010)  
	FString                                            OnlineEnvironment;                                          // 0x0190   (0x0010)  
	unsigned char                                      UnknownData01_6[0x48];                                      // 0x01A0   (0x0048)  MISSED
};

