/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

/// Package Tiger.

/// Class /Script/Tiger.ChooseNextWaypoint
/// Size: 0x0078 (0x000070 - 0x0000E8)
class UChooseNextWaypoint : public UBTTaskNode
{ 
public:
	FBlackboardKeySelector                             Index;                                                      // 0x0070   (0x0028)  
	FBlackboardKeySelector                             Waypoint;                                                   // 0x0098   (0x0028)  
	FBlackboardKeySelector                             bWaypointDirectionIsForward;                                // 0x00C0   (0x0028)  
};

/// Class /Script/Tiger.TigerBuff
/// Size: 0x0240 (0x000028 - 0x000268)
class UTigerBuff : public UObject
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0028   (0x0008)  MISSED
	FTigerCharacterStatModification                    StatModification;                                           // 0x0030   (0x00A8)  
	FTigerStatusEffect                                 StatusEffect;                                               // 0x00D8   (0x000E)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x00E6   (0x0002)  MISSED
	float                                              Duration;                                                   // 0x00E8   (0x0004)  
	bool                                               bDoesTick;                                                  // 0x00EC   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x00ED   (0x0003)  MISSED
	float                                              TimeBetweenTicks;                                           // 0x00F0   (0x0004)  
	unsigned char                                      UnknownData03_5[0x4];                                       // 0x00F4   (0x0004)  MISSED
	FTigerNiagaraAttachment                            ActivatedNiagaraAttachment;                                 // 0x00F8   (0x0048)  
	FTigerNiagaraAttachment                            NiagaraAttachment;                                          // 0x0140   (0x0048)  
	TArray<FTigerNiagaraAttachment>                    AdditionalNiagaraAttachments;                               // 0x0188   (0x0010)  
	FTigerNiagaraAttachment                            DeactivatedNiagaraAttachment;                               // 0x0198   (0x0048)  
	bool                                               bOnlySpawnBuffParticleOnLocalPlayer;                        // 0x01E0   (0x0001)  
	bool                                               bShowParticlesOnHiddenEnemies;                              // 0x01E1   (0x0001)  
	bool                                               bAttachToMesh;                                              // 0x01E2   (0x0001)  
	unsigned char                                      UnknownData04_5[0x1];                                       // 0x01E3   (0x0001)  MISSED
	FName                                              AttachPoint;                                                // 0x01E4   (0x0008)  
	bool                                               bBuffParticleTypeAbsoluteRotation;                          // 0x01EC   (0x0001)  
	unsigned char                                      UnknownData05_5[0x3];                                       // 0x01ED   (0x0003)  MISSED
	UParticleSystem*                                   BuffParticleType;                                           // 0x01F0   (0x0008)  
	bool                                               bSpawnActivatedParticleOnRefresh;                           // 0x01F8   (0x0001)  
	bool                                               bOnlySpawnActivatedParticleOnLocalPlayer;                   // 0x01F9   (0x0001)  
	bool                                               bAttachActivatedParticle;                                   // 0x01FA   (0x0001)  
	bool                                               bActivatedParticleTypeAbsoluteRotation;                     // 0x01FB   (0x0001)  
	unsigned char                                      UnknownData06_5[0x4];                                       // 0x01FC   (0x0004)  MISSED
	UParticleSystem*                                   ActivatedParticleType;                                      // 0x0200   (0x0008)  
	bool                                               bOnlySpawnDeactivatedParticleOnLocalPlayer;                 // 0x0208   (0x0001)  
	bool                                               bAttachDeactivatedParticle;                                 // 0x0209   (0x0001)  
	bool                                               bDeactivatedParticleTypeAbsoluteRotation;                   // 0x020A   (0x0001)  
	unsigned char                                      UnknownData07_5[0x5];                                       // 0x020B   (0x0005)  MISSED
	UParticleSystem*                                   DeactivatedParticleType;                                    // 0x0210   (0x0008)  
	FName                                              ActivationMontageName;                                      // 0x0218   (0x0008)  
	UAkAudioEvent*                                     ActivatedSFX;                                               // 0x0220   (0x0008)  
	UAkAudioEvent*                                     DeactivatedSFX;                                             // 0x0228   (0x0008)  
	bool                                               bAllowClientSideBuffs;                                      // 0x0230   (0x0001)  
	bool                                               bStacks;                                                    // 0x0231   (0x0001)  
	bool                                               bOnlyStackWithDifferentCasters;                             // 0x0232   (0x0001)  
	unsigned char                                      UnknownData08_5[0x1];                                       // 0x0233   (0x0001)  MISSED
	int32_t                                            MaxStacks;                                                  // 0x0234   (0x0004)  
	bool                                               bKeepAfterDeath;                                            // 0x0238   (0x0001)  
	unsigned char                                      UnknownData09_5[0x3];                                       // 0x0239   (0x0003)  MISSED
	int32_t                                            RemoveBuffOnActions;                                        // 0x023C   (0x0004)  
	bool                                               bShowOnUI;                                                  // 0x0240   (0x0001)  
	unsigned char                                      UnknownData10_5[0x7];                                       // 0x0241   (0x0007)  MISSED
	UTexture2D*                                        StatusImage;                                                // 0x0248   (0x0008)  
	ETigerBuffStatusType                               StatusType;                                                 // 0x0250   (0x0001)  
	ETigerBuffProgressType                             ProgressType;                                               // 0x0251   (0x0001)  
	unsigned char                                      UnknownData11_5[0x6];                                       // 0x0252   (0x0006)  MISSED
	UClass*                                            PostProcessEffect;                                          // 0x0258   (0x0008)  
	uint64_t                                           PersistentTelemetryID;                                      // 0x0260   (0x0008)  


	/// Functions
	// Function /Script/Tiger.TigerBuff.OnRefreshed
	void OnRefreshed(ATigerCharacter* InBuffOwner, ATigerCharacter* InBuffCaster);                                           // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Script/Tiger.TigerBuff.OnDeactivated
	void OnDeactivated(ATigerCharacter* InBuffOwner, ATigerCharacter* InBuffCaster);                                         // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Script/Tiger.TigerBuff.OnActivated
	void OnActivated(ATigerCharacter* InBuffOwner, ATigerCharacter* InBuffCaster);                                           // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Script/Tiger.TigerBuff.FindBuffInstance
	UTigerBuffInstance* FindBuffInstance(ATigerCharacter* InBuffOwner, ATigerCharacter* InBuffCaster);                       // [0x1495f40] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/Tiger.TigerBuffStun
/// Size: 0x0000 (0x000268 - 0x000268)
class UTigerBuffStun : public UTigerBuff
{ 
public:
};

/// Class /Script/Tiger.TigerBuffBlockAILogic
/// Size: 0x0000 (0x000268 - 0x000268)
class UTigerBuffBlockAILogic : public UTigerBuff
{ 
public:
};

/// Class /Script/Tiger.TigerBuffImmobilize
/// Size: 0x0000 (0x000268 - 0x000268)
class UTigerBuffImmobilize : public UTigerBuff
{ 
public:
};

/// Class /Script/Tiger.TigerBuffGround
/// Size: 0x0000 (0x000268 - 0x000268)
class UTigerBuffGround : public UTigerBuff
{ 
public:
};

/// Class /Script/Tiger.TigerBuffInvulnerable
/// Size: 0x0000 (0x000268 - 0x000268)
class UTigerBuffInvulnerable : public UTigerBuff
{ 
public:
};

/// Class /Script/Tiger.TigerBuffInvisible
/// Size: 0x0000 (0x000268 - 0x000268)
class UTigerBuffInvisible : public UTigerBuff
{ 
public:
};

/// Class /Script/Tiger.TigerBuffDisableClimbing
/// Size: 0x0000 (0x000268 - 0x000268)
class UTigerBuffDisableClimbing : public UTigerBuff
{ 
public:
};

/// Class /Script/Tiger.TigerBuffBlockOffensiveActions
/// Size: 0x0000 (0x000268 - 0x000268)
class UTigerBuffBlockOffensiveActions : public UTigerBuff
{ 
public:
};

/// Class /Script/Tiger.TigerKeyTextureMapping
/// Size: 0x0050 (0x000030 - 0x000080)
class UTigerKeyTextureMapping : public UDataAsset
{ 
public:
	TMap<FKey, UTexture2D*>                            KeyTextures;                                                // 0x0030   (0x0050)  
};

/// Class /Script/Tiger.PatrolComponent
/// Size: 0x0000 (0x0000B0 - 0x0000B0)
class UPatrolComponent : public UActorComponent
{ 
public:
};

/// Class /Script/Tiger.TigerActivatedAudioComponent
/// Size: 0x0030 (0x0000B0 - 0x0000E0)
class UTigerActivatedAudioComponent : public UActorComponent
{ 
public:
	bool                                               bApplyOcclusion;                                            // 0x00B0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x00B1   (0x0007)  MISSED
	UAkAudioEvent*                                     AkEventToPost;                                              // 0x00B8   (0x0008)  
	UAkAudioEvent*                                     AkStopEventToPost;                                          // 0x00C0   (0x0008)  
	bool                                               bDrawActivationDebug;                                       // 0x00C8   (0x0001)  
	unsigned char                                      UnknownData01_6[0x17];                                      // 0x00C9   (0x0017)  MISSED
};

/// Class /Script/Tiger.TigerRebuildableActor
/// Size: 0x0018 (0x000228 - 0x000240)
class ATigerRebuildableActor : public AActor
{ 
public:
	USceneComponent*                                   Root;                                                       // 0x0228   (0x0008)  
	TArray<USceneComponent*>                           BuildCreatedComponents;                                     // 0x0230   (0x0010)  


	/// Functions
	// Function /Script/Tiger.TigerRebuildableActor.OnRebuild
	void OnRebuild();                                                                                                        // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Script/Tiger.TigerRebuildableActor.ConvertToBuildComponent
	USceneComponent* ConvertToBuildComponent(USceneComponent* BlueprintCreatedComponent);                                    // [0x15cccd0] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/Tiger.TigerActivatedObject
/// Size: 0x0040 (0x000240 - 0x000280)
class ATigerActivatedObject : public ATigerRebuildableActor
{ 
public:
	UStaticMeshComponent*                              BaseMesh;                                                   // 0x0240   (0x0008)  
	UAkAudioEvent*                                     ActivationAudioEvent;                                       // 0x0248   (0x0008)  
	bool                                               bActivationAudioShouldPlay;                                 // 0x0250   (0x0001)  
	bool                                               bTriggerOnlyOnPlayers;                                      // 0x0251   (0x0001)  
	bool                                               bUseAudioActivationRadius;                                  // 0x0252   (0x0001)  
	unsigned char                                      UnknownData00_5[0x1];                                       // 0x0253   (0x0001)  MISSED
	float                                              ActivationRadius;                                           // 0x0254   (0x0004)  
	float                                              AudioFadeOutDuration;                                       // 0x0258   (0x0004)  
	bool                                               bAllowOnHitEvents;                                          // 0x025C   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x025D   (0x0003)  MISSED
	TWeakObjectPtr<UPrimitiveComponent*>               WeakCharacterTrigger;                                       // 0x0260   (0x0008)  
	unsigned char                                      UnknownData02_6[0x18];                                      // 0x0268   (0x0018)  MISSED


	/// Functions
	// Function /Script/Tiger.TigerActivatedObject.SetCharacterTriggerComponent
	void SetCharacterTriggerComponent(UPrimitiveComponent* TriggerComponent);                                                // [0x1475180] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerActivatedObject.OnObjectDeactivated
	void OnObjectDeactivated();                                                                                              // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Script/Tiger.TigerActivatedObject.OnObjectActivated
	void OnObjectActivated();                                                                                                // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Script/Tiger.TigerActivatedObject.OnEndCharacterOverlap
	void OnEndCharacterOverlap(ATigerCharacter* OverlappingCharacter, int32_t TotalOverlapCount);                            // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Script/Tiger.TigerActivatedObject.OnCharacterHit
	void OnCharacterHit(ATigerCharacter* InOverlappingCharacter, FVector InNormalImpulse, FHitResult& InHitResult);          // [0x197e4f0] Event|Public|HasOutParms|HasDefaults|BlueprintEvent 
	// Function /Script/Tiger.TigerActivatedObject.OnBeginCharacterOverlap
	void OnBeginCharacterOverlap(ATigerCharacter* OverlappingCharacter, int32_t TotalOverlapCount);                          // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Script/Tiger.TigerActivatedObject.EndCharacterOverlap
	void EndCharacterOverlap(UPrimitiveComponent* InOverlappedComponent, AActor* InOtherActor, UPrimitiveComponent* InOtherComp, int32_t InOtherBodyIndex); // [0x1474b80] Final|Native|Private 
	// Function /Script/Tiger.TigerActivatedObject.CharacterHit
	void CharacterHit(UPrimitiveComponent* InHitComponent, AActor* InOtherActor, UPrimitiveComponent* InOtherComp, FVector InNormalImpulse, FHitResult& InHit); // [0x1474810] Final|Native|Private|HasOutParms|HasDefaults 
	// Function /Script/Tiger.TigerActivatedObject.BeginCharacterOverlap
	void BeginCharacterOverlap(UPrimitiveComponent* InOverlappedComponent, AActor* InOtherActor, UPrimitiveComponent* InOtherComp, int32_t InOtherBodyIndex, bool bInFromSweep, FHitResult& InSweepResult); // [0x14745e0] Final|Native|Private|HasOutParms 
};

/// Class /Script/Tiger.TigerActivatedObjectSubsystem
/// Size: 0x0090 (0x000030 - 0x0000C0)
class UTigerActivatedObjectSubsystem : public UGameInstanceSubsystem
{ 
public:
	unsigned char                                      UnknownData00_1[0x90];                                      // 0x0030   (0x0090)  MISSED
};

/// Class /Script/Tiger.TigerCameraBehavior
/// Size: 0x00C0 (0x000028 - 0x0000E8)
class UTigerCameraBehavior : public UObject
{ 
public:
	UTigerCameraPreset*                                CameraPreset;                                               // 0x0028   (0x0008)  
	unsigned char                                      UnknownData00_6[0xB8];                                      // 0x0030   (0x00B8)  MISSED
};

/// Class /Script/Tiger.TigerActiveCameraBehavior
/// Size: 0x0040 (0x0000E8 - 0x000128)
class UTigerActiveCameraBehavior : public UTigerCameraBehavior
{ 
public:
	unsigned char                                      UnknownData00_1[0x40];                                      // 0x00E8   (0x0040)  MISSED
};

/// Class /Script/Tiger.TigerActorGrid
/// Size: 0x00A8 (0x000228 - 0x0002D0)
class ATigerActorGrid : public AActor
{ 
public:
	unsigned char                                      UnknownData00_1[0xA8];                                      // 0x0228   (0x00A8)  MISSED
};

/// Class /Script/Tiger.TigerActorGridSettings
/// Size: 0x0058 (0x000038 - 0x000090)
class UTigerActorGridSettings : public UDeveloperSettings
{ 
public:
	TMap<ETigerActorGridCategory, FTigerActorGridSettingsData> GridsToInstantiate;                                 // 0x0038   (0x0050)  
	float                                              DebugDrawTime;                                              // 0x0088   (0x0004)  
	float                                              GridZOffset;                                                // 0x008C   (0x0004)  
};

/// Class /Script/Tiger.TigerActorGridSubsystem
/// Size: 0x0018 (0x000030 - 0x000048)
class UTigerActorGridSubsystem : public UWorldSubsystem
{ 
public:
	unsigned char                                      UnknownData00_1[0x18];                                      // 0x0030   (0x0018)  MISSED
};

/// Class /Script/Tiger.TigerActorGridVolume
/// Size: 0x0058 (0x000228 - 0x000280)
class ATigerActorGridVolume : public AActor
{ 
public:
	TMap<ETigerActorGridCategory, ATigerActorGrid*>    ActorGrids;                                                 // 0x0228   (0x0050)  
	UBoxComponent*                                     BoundingBox;                                                // 0x0278   (0x0008)  


	/// Functions
	// Function /Script/Tiger.TigerActorGridVolume.DebugStopDrawActorGrid
	void DebugStopDrawActorGrid(ETigerActorGridCategory InCategory);                                                         // [0x1474b00] Final|Exec|Native|Protected 
	// Function /Script/Tiger.TigerActorGridVolume.DebugDrawActorGrid
	void DebugDrawActorGrid(ETigerActorGridCategory InCategory, float InExtentX, float InExtentY);                           // [0x14749f0] Final|Exec|Native|Protected 
};

/// Class /Script/Tiger.TigerAdditiveCameraBehavior
/// Size: 0x0040 (0x0000E8 - 0x000128)
class UTigerAdditiveCameraBehavior : public UTigerCameraBehavior
{ 
public:
	unsigned char                                      UnknownData00_1[0x40];                                      // 0x00E8   (0x0040)  MISSED
};

/// Class /Script/Tiger.TigerAIAwayFromSuspiciousService
/// Size: 0x00D0 (0x000070 - 0x000140)
class UTigerAIAwayFromSuspiciousService : public UBTService
{ 
public:
	FBox                                               SearchFleeSpotBox;                                          // 0x0070   (0x001C)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x008C   (0x0004)  MISSED
	FBlackboardKeySelector                             FleePoint;                                                  // 0x0090   (0x0028)  
	FBlackboardKeySelector                             CurrentMasqueradeTarget;                                    // 0x00B8   (0x0028)  
	FBlackboardKeySelector                             WantsToReportPlayer;                                        // 0x00E0   (0x0028)  
	float                                              KeepFleeingFromSpecificPlayerRadiusSquared;                 // 0x0108   (0x0004)  
	float                                              BoxCenterDistanceFromNPCPosition;                           // 0x010C   (0x0004)  
	uint32_t                                           NumberOfTimesToRandomForAFleeSpot;                          // 0x0110   (0x0004)  
	bool                                               bShowDebugFeatures;                                         // 0x0114   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0115   (0x0003)  MISSED
	TWeakObjectPtr<ATigerPlayer*>                      PlayerFleeingFrom;                                          // 0x0118   (0x0008)  
	unsigned char                                      UnknownData02_6[0x20];                                      // 0x0120   (0x0020)  MISSED
};

/// Class /Script/Tiger.TigerAiBarkTask
/// Size: 0x0008 (0x000070 - 0x000078)
class UTigerAiBarkTask : public UBTTaskNode
{ 
public:
	FTigerNpcVoCategory                                BarkToPlay;                                                 // 0x0070   (0x0008)  
};

/// Class /Script/Tiger.TigerAiBaseController
/// Size: 0x0080 (0x000330 - 0x0003B0)
class ATigerAiBaseController : public AAIController
{ 
public:
	FVector                                            SpawnPoint;                                                 // 0x0330   (0x000C)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x033C   (0x0004)  MISSED
	UTigerSightConfigAsset*                            SightConfigAsset;                                           // 0x0340   (0x0008)  
	unsigned char                                      UnknownData01_6[0x68];                                      // 0x0348   (0x0068)  MISSED


	/// Functions
	// Function /Script/Tiger.TigerAiBaseController.UnregisterMovementTicket
	void UnregisterMovementTicket();                                                                                         // [0x1475210] Final|Native|Protected|BlueprintCallable 
	// Function /Script/Tiger.TigerAiBaseController.PlayAnimationUnreliable
	float PlayAnimationUnreliable(UAnimMontage* Animation);                                                                  // [0x14750e0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerAiBaseController.PlayAnimationFromNameUnreliable
	float PlayAnimationFromNameUnreliable(FName Animation);                                                                  // [0x1475040] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerAiBaseController.HasPathToLocation
	bool HasPathToLocation(FVector& Location);                                                                               // [0x1474fa0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerAiBaseController.GetSightProperties
	bool GetSightProperties(ETigerNPCType NPCType, FTigerSightConfigProperties& OutSightProps);                              // [0x1474e80] Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerAiBaseController.GetSightConfig
	UAISenseConfig_Sight* GetSightConfig();                                                                                  // [0x1474e50] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerAiBaseController.GetBaseNpcPawn
	ATigerBaseNPC* GetBaseNpcPawn();                                                                                         // [0x1474e20] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerAiBaseController.FindPointOnAiNavMeshWithinExtent
	bool FindPointOnAiNavMeshWithinExtent(FVector& Origin, FVector& Extent, FVector& OutLocation);                           // [0x1474ce0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/Tiger.TigerAIBenchmarkDiablerizeTask
/// Size: 0x0010 (0x000098 - 0x0000A8)
class UTigerAIBenchmarkDiablerizeTask : public UBTTask_BlackboardBase
{ 
public:
	float                                              MaximumDiablerizeDistance;                                  // 0x0098   (0x0004)  
	unsigned char                                      UnknownData00_6[0xC];                                       // 0x009C   (0x000C)  MISSED
};

/// Class /Script/Tiger.TigerAiBenchmarkDisciplineTask
/// Size: 0x0040 (0x000098 - 0x0000D8)
class UTigerAiBenchmarkDisciplineTask : public UBTTask_BlackboardBase
{ 
public:
	ATigerLocalAIControllerBase*                       AIControllerBase;                                           // 0x0098   (0x0008)  
	ATigerPlayerController*                            TigerPlayerController;                                      // 0x00A0   (0x0008)  
	ATigerCharacter*                                   AiTigerCharacter;                                           // 0x00A8   (0x0008)  
	ATigerPlayer*                                      TigerPlayer;                                                // 0x00B0   (0x0008)  
	UTigerDisciplineComponent*                         DisciplineComponent;                                        // 0x00B8   (0x0008)  
	UTigerDisciplineBase*                              CurrentDisciplineBase;                                      // 0x00C0   (0x0008)  
	unsigned char                                      UnknownData00_6[0x10];                                      // 0x00C8   (0x0010)  MISSED
};

/// Class /Script/Tiger.TigerAIBenchmarkFindPlayerTask
/// Size: 0x0020 (0x000098 - 0x0000B8)
class UTigerAIBenchmarkFindPlayerTask : public UBTTask_BlackboardBase
{ 
public:
	bool                                               bUseHeightenedSensesSearchRadius;                           // 0x0098   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0099   (0x0003)  MISSED
	float                                              CustomSearchSphereRadius;                                   // 0x009C   (0x0004)  
	bool                                               bDrawSearchSphere;                                          // 0x00A0   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x00A1   (0x0003)  MISSED
	float                                              MaxVerticalPositionOffset;                                  // 0x00A4   (0x0004)  
	float                                              RaycastDistance;                                            // 0x00A8   (0x0004)  
	int32_t                                            SearchLowLevelThreshold;                                    // 0x00AC   (0x0004)  
	float                                              SearchLowHealthPercentageThreshold;                         // 0x00B0   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x00B4   (0x0004)  MISSED
};

/// Class /Script/Tiger.TigerAiCalculateFiringLocationsScoreService
/// Size: 0x0030 (0x000070 - 0x0000A0)
class UTigerAiCalculateFiringLocationsScoreService : public UBTService
{ 
public:
	FBlackboardKeySelector                             TargetKey;                                                  // 0x0070   (0x0028)  
	bool                                               bDebugDrawLocations;                                        // 0x0098   (0x0001)  
	bool                                               bDebugDrawSweepChecks;                                      // 0x0099   (0x0001)  
	bool                                               bDebugDrawInvalidLocationReason;                            // 0x009A   (0x0001)  
	unsigned char                                      UnknownData00_6[0x5];                                       // 0x009B   (0x0005)  MISSED
};

/// Class /Script/Tiger.TigerAiCanCrouch
/// Size: 0x0008 (0x000068 - 0x000070)
class UTigerAiCanCrouch : public UBTDecorator
{ 
public:
	float                                              MinCrouchDistanceBuffer;                                    // 0x0068   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x006C   (0x0004)  MISSED
};

/// Class /Script/Tiger.TigerAiCanFleeDecorator
/// Size: 0x0000 (0x000068 - 0x000068)
class UTigerAiCanFleeDecorator : public UBTDecorator
{ 
public:
};

/// Class /Script/Tiger.TigerAICanInvestigateDecorator
/// Size: 0x0028 (0x000068 - 0x000090)
class UTigerAICanInvestigateDecorator : public UBTDecorator
{ 
public:
	FBlackboardKeySelector                             CurrentSuspiciousTarget;                                    // 0x0068   (0x0028)  
};

/// Class /Script/Tiger.TigerAiCanUseWeaponPowerDecorator
/// Size: 0x0008 (0x000068 - 0x000070)
class UTigerAiCanUseWeaponPowerDecorator : public UBTDecorator
{ 
public:
	bool                                               bConditionInvertedOnTick;                                   // 0x0068   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0069   (0x0007)  MISSED
};

/// Class /Script/Tiger.TigerAICAPBase
/// Size: 0x0030 (0x000228 - 0x000258)
class ATigerAICAPBase : public AActor
{ 
public:
	TArray<ATigerNPC*>                                 NPCUsingCAP;                                                // 0x0228   (0x0010)  
	TArray<UShapeComponent*>                           Colliders;                                                  // 0x0238   (0x0010)  
	float                                              Cooldown;                                                   // 0x0248   (0x0004)  
	int32_t                                            NumberOfSlots;                                              // 0x024C   (0x0004)  
	bool                                               bShouldAdjustTransform;                                     // 0x0250   (0x0001)  
	bool                                               bAllowExternalProps;                                        // 0x0251   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x0252   (0x0006)  MISSED


	/// Functions
	// Function /Script/Tiger.TigerAICAPBase.OnCheckNPCEligibility
	bool OnCheckNPCEligibility(ATigerNPC* NPC);                                                                              // [0x197e4f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Script/Tiger.TigerAICAPBase.CapIsEmpty
	bool CapIsEmpty();                                                                                                       // [0x1478720] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerAICAPBase.BeginOverlappedActor
	void BeginOverlappedActor(UPrimitiveComponent* OverlappedComponent, AActor* OtherActor, UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, FHitResult& SweepResult); // [0x1478410] Native|Public|HasOutParms 
};

/// Class /Script/Tiger.TigerAICAP
/// Size: 0x0010 (0x000258 - 0x000268)
class ATigerAICAP : public ATigerAICAPBase
{ 
public:
	TArray<UTigerAICommandBase*>                       Commands;                                                   // 0x0258   (0x0010)  
};

/// Class /Script/Tiger.TigerAiCheckCanDiablerize
/// Size: 0x0008 (0x000068 - 0x000070)
class UTigerAiCheckCanDiablerize : public UBTDecorator
{ 
public:
	bool                                               bConditionInvertedOnTick;                                   // 0x0068   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0069   (0x0007)  MISSED
};

/// Class /Script/Tiger.TigerAiCheckIsTargetDowned
/// Size: 0x0008 (0x000068 - 0x000070)
class UTigerAiCheckIsTargetDowned : public UBTDecorator
{ 
public:
	bool                                               bConditionInvertedOnTick;                                   // 0x0068   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0069   (0x0007)  MISSED
};

/// Class /Script/Tiger.TigerAIClearMasqueradeTargetTask
/// Size: 0x0000 (0x000070 - 0x000070)
class UTigerAIClearMasqueradeTargetTask : public UBTTaskNode
{ 
public:
};

/// Class /Script/Tiger.TigerAICommandBase
/// Size: 0x0018 (0x000028 - 0x000040)
class UTigerAICommandBase : public UObject
{ 
public:
	ATigerAIController*                                Owner;                                                      // 0x0028   (0x0008)  
	AActor*                                            WorldReferenceActor;                                        // 0x0030   (0x0008)  
	float                                              FailSafeMaxTime;                                            // 0x0038   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x003C   (0x0004)  MISSED


	/// Functions
	// Function /Script/Tiger.TigerAICommandBase.DeactivateCommand
	void DeactivateCommand(bool bHasFinished);                                                                               // [0x14787e0] Native|Public|BlueprintCallable 
};

/// Class /Script/Tiger.TigerAICommandAbandonCAP
/// Size: 0x0008 (0x000040 - 0x000048)
class UTigerAICommandAbandonCAP : public UTigerAICommandBase
{ 
public:
	float                                              ChanceToAbandonCAP;                                         // 0x0040   (0x0004)  
	bool                                               bShouldFindSpline;                                          // 0x0044   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0045   (0x0003)  MISSED
};

/// Class /Script/Tiger.TigerAICommandComponent
/// Size: 0x0090 (0x0000B0 - 0x000140)
class UTigerAICommandComponent : public UActorComponent
{ 
public:
	unsigned char                                      UnknownData00_2[0x40];                                      // 0x00B0   (0x0040)  MISSED
	ATigerAiPermanentCap*                              PermanentCap;                                               // 0x00F0   (0x0008)  
	ATigerNPC*                                         Owner;                                                      // 0x00F8   (0x0008)  
	UTigerAICommandBase*                               ActiveCommand;                                              // 0x0100   (0x0008)  
	UAnimMontage*                                      LastPlayedCapMontage;                                       // 0x0108   (0x0008)  
	FTigerCommandQueue                                 CommandQueue;                                               // 0x0110   (0x0010)  
	FName                                              ContextBaseIdle;                                            // 0x0120   (0x0008)  
	unsigned char                                      UnknownData01_6[0x18];                                      // 0x0128   (0x0018)  MISSED


	/// Functions
	// Function /Script/Tiger.TigerAICommandComponent.SetContextIdle
	void SetContextIdle(FName ContextName);                                                                                  // [0x1478a50] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerAICommandComponent.InterruptAndClearCommands
	void InterruptAndClearCommands();                                                                                        // [0x1478950] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerAICommandComponent.AddCommand
	UTigerAICommandBase* AddCommand(UTigerAICommandBase* Command, ATigerAICAPBase* CommandGiver);                            // [0x14782c0] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/Tiger.TigerAICommandContextualAction
/// Size: 0x0040 (0x000040 - 0x000080)
class UTigerAICommandContextualAction : public UTigerAICommandBase
{ 
public:
	TArray<FTigerContextualAnimationWrapper>           ContextualAnimations;                                       // 0x0040   (0x0010)  
	float                                              WaitTimeBefore;                                             // 0x0050   (0x0004)  
	float                                              WaitTimeBeforeRandomDeviation;                              // 0x0054   (0x0004)  
	float                                              WaitTimeAfter;                                              // 0x0058   (0x0004)  
	float                                              WaitTimeAfterRandomDeviation;                               // 0x005C   (0x0004)  
	unsigned char                                      UnknownData00_6[0x20];                                      // 0x0060   (0x0020)  MISSED
};

/// Class /Script/Tiger.TigerAICommandMoveTo
/// Size: 0x0028 (0x000040 - 0x000068)
class UTigerAICommandMoveTo : public UTigerAICommandBase
{ 
public:
	FTigerAIMoveToLocationData                         MoveToData;                                                 // 0x0040   (0x0018)  
	unsigned char                                      UnknownData00_6[0x10];                                      // 0x0058   (0x0010)  MISSED
};

/// Class /Script/Tiger.TigerAICommandPlayerProximityWait
/// Size: 0x0008 (0x000040 - 0x000048)
class UTigerAICommandPlayerProximityWait : public UTigerAICommandBase
{ 
public:
	float                                              SquaredPlayerProximityRadiusRequired;                       // 0x0040   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0044   (0x0004)  MISSED
};

/// Class /Script/Tiger.TigerAICommandWaitForOrder
/// Size: 0x0008 (0x000040 - 0x000048)
class UTigerAICommandWaitForOrder : public UTigerAICommandBase
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0040   (0x0008)  MISSED
};

/// Class /Script/Tiger.TigerAIController
/// Size: 0x00E8 (0x0003B0 - 0x000498)
class ATigerAIController : public ATigerAiBaseController
{ 
public:
	FName                                              LureTargetKeyName;                                          // 0x03B0   (0x0008)  
	FName                                              CurrentMasqueradeTargetKeyName;                             // 0x03B8   (0x0008)  
	FName                                              TargetPositionKeyName;                                      // 0x03C0   (0x0008)  
	FName                                              MasqueradeBreachTargetKey;                                  // 0x03C8   (0x0008)  
	FName                                              BehaviorIsActiveKeyName;                                    // 0x03D0   (0x0008)  
	FName                                              SpawnPointKeyName;                                          // 0x03D8   (0x0008)  
	FName                                              ActiveCAPKeyName;                                           // 0x03E0   (0x0008)  
	UBehaviorTree*                                     LureBehaviorTree;                                           // 0x03E8   (0x0008)  
	UBehaviorTree*                                     BloodDrainedBehaviorTree;                                   // 0x03F0   (0x0008)  
	UBehaviorTree*                                     EmptyBehaviorTree;                                          // 0x03F8   (0x0008)  
	UTigerFearValueAsset*                              FearValueAsset;                                             // 0x0400   (0x0008)  
	float                                              OutOfCombatHealthRegenerationDelay;                         // 0x0408   (0x0004)  
	float                                              OutOfCombatHealthRegenerationTickInterval;                  // 0x040C   (0x0004)  
	float                                              OutOfCombatTickHealthPercentage;                            // 0x0410   (0x0004)  
	float                                              TimeWhenEnteredBloodDrainedState;                           // 0x0414   (0x0004)  
	float                                              CheckForPlayerWeaponsInterval;                              // 0x0418   (0x0004)  
	float                                              CheckForPlayerWeaponsDeviation;                             // 0x041C   (0x0004)  
	float                                              BaseThreatRadiusForEquippedRanged;                          // 0x0420   (0x0004)  
	float                                              BaseThreatRadiusForEquippedMelee;                           // 0x0424   (0x0004)  
	float                                              FearValue;                                                  // 0x0428   (0x0004)  
	float                                              MaxFearValue;                                               // 0x042C   (0x0004)  
	float                                              MinCrouchDistanceFromPlayer;                                // 0x0430   (0x0004)  
	float                                              ChanceToFleeWhenEnteringThreatenedState;                    // 0x0434   (0x0004)  
	unsigned char                                      UnknownData00_5[0x30];                                      // 0x0438   (0x0030)  MISSED
	UTigerNpcMovementRestrictionBoundsData*            MovementRestrictionBoundsData;                              // 0x0468   (0x0008)  
	UTigerNpcMovementRestrictionBoundsData*            TargetMovementRestrictionBoundsData;                        // 0x0470   (0x0008)  
	unsigned char                                      UnknownData01_6[0x20];                                      // 0x0478   (0x0020)  MISSED


	/// Functions
	// Function /Script/Tiger.TigerAIController.SetupData
	void SetupData(ETigerNPCType InNpcType);                                                                                 // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Script/Tiger.TigerAIController.SetNewReactionData
	void SetNewReactionData(FTigerNpcReactionEvent& ReactionEvent);                                                          // [0x1478d70] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Tiger.TigerAIController.SetLastReactionData
	FTigerNpcReactionEvent SetLastReactionData();                                                                            // [0x1478cc0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerAIController.SetFearValue
	void SetFearValue(float InFearValue);                                                                                    // [0x1478c40] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerAIController.SetCurrentMasqueradeTarget
	void SetCurrentMasqueradeTarget(UBlackboardComponent* BBComp, ATigerCharacter* InLookAtTarget);                          // [0x1478ae0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerAIController.RunDefaultBehavior
	void RunDefaultBehavior();                                                                                               // [0x1478a30] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerAIController.RequestInvestigationTicket
	void RequestInvestigationTicket(ATigerPlayer* TigerPlayer);                                                              // [0x14789a0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerAIController.IsReacting
	bool IsReacting();                                                                                                       // [0x1478970] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerAIController.GetTigerPawn
	ATigerNPC* GetTigerPawn();                                                                                               // [0x1478930] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerAIController.GetMaxFearValue
	float GetMaxFearValue();                                                                                                 // [0x1478910] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerAIController.GetFearValue
	float GetFearValue();                                                                                                    // [0x14788f0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerAIController.GetFearPercentage
	float GetFearPercentage();                                                                                               // [0x14788c0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerAIController.GetCurrentBehaviorState
	ETigerAIMasqueradeState GetCurrentBehaviorState();                                                                       // [0x14788a0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerAIController.GetActiveCAP
	ATigerAICAPBase* GetActiveCAP();                                                                                         // [0x1478870] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerAIController.ClearCurrentMasqueradeTarget
	void ClearCurrentMasqueradeTarget(UBlackboardComponent* BBComp);                                                         // [0x1478750] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerAIController.CancelLureBehavior
	void CancelLureBehavior();                                                                                               // [0x1478700] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerAIController.AdjustFearValue
	void AdjustFearValue(float Adjustment);                                                                                  // [0x1478390] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/Tiger.TigerAiMovementBudgetAsset
/// Size: 0x0050 (0x000030 - 0x000080)
class UTigerAiMovementBudgetAsset : public UDataAsset
{ 
public:
	TMap<FName, FTigerAiMovementBudget>                MovementBudgets;                                            // 0x0030   (0x0050)  
};

/// Class /Script/Tiger.TigerAICoordinator
/// Size: 0x0368 (0x0000B0 - 0x000418)
class UTigerAICoordinator : public UActorComponent
{ 
public:
	int32_t                                            AttackingNpcForPlayerLimit;                                 // 0x00B0   (0x0004)  
	float                                              SprintTimeUntilReport;                                      // 0x00B4   (0x0004)  
	float                                              ClimbTimeUntilReport;                                       // 0x00B8   (0x0004)  
	float                                              AirTimeUntilReport;                                         // 0x00BC   (0x0004)  
	float                                              SuspicionStateTime;                                         // 0x00C0   (0x0004)  
	float                                              ThreatStateTime;                                            // 0x00C4   (0x0004)  
	float                                              SuspiciousStateEscapeRadiusSquared;                         // 0x00C8   (0x0004)  
	float                                              ThreatenedStateEscapeRadiusSquared;                         // 0x00CC   (0x0004)  
	float                                              MakeNearbyNPCsSuspiciousRadius;                             // 0x00D0   (0x0004)  
	float                                              FearValueDecreasePerSecond;                                 // 0x00D4   (0x0004)  
	float                                              CrimeActionCooldownDistance;                                // 0x00D8   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x00DC   (0x0004)  MISSED
	float                                              CrimeActionMasqueradePointThreshold;                        // 0x00E0   (0x0004)  
	float                                              PatrollingHelicopterEventRadius;                            // 0x00E4   (0x0004)  
	float                                              PatrollingHelicopterLowestResponseHeight;                   // 0x00E8   (0x0004)  
	float                                              PatrollingHelicopterEventTimeOut;                           // 0x00EC   (0x0004)  
	float                                              PatrollingHelicopterTimeBetweenGunfireEventPositionUpdate;  // 0x00F0   (0x0004)  
	float                                              TimeInSmokeUntilRemoval;                                    // 0x00F4   (0x0004)  
	bool                                               bUseMovementTickets;                                        // 0x00F8   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x00F9   (0x0007)  MISSED
	UTigerAiMovementBudgetAsset*                       MovementBudgetAsset;                                        // 0x0100   (0x0008)  
	FTigerAiClaimFireWeaponTicketDurations             ClaimFireTicketDurations;                                   // 0x0108   (0x0020)  
	bool                                               bPatrollingHelicotpersAreActive;                            // 0x0128   (0x0001)  
	unsigned char                                      UnknownData02_5[0x97];                                      // 0x0129   (0x0097)  MISSED
	TArray<ATigerEntityPatrollingHelicopter*>          EntityPatrollingHelicopters;                                // 0x01C0   (0x0010)  
	unsigned char                                      UnknownData03_5[0x80];                                      // 0x01D0   (0x0080)  MISSED
	TArray<UTigerAiEntityPlatoon*>                     EntityPlatoons;                                             // 0x0250   (0x0010)  
	TArray<UTigerAiSquad*>                             Squads;                                                     // 0x0260   (0x0010)  
	unsigned char                                      UnknownData04_5[0xA0];                                      // 0x0270   (0x00A0)  MISSED
	ATigerPlayerGrid*                                  PlayerGrid;                                                 // 0x0310   (0x0008)  
	unsigned char                                      UnknownData05_5[0xC8];                                      // 0x0318   (0x00C8)  MISSED
	TArray<FTigerPlayerActionProcessData>              DelayedPlayerActionProcesses;                               // 0x03E0   (0x0010)  
	unsigned char                                      UnknownData06_6[0x28];                                      // 0x03F0   (0x0028)  MISSED


	/// Functions
	// Function /Script/Tiger.TigerAICoordinator.SetNPCSightModifier
	void SetNPCSightModifier(float Modifier);                                                                                // [0x1478cf0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerAICoordinator.SetEnableAICoordinator
	void SetEnableAICoordinator(bool bEnabled);                                                                              // [0x1478bb0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerAICoordinator.CacheFearValueThresholds
	void CacheFearValueThresholds(UTigerFearValueAsset* CivFearValueAsset, UTigerFearValueAsset* PolFearValueAsset);         // [0x1478630] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/Tiger.TigerAiDisciplineTaskBase
/// Size: 0x0030 (0x000098 - 0x0000C8)
class UTigerAiDisciplineTaskBase : public UBTTask_BlackboardBase
{ 
public:
	ATigerLocalAIController*                           LocalAIController;                                          // 0x0098   (0x0008)  
	ATigerCharacter*                                   AiTigerCharacter;                                           // 0x00A0   (0x0008)  
	UTigerDisciplineComponent*                         DisciplineComponent;                                        // 0x00A8   (0x0008)  
	UTigerDisciplineBase*                              CurrentDisciplineBase;                                      // 0x00B0   (0x0008)  
	unsigned char                                      UnknownData00_6[0x10];                                      // 0x00B8   (0x0010)  MISSED
};

/// Class /Script/Tiger.TigerAiEntityMovementModeService
/// Size: 0x0058 (0x000070 - 0x0000C8)
class UTigerAiEntityMovementModeService : public UBTService
{ 
public:
	FBlackboardKeySelector                             TargetLocationKey;                                          // 0x0070   (0x0028)  
	FBlackboardKeySelector                             bCanShootKey;                                               // 0x0098   (0x0028)  
	float                                              StartSprintDistanceBuffer;                                  // 0x00C0   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x00C4   (0x0004)  MISSED
};

/// Class /Script/Tiger.TigerAiEntityPlatoon
/// Size: 0x0030 (0x000028 - 0x000058)
class UTigerAiEntityPlatoon : public UObject
{ 
public:
	unsigned char                                      UnknownData00_1[0x30];                                      // 0x0028   (0x0030)  MISSED
};

/// Class /Script/Tiger.TigerAIEntityReactPlayersService
/// Size: 0x0030 (0x000070 - 0x0000A0)
class UTigerAIEntityReactPlayersService : public UBTService
{ 
public:
	FBlackboardKeySelector                             SuspiciousTarget;                                           // 0x0070   (0x0028)  
	float                                              ThresholdDistanceSquared;                                   // 0x0098   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x009C   (0x0004)  MISSED
};

/// Class /Script/Tiger.TigerAiFindFiringLocation
/// Size: 0x00A8 (0x000070 - 0x000118)
class UTigerAiFindFiringLocation : public UBTTaskNode
{ 
public:
	FBlackboardKeySelector                             TargetKey;                                                  // 0x0070   (0x0028)  
	FBlackboardKeySelector                             FiringLocationKey;                                          // 0x0098   (0x0028)  
	FBlackboardKeySelector                             FiringLocationIndexKey;                                     // 0x00C0   (0x0028)  
	FBlackboardKeySelector                             bCanShootKey;                                               // 0x00E8   (0x0028)  
	float                                              ClaimedLocationDuration;                                    // 0x0110   (0x0004)  
	bool                                               bDebugDraw;                                                 // 0x0114   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0115   (0x0003)  MISSED
};

/// Class /Script/Tiger.TigerAIFireAtActorTask
/// Size: 0x0050 (0x000098 - 0x0000E8)
class UTigerAIFireAtActorTask : public UBTTask_BlackboardBase
{ 
public:
	FBlackboardKeySelector                             TargetToShootActorKey;                                      // 0x0098   (0x0028)  
	FBlackboardKeySelector                             CanShootKey;                                                // 0x00C0   (0x0028)  
};

/// Class /Script/Tiger.TigerAIFleeFromThreatService
/// Size: 0x00D0 (0x000070 - 0x000140)
class UTigerAIFleeFromThreatService : public UBTService
{ 
public:
	FBox                                               SearchFleeSpotBox;                                          // 0x0070   (0x001C)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x008C   (0x0004)  MISSED
	FBlackboardKeySelector                             FleePoint;                                                  // 0x0090   (0x0028)  
	FBlackboardKeySelector                             ClosestThreatPosition;                                      // 0x00B8   (0x0028)  
	FBlackboardKeySelector                             CurrentMasqueradeTarget;                                    // 0x00E0   (0x0028)  
	float                                              KeepFleeingFromSpecificPlayerRadiusSquared;                 // 0x0108   (0x0004)  
	float                                              BoxCenterDistanceFromNPCPosition;                           // 0x010C   (0x0004)  
	bool                                               bShowDebugFeatures;                                         // 0x0110   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0111   (0x0003)  MISSED
	TWeakObjectPtr<ATigerPlayer*>                      PlayerFleeingFrom;                                          // 0x0114   (0x0008)  
	unsigned char                                      UnknownData02_6[0x24];                                      // 0x011C   (0x0024)  MISSED
};

/// Class /Script/Tiger.TigerAIGetSuspectTargetService
/// Size: 0x0058 (0x000070 - 0x0000C8)
class UTigerAIGetSuspectTargetService : public UBTService
{ 
public:
	FBlackboardKeySelector                             SuspectPosition;                                            // 0x0070   (0x0028)  
	FBlackboardKeySelector                             CurrentSuspectTarget;                                       // 0x0098   (0x0028)  
	bool                                               bShowDebugFeatures;                                         // 0x00C0   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x00C1   (0x0007)  MISSED
};

/// Class /Script/Tiger.TigerAiGiveOrderToSquad
/// Size: 0x0008 (0x000070 - 0x000078)
class UTigerAiGiveOrderToSquad : public UBTTaskNode
{ 
public:
	ETigerNpcSquadOrder                                OrderToGive;                                                // 0x0070   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0071   (0x0007)  MISSED
};

/// Class /Script/Tiger.TigerAiSpawningCap
/// Size: 0x0038 (0x000258 - 0x000290)
class ATigerAiSpawningCap : public ATigerAICAPBase
{ 
public:
	USceneComponent*                                   SceneComp;                                                  // 0x0258   (0x0008)  
	UChildActorComponent*                              NPCSpawner;                                                 // 0x0260   (0x0008)  
	FName                                              SpawningGroup;                                              // 0x0268   (0x0008)  
	FName                                              SpawnedNpcMovementGroup;                                    // 0x0270   (0x0008)  
	FGuid                                              SpawningSubGroupId;                                         // 0x0278   (0x0010)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x0288   (0x0008)  MISSED
};

/// Class /Script/Tiger.TigerAIGroupCAP
/// Size: 0x0010 (0x000290 - 0x0002A0)
class ATigerAIGroupCAP : public ATigerAiSpawningCap
{ 
public:
	TArray<FTigerAiGroupCapSlot>                       CapSlots;                                                   // 0x0290   (0x0010)  


	/// Functions
	// Function /Script/Tiger.TigerAIGroupCAP.TriggerNextCommandForSlot
	bool TriggerNextCommandForSlot(ATigerNPC* NPC, int32_t CapSlotIndex);                                                    // [0x147c7e0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerAIGroupCAP.OnRequestNewCommands
	bool OnRequestNewCommands(ATigerNPC* NPC);                                                                               // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Script/Tiger.TigerAIGroupCAP.OnIsAvailableCheck
	bool OnIsAvailableCheck();                                                                                               // [0x147c670] Native|Event|Public|BlueprintEvent 
	// Function /Script/Tiger.TigerAIGroupCAP.IsSlotAvailable
	bool IsSlotAvailable(int32_t Index);                                                                                     // [0x147c5d0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerAIGroupCAP.GetSlotAssignedToNPC
	int32_t GetSlotAssignedToNPC(ATigerNPC* NPC);                                                                            // [0x147c530] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerAIGroupCAP.GetNextCommand
	UTigerAICommandBase* GetNextCommand(FTigerAiGroupCapSlot& CapSlot, int32_t CapSlotIndex);                                // [0x147c3e0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Tiger.TigerAIGroupCAP.CapCommandStarted
	void CapCommandStarted(int32_t CapSlotIndex, int32_t CommandIndex);                                                      // [0x147c310] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerAIGroupCAP.AssignNpcToSlot
	bool AssignNpcToSlot(int32_t SlotIndex, ATigerNPC* NPC);                                                                 // [0x147c240] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/Tiger.TigerAiHasCurrentSquadOrder
/// Size: 0x0008 (0x000068 - 0x000070)
class UTigerAiHasCurrentSquadOrder : public UBTDecorator
{ 
public:
	ETigerNpcSquadOrder                                SquadOrderToCompare;                                        // 0x0068   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0069   (0x0007)  MISSED
};

/// Class /Script/Tiger.TigerAiHasPlayerInSightDecorator
/// Size: 0x0000 (0x000068 - 0x000068)
class UTigerAiHasPlayerInSightDecorator : public UBTDecorator
{ 
public:
};

/// Class /Script/Tiger.TigerAiIsHeightElevationBlockingVision
/// Size: 0x0058 (0x000068 - 0x0000C0)
class UTigerAiIsHeightElevationBlockingVision : public UBTDecorator
{ 
public:
	FBlackboardKeySelector                             TargetLocationKey;                                          // 0x0068   (0x0028)  
	FBlackboardKeySelector                             bCanSeeTargetKey;                                           // 0x0090   (0x0028)  
	float                                              MaxVerticalAngleToTarget;                                   // 0x00B8   (0x0004)  
	float                                              LargeEnoughHeightDifference;                                // 0x00BC   (0x0004)  
};

/// Class /Script/Tiger.TigerAiIsInMovementRestrictionBoundsArea
/// Size: 0x0008 (0x000068 - 0x000070)
class UTigerAiIsInMovementRestrictionBoundsArea : public UBTDecorator
{ 
public:
	ETigerNpcMovementRestrictionBoundsArea             AreaToCompare;                                              // 0x0068   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0069   (0x0007)  MISSED
};

/// Class /Script/Tiger.TigerAiIsMovingOutOfBounds
/// Size: 0x0030 (0x000068 - 0x000098)
class UTigerAiIsMovingOutOfBounds : public UBTDecorator
{ 
public:
	FBlackboardKeySelector                             TargetPositionKey;                                          // 0x0068   (0x0028)  
	float                                              OutOfBoundsDistance;                                        // 0x0090   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0094   (0x0004)  MISSED
};

/// Class /Script/Tiger.TigerAIIsReactingDecorator
/// Size: 0x0000 (0x000068 - 0x000068)
class UTigerAIIsReactingDecorator : public UBTDecorator
{ 
public:
};

/// Class /Script/Tiger.TigerAiIsSquadCaptain
/// Size: 0x0000 (0x000068 - 0x000068)
class UTigerAiIsSquadCaptain : public UBTDecorator
{ 
public:
};

/// Class /Script/Tiger.TigerAiJudgeController
/// Size: 0x0040 (0x0003B0 - 0x0003F0)
class ATigerAiJudgeController : public ATigerAiBaseController
{ 
public:
	UTigerAiJudgeSmComponent*                          JudgeStateMachineComp;                                      // 0x03B0   (0x0008)  
	FTigerSightConfigProperties                        StandardSightProperties;                                    // 0x03B8   (0x001C)  
	FTigerSightConfigProperties                        CombatSightProperties;                                      // 0x03D4   (0x001C)  


	/// Functions
	// Function /Script/Tiger.TigerAiJudgeController.PlayTimedAnimationTriggers
	void PlayTimedAnimationTriggers(TArray<FTigerTimedAnimationTrigger>& AnimationTriggers);                                 // [0x147c6a0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Tiger.TigerAiJudgeController.GetJudgePawn
	ATigerJudge* GetJudgePawn();                                                                                             // [0x1478930] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/Tiger.TigerAiJudgeSmComponent
/// Size: 0x00C8 (0x0000B0 - 0x000178)
class UTigerAiJudgeSmComponent : public UActorComponent
{ 
public:
	TArray<ATigerPlayer*>                              CurrentlyPerceivedPlayersBySight;                           // 0x00B0   (0x0010)  
	TArray<ATigerPlayer*>                              BloodhuntedPlayersWithinCombatRadius;                       // 0x00C0   (0x0010)  
	UClass*                                            StartingState;                                              // 0x00D0   (0x0008)  
	UClass*                                            DownedState;                                                // 0x00D8   (0x0008)  
	UClass*                                            FeedingState;                                               // 0x00E0   (0x0008)  
	UTigerJudgeBaseState*                              ActiveState;                                                // 0x00E8   (0x0008)  
	TMap<UClass*, UTigerJudgeBaseState*>               InstancedStates;                                            // 0x00F0   (0x0050)  
	float                                              CombatRadiusSq;                                             // 0x0140   (0x0004)  
	bool                                               bIsSeeingAnyBloodhuntedPlayer;                              // 0x0144   (0x0001)  
	unsigned char                                      UnknownData00_6[0x33];                                      // 0x0145   (0x0033)  MISSED


	/// Functions
	// Function /Script/Tiger.TigerAiJudgeSmComponent.SwitchToState
	void SwitchToState(UClass* NewStateType);                                                                                // [0x147c750] Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerAiJudgeSmComponent.AddMasqueradePointsToSeenPlayers
	void AddMasqueradePointsToSeenPlayers(float AdjustAmount, float TimeBetweenAddingPoints);                                // [0x147c170] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/Tiger.TigerAimAssist
/// Size: 0x0108 (0x000028 - 0x000130)
class UTigerAimAssist : public UObject
{ 
public:
	ATigerPlayerController*                            PlayerController;                                           // 0x0028   (0x0008)  
	FTigerAimAssistState                               State;                                                      // 0x0030   (0x0098)  
	TMap<AActor*, FTigerAimAssistStatCollection>       StatsCollection;                                            // 0x00C8   (0x0050)  
	unsigned char                                      UnknownData00_6[0x18];                                      // 0x0118   (0x0018)  MISSED
};

/// Class /Script/Tiger.TigerAimAssistSettings
/// Size: 0x0218 (0x000028 - 0x000240)
class UTigerAimAssistSettings : public UObject
{ 
public:
	FTigerAimAssistModeConfig                          Modes;                                                      // 0x0028   (0x01A0)  
	FVector2D                                          BaseSlowdownAssistRadiusCm;                                 // 0x01C8   (0x0008)  
	FVector2D                                          BaseSlowdownAssistStrength;                                 // 0x01D0   (0x0008)  
	FVector2D                                          BaseRotationAssistRadiusCm;                                 // 0x01D8   (0x0008)  
	FVector2D                                          BaseRotationAssistStrength;                                 // 0x01E0   (0x0008)  
	float                                              MinRangeCm;                                                 // 0x01E8   (0x0004)  
	float                                              MaxRangeCm;                                                 // 0x01EC   (0x0004)  
	FVector2D                                          MaxRotationAssistDegreesPerSecond;                          // 0x01F0   (0x0008)  
	float                                              NoEffectScoreMultiplier;                                    // 0x01F8   (0x0004)  
	float                                              RotationAssistMinimumMoveSpeed;                             // 0x01FC   (0x0004)  
	float                                              TowardsHeadSlowdownMultiplier;                              // 0x0200   (0x0004)  
	float                                              AwayFromHeadSlowdownMultiplier;                             // 0x0204   (0x0004)  
	float                                              DamagedPreviouslyMultiplier;                                // 0x0208   (0x0004)  
	float                                              DamagedRecentlyMultiplier;                                  // 0x020C   (0x0004)  
	float                                              DamagedRecentlyTime;                                        // 0x0210   (0x0004)  
	float                                              MostDamagedPlayerMultiplier;                                // 0x0214   (0x0004)  
	float                                              TargetDownedModifier;                                       // 0x0218   (0x0004)  
	float                                              TargetIsPreviousTargetModifier;                             // 0x021C   (0x0004)  
	float                                              TargetActsAsPlayerModifier;                                 // 0x0220   (0x0004)  
	float                                              CloseToHeadMax;                                             // 0x0224   (0x0004)  
	bool                                               bShouldAssistWhenVisibleThroughWall;                        // 0x0228   (0x0001)  
	bool                                               ShouldUseWeaponRangeAsModifier;                             // 0x0229   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x022A   (0x0002)  MISSED
	float                                              AdsPreviouslyMultiplier;                                    // 0x022C   (0x0004)  
	float                                              AdsRecentlyMultiplier;                                      // 0x0230   (0x0004)  
	float                                              AdsRecentlyTime;                                            // 0x0234   (0x0004)  
	float                                              AdsDamageMultiplier;                                        // 0x0238   (0x0004)  
	float                                              AdsDamageTime;                                              // 0x023C   (0x0004)  
};

/// Class /Script/Tiger.TigerAimingCameraBehavior
/// Size: 0x0000 (0x000128 - 0x000128)
class UTigerAimingCameraBehavior : public UTigerActiveCameraBehavior
{ 
public:
};

/// Class /Script/Tiger.TigerAiMoveAsyncTask
/// Size: 0x0008 (0x000098 - 0x0000A0)
class UTigerAiMoveAsyncTask : public UBTTask_BlackboardBase
{ 
public:
	float                                              AcceptableRadiusSq;                                         // 0x0098   (0x0004)  
	float                                              ObservedBlackboardValueToleranceSq;                         // 0x009C   (0x0004)  
};

/// Class /Script/Tiger.TigerAiMoveToTask
/// Size: 0x0008 (0x0000B0 - 0x0000B8)
class UTigerAiMoveToTask : public UBTTask_MoveTo
{ 
public:
	bool                                               bResetMoveTargetOnEnd;                                      // 0x00B0   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x00B1   (0x0007)  MISSED
};

/// Class /Script/Tiger.TigerAiPathToTargetService
/// Size: 0x00E8 (0x000070 - 0x000158)
class UTigerAiPathToTargetService : public UBTService
{ 
public:
	FBlackboardKeySelector                             TargetLocationKey;                                          // 0x0070   (0x0028)  
	FBlackboardKeySelector                             SuitableEdgeLocationKey;                                    // 0x0098   (0x0028)  
	FBlackboardKeySelector                             IsTargetOutOfBoundsKey;                                     // 0x00C0   (0x0028)  
	FBlackboardKeySelector                             HasPathToTargetKey;                                         // 0x00E8   (0x0028)  
	FBlackboardKeySelector                             IsPathOutOfBoundsKey;                                       // 0x0110   (0x0028)  
	float                                              OutOfBoundsDistance;                                        // 0x0138   (0x0004)  
	float                                              HeightDifferenceOutOfBounds;                                // 0x013C   (0x0004)  
	bool                                               bDebugDraw;                                                 // 0x0140   (0x0001)  
	unsigned char                                      UnknownData00_6[0x17];                                      // 0x0141   (0x0017)  MISSED
};

/// Class /Script/Tiger.TigerAIPerceptionSystem
/// Size: 0x0000 (0x000130 - 0x000130)
class UTigerAIPerceptionSystem : public UAIPerceptionSystem
{ 
public:
};

/// Class /Script/Tiger.TigerAiPerfBenchUseWeapon
/// Size: 0x0020 (0x000070 - 0x000090)
class UTigerAiPerfBenchUseWeapon : public UBTTaskNode
{ 
public:
	unsigned char                                      UnknownData00_2[0x10];                                      // 0x0070   (0x0010)  MISSED
	ATigerLocalAIControllerBase*                       LocalAIController;                                          // 0x0080   (0x0008)  
	ATigerPlayerController*                            PlayerController;                                           // 0x0088   (0x0008)  
};

/// Class /Script/Tiger.TigerAiPermanentCap
/// Size: 0x0038 (0x000290 - 0x0002C8)
class ATigerAiPermanentCap : public ATigerAiSpawningCap
{ 
public:
	TArray<UTigerAICommandBase*>                       Commands;                                                   // 0x0290   (0x0010)  
	ETigerCivilianEmotionalState                       EmotionalState;                                             // 0x02A0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x02A1   (0x0003)  MISSED
	FName                                              CapContextBase;                                             // 0x02A4   (0x0008)  
	int32_t                                            CapContextStartingIndex;                                    // 0x02AC   (0x0004)  
	UTigerNPCAsset*                                    NpcAssetToSpawn;                                            // 0x02B0   (0x0008)  
	int32_t                                            LoopingStartIndex;                                          // 0x02B8   (0x0004)  
	TWeakObjectPtr<ATigerNPC*>                         PermanentNpc;                                               // 0x02BC   (0x0008)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x02C4   (0x0004)  MISSED
};

/// Class /Script/Tiger.TigerAIPetClearPathToMaster
/// Size: 0x0000 (0x000070 - 0x000070)
class UTigerAIPetClearPathToMaster : public UBTTaskNode
{ 
public:
};

/// Class /Script/Tiger.TigerAIPetComponent
/// Size: 0x0040 (0x0000B0 - 0x0000F0)
class UTigerAIPetComponent : public UActorComponent
{ 
public:
	unsigned char                                      UnknownData00_1[0x40];                                      // 0x00B0   (0x0040)  MISSED
};

/// Class /Script/Tiger.TigerAIPetFindEndOfMastersPath
/// Size: 0x0028 (0x000070 - 0x000098)
class UTigerAIPetFindEndOfMastersPath : public UBTTaskNode
{ 
public:
	FBlackboardKeySelector                             MasterPlayer;                                               // 0x0070   (0x0028)  
};

/// Class /Script/Tiger.TigerAIPetPreparePathContinuing
/// Size: 0x0028 (0x000070 - 0x000098)
class UTigerAIPetPreparePathContinuing : public UBTTaskNode
{ 
public:
	FBlackboardKeySelector                             MasterPlayer;                                               // 0x0070   (0x0028)  
};

/// Class /Script/Tiger.TigerAIPetStoreValidMasterPos
/// Size: 0x0028 (0x000070 - 0x000098)
class UTigerAIPetStoreValidMasterPos : public UBTTaskNode
{ 
public:
	FBlackboardKeySelector                             MasterPlayer;                                               // 0x0070   (0x0028)  
};

/// Class /Script/Tiger.TigerAIPlayAnimationTask
/// Size: 0x0058 (0x000070 - 0x0000C8)
class UTigerAIPlayAnimationTask : public UBTTaskNode
{ 
public:
	UAnimMontage*                                      AnimationToPlay;                                            // 0x0070   (0x0008)  
	FBlackboardKeySelector                             ContextualActionPointKey;                                   // 0x0078   (0x0028)  
	UBehaviorTreeComponent*                            MyOwnerComp;                                                // 0x00A0   (0x0008)  
	unsigned char                                      UnknownData00_6[0x20];                                      // 0x00A8   (0x0020)  MISSED
};

/// Class /Script/Tiger.TigerAiPlayerAtWpRangeDecorator
/// Size: 0x0008 (0x000068 - 0x000070)
class UTigerAiPlayerAtWpRangeDecorator : public UBTDecorator
{ 
public:
	bool                                               bConditionInvertedOnTick;                                   // 0x0068   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0069   (0x0007)  MISSED
};

/// Class /Script/Tiger.TigerAIPlayerClearPrioritiesTask
/// Size: 0x0000 (0x000098 - 0x000098)
class UTigerAIPlayerClearPrioritiesTask : public UBTTask_BlackboardBase
{ 
public:
};

/// Class /Script/Tiger.TigerAIPlayerClimbIfPossibleTask
/// Size: 0x0060 (0x000070 - 0x0000D0)
class UTigerAIPlayerClimbIfPossibleTask : public UBTTaskNode
{ 
public:
	ATigerLocalAIControllerBase*                       LocalAIController;                                          // 0x0070   (0x0008)  
	ATigerPlayerController*                            PlayerController;                                           // 0x0078   (0x0008)  
	ATigerPlayerCameraManager*                         PlayerCamera;                                               // 0x0080   (0x0008)  
	ATigerPlayer*                                      CurrentPawn;                                                // 0x0088   (0x0008)  
	UTigerCharacterMovementComponent*                  PlayerMovementComponent;                                    // 0x0090   (0x0008)  
	UTigerTraversalClimbState*                         ClimbState;                                                 // 0x0098   (0x0008)  
	UTigerTraversalStateClimbingConfig*                ClimbConfig;                                                // 0x00A0   (0x0008)  
	float                                              AngleFromForward;                                           // 0x00A8   (0x0004)  
	unsigned char                                      UnknownData00_6[0x24];                                      // 0x00AC   (0x0024)  MISSED
};

/// Class /Script/Tiger.TigerAiPlayerCombatService
/// Size: 0x0018 (0x000070 - 0x000088)
class UTigerAiPlayerCombatService : public UBTService
{ 
public:
	ATigerLocalAIController*                           LocalAIController;                                          // 0x0070   (0x0008)  
	AActor*                                            CurrentLureTarget;                                          // 0x0078   (0x0008)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x0080   (0x0008)  MISSED
};

/// Class /Script/Tiger.TigerAiPlayerDiablerizeTask
/// Size: 0x0028 (0x000098 - 0x0000C0)
class UTigerAiPlayerDiablerizeTask : public UBTTask_BlackboardBase
{ 
public:
	float                                              MaximumDiablerizeDistance;                                  // 0x0098   (0x0004)  
	unsigned char                                      UnknownData00_6[0x24];                                      // 0x009C   (0x0024)  MISSED
};

/// Class /Script/Tiger.TigerAiPlayerEquipRangedWeapon
/// Size: 0x0008 (0x000070 - 0x000078)
class UTigerAiPlayerEquipRangedWeapon : public UBTTaskNode
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0070   (0x0008)  MISSED
};

/// Class /Script/Tiger.TigerAIPlayerFeeding
/// Size: 0x0008 (0x000098 - 0x0000A0)
class UTigerAIPlayerFeeding : public UBTTask_BlackboardBase
{ 
public:
	float                                              MaximumFeedingDistance;                                     // 0x0098   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x009C   (0x0004)  MISSED
};

/// Class /Script/Tiger.TigerAIPlayerFindBloodHuntedTask
/// Size: 0x0000 (0x000070 - 0x000070)
class UTigerAIPlayerFindBloodHuntedTask : public UBTTaskNode
{ 
public:
};

/// Class /Script/Tiger.TigerAIPlayerFindCivilianTask
/// Size: 0x0020 (0x000098 - 0x0000B8)
class UTigerAIPlayerFindCivilianTask : public UBTTask_BlackboardBase
{ 
public:
	bool                                               bUseHeightenedSensesSearchRadius;                           // 0x0098   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0099   (0x0003)  MISSED
	float                                              CustomSearchSphereRadius;                                   // 0x009C   (0x0004)  
	bool                                               bDrawSearchSphere;                                          // 0x00A0   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x00A1   (0x0003)  MISSED
	float                                              MaxVerticalPositionOffset;                                  // 0x00A4   (0x0004)  
	float                                              RaycastDistance;                                            // 0x00A8   (0x0004)  
	int32_t                                            SearchLowResonanceThreshold;                                // 0x00AC   (0x0004)  
	float                                              SearchLowHealthPercentageThreshold;                         // 0x00B0   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x00B4   (0x0004)  MISSED
};

/// Class /Script/Tiger.TigerAIPlayerFindClosestItemTask
/// Size: 0x0040 (0x000098 - 0x0000D8)
class UTigerAIPlayerFindClosestItemTask : public UBTTask_BlackboardBase
{ 
public:
	float                                              MaxVerticalPositionOffset;                                  // 0x0098   (0x0004)  
	float                                              RaycastDistance;                                            // 0x009C   (0x0004)  
	float                                              SearchSphereRadius;                                         // 0x00A0   (0x0004)  
	float                                              LowAmmoThresholdWorldItems;                                 // 0x00A4   (0x0004)  
	float                                              LowAmmoThresholdLootTables;                                 // 0x00A8   (0x0004)  
	float                                              SignificantDropChanceThreshold;                             // 0x00AC   (0x0014)  
	unsigned char                                      UnknownData00_5[0x10];                                      // 0x00C0   (0x0010)  MISSED
	ATigerLocalAIController*                           LocalAIController;                                          // 0x00D0   (0x0008)  
};

/// Class /Script/Tiger.TigerAIPlayerFindNewPointTask
/// Size: 0x0020 (0x000098 - 0x0000B8)
class UTigerAIPlayerFindNewPointTask : public UBTTask_BlackboardBase
{ 
public:
	float                                              NavigablePointRadius;                                       // 0x0098   (0x0004)  
	float                                              MaxCenterDistance;                                          // 0x009C   (0x0004)  
	float                                              NextWaveSafetyDistance;                                     // 0x00A0   (0x0004)  
	unsigned char                                      UnknownData00_6[0x14];                                      // 0x00A4   (0x0014)  MISSED
};

/// Class /Script/Tiger.TigerAiPlayerMainStateService
/// Size: 0x0078 (0x000070 - 0x0000E8)
class UTigerAiPlayerMainStateService : public UBTService
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0070   (0x0008)  MISSED
	ATigerLocalAIController*                           LocalAIController;                                          // 0x0078   (0x0008)  
	ATigerPlayer*                                      AiPlayer;                                                   // 0x0080   (0x0008)  
	ATigerCharacter*                                   TargetCharacter;                                            // 0x0088   (0x0008)  
	UTigerInventoryComponent*                          LocalAiInventory;                                           // 0x0090   (0x0008)  
	ATigerCharacter*                                   ClosestHostileCharacterFleeingFrom;                         // 0x0098   (0x0008)  
	unsigned char                                      UnknownData01_5[0x30];                                      // 0x00A0   (0x0030)  MISSED
	float                                              FleeAttackDistance;                                         // 0x00D0   (0x0004)  
	unsigned char                                      UnknownData02_6[0x14];                                      // 0x00D4   (0x0014)  MISSED


	/// Functions
	// Function /Script/Tiger.TigerAiPlayerMainStateService.OnReactionDelayPassed
	void OnReactionDelayPassed(AActor* InActor);                                                                             // [0x14813a0] Final|Native|Private 
	// Function /Script/Tiger.TigerAiPlayerMainStateService.OnPerceptionUpdated
	void OnPerceptionUpdated(AActor* InActor, FAIStimulus InStimulus);                                                       // [0x1481210] Final|Native|Private 
	// Function /Script/Tiger.TigerAiPlayerMainStateService.OnDiablerizeStateChanged
	void OnDiablerizeStateChanged(bool InIsDiablerizeActive, bool InIsTarget);                                               // [0x14810c0] Final|Native|Private 
};

/// Class /Script/Tiger.TigerAIPlayerMoveToTask
/// Size: 0x00A0 (0x0000B0 - 0x000150)
class UTigerAIPlayerMoveToTask : public UBTTask_MoveTo
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x00B0   (0x0008)  MISSED
	UTigerAIPlayerClimbIfPossibleTask*                 ClimbTask;                                                  // 0x00B8   (0x0008)  
	UTigerAIPlayerSlideIfPossibleTask*                 SlideTask;                                                  // 0x00C0   (0x0008)  
	UTigerAIPlayerWallGrindTask*                       WallGrindTask;                                              // 0x00C8   (0x0008)  
	float                                              CheckStuckDelay;                                            // 0x00D0   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x00D4   (0x0004)  MISSED
	float                                              CheckClimbTaskTransitionsDelay;                             // 0x00D8   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x00DC   (0x0004)  MISSED
	float                                              CheckSlideTaskTransitionsDelay;                             // 0x00E0   (0x0004)  
	unsigned char                                      UnknownData03_5[0x4];                                       // 0x00E4   (0x0004)  MISSED
	float                                              JumpGapTransitionsDelay;                                    // 0x00E8   (0x0004)  
	unsigned char                                      UnknownData04_5[0x4];                                       // 0x00EC   (0x0004)  MISSED
	ATigerLocalAIController*                           LocalAIController;                                          // 0x00F0   (0x0008)  
	ATigerPlayer*                                      CurrentTigerPlayer;                                         // 0x00F8   (0x0008)  
	unsigned char                                      UnknownData05_6[0x50];                                      // 0x0100   (0x0050)  MISSED


	/// Functions
	// Function /Script/Tiger.TigerAIPlayerMoveToTask.OnLifeStatusChanged
	void OnLifeStatusChanged(ETigerPlayerLifeStatus InNewLifeStatus);                                                        // [0x1481190] Final|Native|Public  
};

/// Class /Script/Tiger.TigerAIPlayerOpenInteractiveTask
/// Size: 0x0030 (0x000098 - 0x0000C8)
class UTigerAIPlayerOpenInteractiveTask : public UBTTask_BlackboardBase
{ 
public:
	unsigned char                                      UnknownData00_1[0x30];                                      // 0x0098   (0x0030)  MISSED
};

/// Class /Script/Tiger.TigerAIPlayerPickPriorityTask
/// Size: 0x0008 (0x000098 - 0x0000A0)
class UTigerAIPlayerPickPriorityTask : public UBTTask_BlackboardBase
{ 
public:
	float                                              MaxVerticalPositionOffset;                                  // 0x0098   (0x0004)  
	float                                              RaycastDistance;                                            // 0x009C   (0x0004)  
};

/// Class /Script/Tiger.TigerAIPlayerPickUpItemTask
/// Size: 0x0008 (0x000098 - 0x0000A0)
class UTigerAIPlayerPickUpItemTask : public UBTTask_BlackboardBase
{ 
public:
	float                                              MaximumLootingDistance;                                     // 0x0098   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x009C   (0x0004)  MISSED
};

/// Class /Script/Tiger.TigerAIPlayerSlideIfPossibleTask
/// Size: 0x0030 (0x000070 - 0x0000A0)
class UTigerAIPlayerSlideIfPossibleTask : public UBTTaskNode
{ 
public:
	float                                              MinimumSlideDistanceSqrd;                                   // 0x0070   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0074   (0x0004)  MISSED
	ATigerLocalAIController*                           LocalAIController;                                          // 0x0078   (0x0008)  
	ATigerPlayerController*                            PlayerController;                                           // 0x0080   (0x0008)  
	ATigerPlayer*                                      CurrentPawn;                                                // 0x0088   (0x0008)  
	UTigerCharacterMovementComponent*                  PlayerMovementComponent;                                    // 0x0090   (0x0008)  
	UTigerTraversalSlideState*                         SlideState;                                                 // 0x0098   (0x0008)  
};

/// Class /Script/Tiger.TigerAIPlayerTravelBloodVeinTask
/// Size: 0x0010 (0x000098 - 0x0000A8)
class UTigerAIPlayerTravelBloodVeinTask : public UBTTask_BlackboardBase
{ 
public:
	UCurveFloat*                                       JumpProbabilityDistribution;                                // 0x0098   (0x0008)  
	ETigerJumpDistribution                             JumpDistributionType;                                       // 0x00A0   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x00A1   (0x0007)  MISSED
};

/// Class /Script/Tiger.TigerAIPlayerUseHealingItem
/// Size: 0x0080 (0x000070 - 0x0000F0)
class UTigerAIPlayerUseHealingItem : public UBTTaskNode
{ 
public:
	unsigned char                                      UnknownData00_2[0x10];                                      // 0x0070   (0x0010)  MISSED
	TArray<FTigerAIPlayerUseProtectiveItemData>        RedGasItems;                                                // 0x0080   (0x0010)  
	TArray<FTigerAIPlayerUseProtectiveItemData>        SlowUseHealthItems;                                         // 0x0090   (0x0010)  
	TArray<FTigerAIPlayerUseProtectiveItemData>        SlowUseShieldItems;                                         // 0x00A0   (0x0010)  
	TArray<FTigerAIPlayerUseProtectiveItemData>        FastUseHealthItems;                                         // 0x00B0   (0x0010)  
	TArray<FTigerAIPlayerUseProtectiveItemData>        FastUseShieldItems;                                         // 0x00C0   (0x0010)  
	unsigned char                                      UnknownData01_5[0x8];                                       // 0x00D0   (0x0008)  MISSED
	ATigerLocalAIControllerBase*                       LocalAiControllerBase;                                      // 0x00D8   (0x0008)  
	ATigerLocalAIController*                           LocalAIController;                                          // 0x00E0   (0x0008)  
	ATigerPlayerController*                            PlayerController;                                           // 0x00E8   (0x0008)  
};

/// Class /Script/Tiger.TigerAiPlayerUseWeapon
/// Size: 0x0020 (0x000070 - 0x000090)
class UTigerAiPlayerUseWeapon : public UBTTaskNode
{ 
public:
	unsigned char                                      UnknownData00_2[0x10];                                      // 0x0070   (0x0010)  MISSED
	ATigerLocalAIControllerBase*                       LocalAIController;                                          // 0x0080   (0x0008)  
	ATigerPlayerController*                            PlayerController;                                           // 0x0088   (0x0008)  
};

/// Class /Script/Tiger.TigerAiPlayerUseWeaponPower
/// Size: 0x0040 (0x000070 - 0x0000B0)
class UTigerAiPlayerUseWeaponPower : public UBTTaskNode
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0070   (0x0008)  MISSED
	ATigerLocalAIControllerBase*                       LocalAiControllerBase;                                      // 0x0078   (0x0008)  
	ATigerLocalAIController*                           LocalAIController;                                          // 0x0080   (0x0008)  
	ATigerPlayerController*                            PlayerController;                                           // 0x0088   (0x0008)  
	UTigerDisciplineBase*                              WeaponAbility;                                              // 0x0090   (0x0008)  
	ATigerPlayer*                                      PlayerPawn;                                                 // 0x0098   (0x0008)  
	UTigerDisciplineComponent*                         DisciplineComponent;                                        // 0x00A0   (0x0008)  
	float                                              ThrowingKnifeUseChance;                                     // 0x00A8   (0x0004)  
	float                                              DualBladesUseChance;                                        // 0x00AC   (0x0004)  
};

/// Class /Script/Tiger.TigerAIPlayerWallGrindTask
/// Size: 0x0030 (0x000070 - 0x0000A0)
class UTigerAIPlayerWallGrindTask : public UBTTaskNode
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0070   (0x0008)  MISSED
	ATigerLocalAIController*                           LocalAIController;                                          // 0x0078   (0x0008)  
	ATigerPlayerController*                            PlayerController;                                           // 0x0080   (0x0008)  
	ATigerPlayer*                                      CurrentPawn;                                                // 0x0088   (0x0008)  
	UTigerCharacterMovementComponent*                  PlayerMovementComponent;                                    // 0x0090   (0x0008)  
	UTigerTraversalWallGrindState*                     GrindState;                                                 // 0x0098   (0x0008)  
};

/// Class /Script/Tiger.TigerAIRedGasAvoidance
/// Size: 0x0008 (0x000068 - 0x000070)
class UTigerAIRedGasAvoidance : public UBTDecorator
{ 
public:
	bool                                               bCheckInRedGas;                                             // 0x0068   (0x0001)  
	bool                                               bCheckDesireMoveNextWave;                                   // 0x0069   (0x0001)  
	bool                                               bCheckInDangerOfWave;                                       // 0x006A   (0x0001)  
	unsigned char                                      UnknownData00_6[0x5];                                       // 0x006B   (0x0005)  MISSED
};

/// Class /Script/Tiger.TigerAiReloadWeaponTask
/// Size: 0x0010 (0x000070 - 0x000080)
class UTigerAiReloadWeaponTask : public UBTTaskNode
{ 
public:
	unsigned char                                      UnknownData00_1[0x10];                                      // 0x0070   (0x0010)  MISSED
};

/// Class /Script/Tiger.TigerAiReportNewThreatTask
/// Size: 0x0028 (0x000070 - 0x000098)
class UTigerAiReportNewThreatTask : public UBTTaskNode
{ 
public:
	FBlackboardKeySelector                             PlayerToReportKey;                                          // 0x0070   (0x0028)  
};

/// Class /Script/Tiger.TigerAIReportSuspciousPlayer
/// Size: 0x0078 (0x000070 - 0x0000E8)
class UTigerAIReportSuspciousPlayer : public UBTTaskNode
{ 
public:
	FBlackboardKeySelector                             PoliceTarget;                                               // 0x0070   (0x0028)  
	FBlackboardKeySelector                             CurrentMasqueradeTarget;                                    // 0x0098   (0x0028)  
	FBlackboardKeySelector                             PlayerNeedsToBeReported;                                    // 0x00C0   (0x0028)  
};

/// Class /Script/Tiger.TigerAiRequestOutOfBoundsPursuitSquad
/// Size: 0x0030 (0x000070 - 0x0000A0)
class UTigerAiRequestOutOfBoundsPursuitSquad : public UBTTaskNode
{ 
public:
	FBlackboardKeySelector                             TargetPlayer;                                               // 0x0070   (0x0028)  
	float                                              NearbySquadDistance;                                        // 0x0098   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x009C   (0x0004)  MISSED
};

/// Class /Script/Tiger.TigerAISense_Masquerade
/// Size: 0x0010 (0x000080 - 0x000090)
class UTigerAISense_Masquerade : public UAISense
{ 
public:
	TArray<FTigerAIMasqueradeEvent>                    MasqueradeEvents;                                           // 0x0080   (0x0010)  


	/// Functions
	// Function /Script/Tiger.TigerAISense_Masquerade.ReportPlayerAction
	void ReportPlayerAction(ATigerPlayer* Instigator, FTigerAIPlayerAction& PlayerAction);                                   // [0x14814c0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
};

/// Class /Script/Tiger.TigerAISenseConfig_Masquerade
/// Size: 0x0008 (0x000048 - 0x000050)
class UTigerAISenseConfig_Masquerade : public UAISenseConfig
{ 
public:
	UClass*                                            Implementation;                                             // 0x0048   (0x0008)  
};

/// Class /Script/Tiger.TigerAISense_Sight
/// Size: 0x0000 (0x000170 - 0x000170)
class UTigerAISense_Sight : public UAISense_Sight
{ 
public:
};

/// Class /Script/Tiger.TigerAISenseConfig_Sight
/// Size: 0x0030 (0x000048 - 0x000078)
class UTigerAISenseConfig_Sight : public UAISenseConfig
{ 
public:
	UClass*                                            Implementation;                                             // 0x0048   (0x0008)  
	float                                              SightRadius;                                                // 0x0050   (0x0004)  
	float                                              LoseSightRadius;                                            // 0x0054   (0x0004)  
	float                                              PeripheralVisionAngleDegrees;                               // 0x0058   (0x0004)  
	float                                              CloseSightRadius;                                           // 0x005C   (0x0004)  
	float                                              CloseLoseSightRadius;                                       // 0x0060   (0x0004)  
	float                                              ClosePeripheralVisionAngleDegrees;                          // 0x0064   (0x0004)  
	float                                              HeightDifference;                                           // 0x0068   (0x0004)  
	FAISenseAffiliationFilter                          DetectionByAffiliation;                                     // 0x006C   (0x0004)  
	float                                              AutoSuccessRangeFromLastSeenLocation;                       // 0x0070   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0074   (0x0004)  MISSED
};

/// Class /Script/Tiger.TigerSightConfigAsset
/// Size: 0x0050 (0x000030 - 0x000080)
class UTigerSightConfigAsset : public UDataAsset
{ 
public:
	TMap<ETigerNPCType, FTigerSightConfigData>         SightData;                                                  // 0x0030   (0x0050)  
};

/// Class /Script/Tiger.TigerAiSetCrouchedTask
/// Size: 0x0008 (0x000070 - 0x000078)
class UTigerAiSetCrouchedTask : public UBTTaskNode
{ 
public:
	bool                                               bShouldCrouch;                                              // 0x0070   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0071   (0x0007)  MISSED
};

/// Class /Script/Tiger.TigerAiSetMovementMode
/// Size: 0x0008 (0x000070 - 0x000078)
class UTigerAiSetMovementMode : public UBTTaskNode
{ 
public:
	ETigerAIAnimationMode                              MovementMode;                                               // 0x0070   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0071   (0x0007)  MISSED
};

/// Class /Script/Tiger.TigerAiShouldFireFleeDecorator
/// Size: 0x0008 (0x000090 - 0x000098)
class UTigerAiShouldFireFleeDecorator : public UBTDecorator_BlackboardBase
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0090   (0x0008)  MISSED
};

/// Class /Script/Tiger.TigerAiShouldReloadDecorator
/// Size: 0x0008 (0x000068 - 0x000070)
class UTigerAiShouldReloadDecorator : public UBTDecorator
{ 
public:
	bool                                               bBaseUponFullAmmoPercentage;                                // 0x0068   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0069   (0x0003)  MISSED
	float                                              ReloadAmmoPercentage;                                       // 0x006C   (0x0004)  
};

/// Class /Script/Tiger.TigerAiShouldReportNewThreatDecorator
/// Size: 0x0028 (0x000068 - 0x000090)
class UTigerAiShouldReportNewThreatDecorator : public UBTDecorator
{ 
public:
	FBlackboardKeySelector                             PlayerToReportKey;                                          // 0x0068   (0x0028)  
};

/// Class /Script/Tiger.TigerAiShouldRequestOutOfBoundsPursuitSquad
/// Size: 0x0030 (0x000068 - 0x000098)
class UTigerAiShouldRequestOutOfBoundsPursuitSquad : public UBTDecorator
{ 
public:
	FBlackboardKeySelector                             CurrentTargetKey;                                           // 0x0068   (0x0028)  
	float                                              MaxDistanceFromCurrentSquad;                                // 0x0090   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0094   (0x0004)  MISSED
};

/// Class /Script/Tiger.TigerAiShouldUseDisciplineBase
/// Size: 0x0030 (0x000068 - 0x000098)
class UTigerAiShouldUseDisciplineBase : public UBTDecorator
{ 
public:
	float                                              LowHealthPercentage;                                        // 0x0068   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x006C   (0x0004)  MISSED
	ATigerLocalAIController*                           LocalAIController;                                          // 0x0070   (0x0008)  
	ATigerPlayerController*                            LocalAiPlayerController;                                    // 0x0078   (0x0008)  
	ATigerPlayer*                                      AiTigerPlayer;                                              // 0x0080   (0x0008)  
	UTigerDisciplineComponent*                         DisciplineComponent;                                        // 0x0088   (0x0008)  
	ATigerCharacter*                                   AiTigerCharacter;                                           // 0x0090   (0x0008)  
};

/// Class /Script/Tiger.TigerAiShouldUseArchDiscipline
/// Size: 0x0028 (0x000098 - 0x0000C0)
class UTigerAiShouldUseArchDiscipline : public UTigerAiShouldUseDisciplineBase
{ 
public:
	float                                              ShockwavePunchMinimumTargetDistance;                        // 0x0098   (0x0004)  
	float                                              EarthshockUseWithoutJumpChance;                             // 0x009C   (0x0004)  
	float                                              TrapsAndScoutsUseNearLootDistance;                          // 0x00A0   (0x0004)  
	float                                              ScoutsRedeployChance;                                       // 0x00A4   (0x0004)  
	float                                              RejuvenatingVoiceLowHealthPercentage;                       // 0x00A8   (0x0004)  
	float                                              RejuvenatingVoiceUndamagedDurationRequirement;              // 0x00AC   (0x0004)  
	float                                              BlindingBeautyMaxUseRange;                                  // 0x00B0   (0x0004)  
	float                                              TankyChargeUseDistance;                                     // 0x00B4   (0x0004)  
	float                                              ScoutsDamageWindowThreshold;                                // 0x00B8   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x00BC   (0x0004)  MISSED
};

/// Class /Script/Tiger.TigerAiShouldUseClanDiscipline
/// Size: 0x0018 (0x000098 - 0x0000B0)
class UTigerAiShouldUseClanDiscipline : public UTigerAiShouldUseDisciplineBase
{ 
public:
	float                                              DisableNearTargetDistance;                                  // 0x0098   (0x0004)  
	float                                              SoaringLeapRayClearance;                                    // 0x009C   (0x0004)  
	float                                              VanishCombatUseChance;                                      // 0x00A0   (0x0004)  
	float                                              ProjectionDashUseDistance;                                  // 0x00A4   (0x0004)  
	float                                              FleshOfMarbleHealthThreshold;                               // 0x00A8   (0x0004)  
	float                                              FleshOfMarbleTimeThreshold;                                 // 0x00AC   (0x0004)  
};

/// Class /Script/Tiger.TigerAiShouldUseWeaponAbility
/// Size: 0x0018 (0x000098 - 0x0000B0)
class UTigerAiShouldUseWeaponAbility : public UTigerAiShouldUseDisciplineBase
{ 
public:
	float                                              ReflectDamageIntervalThreshold;                             // 0x0098   (0x0004)  
	float                                              ReflectDamageAmountThreshold;                               // 0x009C   (0x0004)  
	float                                              ThrowingKnifeMinimumRange;                                  // 0x00A0   (0x0004)  
	float                                              ThrowingKnifeMaximumRange;                                  // 0x00A4   (0x0004)  
	float                                              ThrowingKnifeDamageIntervalThreshold;                       // 0x00A8   (0x0004)  
	float                                              ThrowingKnifeDamageAmountThreshold;                         // 0x00AC   (0x0004)  
};

/// Class /Script/Tiger.TigerNPCSpawningBase
/// Size: 0x0048 (0x000228 - 0x000270)
class ATigerNPCSpawningBase : public AActor
{ 
public:
	ATigerAISplinePath*                                AISplinePath;                                               // 0x0228   (0x0008)  
	FName                                              SpawningGroup;                                              // 0x0230   (0x0008)  
	int32_t                                            SpawnAmount;                                                // 0x0238   (0x0004)  
	FGuid                                              SpawningSubGroupId;                                         // 0x023C   (0x0010)  
	float                                              Prio;                                                       // 0x024C   (0x0004)  
	bool                                               bShouldBeManuallyActivated;                                 // 0x0250   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0251   (0x0003)  MISSED
	FName                                              MovementGroup;                                              // 0x0254   (0x0008)  
	unsigned char                                      UnknownData01_6[0x14];                                      // 0x025C   (0x0014)  MISSED


	/// Functions
	// Function /Script/Tiger.TigerNPCSpawningBase.ManuallySpawnNPCs
	TArray<ATigerBaseNPC*> ManuallySpawnNPCs(int32_t Budget, int32_t OverrideSpawnAmount);                                   // [0x156b2e0] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/Tiger.TigerAISpawner
/// Size: 0x0008 (0x000270 - 0x000278)
class ATigerAISpawner : public ATigerNPCSpawningBase
{ 
public:
	UTigerNPCAsset*                                    NPCAsset;                                                   // 0x0270   (0x0008)  
};

/// Class /Script/Tiger.TigerAISplinePath
/// Size: 0x00A8 (0x000228 - 0x0002D0)
class ATigerAISplinePath : public AActor
{ 
public:
	FTigerAISplinePathData                             PathData;                                                   // 0x0228   (0x00A0)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x02C8   (0x0008)  MISSED
};

/// Class /Script/Tiger.TigerAiSplinePathHub
/// Size: 0x0018 (0x000228 - 0x000240)
class ATigerAiSplinePathHub : public AActor
{ 
public:
	TArray<FTigerAISplinePathConnection>               SplineConnections;                                          // 0x0228   (0x0010)  
	float                                              ConnectionRadius;                                           // 0x0238   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x023C   (0x0004)  MISSED
};

/// Class /Script/Tiger.TigerAiSquad
/// Size: 0x0040 (0x000028 - 0x000068)
class UTigerAiSquad : public UObject
{ 
public:
	unsigned char                                      UnknownData00_1[0x40];                                      // 0x0028   (0x0040)  MISSED
};

/// Class /Script/Tiger.TigerAiSquadFormationService
/// Size: 0x0040 (0x000070 - 0x0000B0)
class UTigerAiSquadFormationService : public UBTService
{ 
public:
	FBlackboardKeySelector                             FormationLocationKey;                                       // 0x0070   (0x0028)  
	bool                                               bDebugDraw;                                                 // 0x0098   (0x0001)  
	unsigned char                                      UnknownData00_6[0x17];                                      // 0x0099   (0x0017)  MISSED
};

/// Class /Script/Tiger.TigerAIsRespondingToRoar
/// Size: 0x0000 (0x000068 - 0x000068)
class UTigerAIsRespondingToRoar : public UBTDecorator
{ 
public:
};

/// Class /Script/Tiger.TigerAiStopActiveCapTask
/// Size: 0x0000 (0x000070 - 0x000070)
class UTigerAiStopActiveCapTask : public UBTTaskNode
{ 
public:
};

/// Class /Script/Tiger.TigerAiTargetOutOfBounds
/// Size: 0x0078 (0x000068 - 0x0000E0)
class UTigerAiTargetOutOfBounds : public UBTDecorator
{ 
public:
	FBlackboardKeySelector                             IsTargetOutOfBoundsKey;                                     // 0x0068   (0x0028)  
	FBlackboardKeySelector                             HasPathToTargetKey;                                         // 0x0090   (0x0028)  
	FBlackboardKeySelector                             IsPathOutOfBoundsKey;                                       // 0x00B8   (0x0028)  
};

/// Class /Script/Tiger.TigerAIThreateningTargetService
/// Size: 0x00D8 (0x000070 - 0x000148)
class UTigerAIThreateningTargetService : public UBTService
{ 
public:
	FBlackboardKeySelector                             ThreatPosition;                                             // 0x0070   (0x0028)  
	FBlackboardKeySelector                             CurrentThreatTarget;                                        // 0x0098   (0x0028)  
	FBlackboardKeySelector                             SuggestedNonObstructedPosition;                             // 0x00C0   (0x0028)  
	FBlackboardKeySelector                             bIsAllowedToChaseKey;                                       // 0x00E8   (0x0028)  
	FBlackboardKeySelector                             bCanShoot;                                                  // 0x0110   (0x0028)  
	bool                                               bUseAttackPermissions;                                      // 0x0138   (0x0001)  
	bool                                               bShowDebugFeatures;                                         // 0x0139   (0x0001)  
	unsigned char                                      UnknownData00_6[0xE];                                       // 0x013A   (0x000E)  MISSED
};

/// Class /Script/Tiger.TigerAIThreateningTargetEntityService
/// Size: 0x0028 (0x000148 - 0x000170)
class UTigerAIThreateningTargetEntityService : public UTigerAIThreateningTargetService
{ 
public:
	FBlackboardKeySelector                             MasqueradeBreachTargetKey;                                  // 0x0148   (0x0028)  
};

/// Class /Script/Tiger.TigerAiTryFindLocationAgainstElevatedTarget
/// Size: 0x0060 (0x000070 - 0x0000D0)
class UTigerAiTryFindLocationAgainstElevatedTarget : public UBTTaskNode
{ 
public:
	FBlackboardKeySelector                             TargetLocationKey;                                          // 0x0070   (0x0028)  
	FBlackboardKeySelector                             SuggestedLocationKey;                                       // 0x0098   (0x0028)  
	float                                              MaxStepbackDistance;                                        // 0x00C0   (0x0004)  
	float                                              MinStepbackDistance;                                        // 0x00C4   (0x0004)  
	float                                              DesiredMaxVerticalAngle;                                    // 0x00C8   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x00CC   (0x0004)  MISSED
};

/// Class /Script/Tiger.TigerAIUpdateBloodDrainedService
/// Size: 0x0008 (0x000070 - 0x000078)
class UTigerAIUpdateBloodDrainedService : public UBTService
{ 
public:
	float                                              MaxTimeInBloodDrainedState;                                 // 0x0070   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0074   (0x0004)  MISSED
};

/// Class /Script/Tiger.TigerAIUpdateWaypoint
/// Size: 0x0080 (0x000070 - 0x0000F0)
class UTigerAIUpdateWaypoint : public UBTService
{ 
public:
	FBlackboardKeySelector                             Index;                                                      // 0x0070   (0x0028)  
	FBlackboardKeySelector                             Waypoint;                                                   // 0x0098   (0x0028)  
	FBlackboardKeySelector                             bWaypointDirectionIsForward;                                // 0x00C0   (0x0028)  
	float                                              Distance;                                                   // 0x00E8   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x00EC   (0x0004)  MISSED
};

/// Class /Script/Tiger.TigerAiUseArchetypeDisciplineTask
/// Size: 0x0000 (0x0000C8 - 0x0000C8)
class UTigerAiUseArchetypeDisciplineTask : public UTigerAiDisciplineTaskBase
{ 
public:
};

/// Class /Script/Tiger.TigerAiUseClanDisciplineTask
/// Size: 0x0000 (0x0000C8 - 0x0000C8)
class UTigerAiUseClanDisciplineTask : public UTigerAiDisciplineTaskBase
{ 
public:
};

/// Class /Script/Tiger.TigerFearValueAsset
/// Size: 0x0050 (0x000030 - 0x000080)
class UTigerFearValueAsset : public UDataAsset
{ 
public:
	TMap<ETigerAIMasqueradeState, float>               FearValueThresholds;                                        // 0x0030   (0x0050)  
};

/// Class /Script/Tiger.TigerNpcPropAsset
/// Size: 0x0028 (0x000030 - 0x000058)
class UTigerNpcPropAsset : public UDataAsset
{ 
public:
	TArray<FName>                                      TagsToAddToNpc;                                             // 0x0030   (0x0010)  
	UTigerAnimationSetAsset*                           PropAnimationSet;                                           // 0x0040   (0x0008)  
	TArray<FName>                                      HeldPropAttachments;                                        // 0x0048   (0x0010)  
};

/// Class /Script/Tiger.TigerNPCVisualAsset
/// Size: 0x0120 (0x000030 - 0x000150)
class UTigerNPCVisualAsset : public UDataAsset
{ 
public:
	FName                                              MainTag;                                                    // 0x0030   (0x0008)  
	TArray<FName>                                      AdditionalTags;                                             // 0x0038   (0x0010)  
	USkeletalMesh*                                     SkeletalMesh;                                               // 0x0048   (0x0008)  
	TArray<USkeletalMesh*>                             HeadSkeletalMeshes;                                         // 0x0050   (0x0010)  
	TArray<USkeletalMesh*>                             HairSkeletalMeshes;                                         // 0x0060   (0x0010)  
	TArray<UTigerColorSetAsset*>                       ColorSetAssets;                                             // 0x0070   (0x0010)  
	TArray<UTigerLinearColorSetAsset*>                 HairColorSetAssets;                                         // 0x0080   (0x0010)  
	UMaterialInstance*                                 DefaultMaterial;                                            // 0x0090   (0x0008)  
	bool                                               bShowHeart;                                                 // 0x0098   (0x0001)  
	ETigerGender                                       Gender;                                                     // 0x0099   (0x0001)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x009A   (0x0006)  MISSED
	UClass*                                            HairAnimationBlueprint;                                     // 0x00A0   (0x0008)  
	bool                                               bUseCharacterPreset;                                        // 0x00A8   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x00A9   (0x0007)  MISSED
	TWeakObjectPtr<UTigerCharacterPreset*>             CharacterPreset;                                            // 0x00B0   (0x0028)  
	UClass*                                            AnimationInstanceClass;                                     // 0x00D8   (0x0008)  
	ETigerCivilianEmotionalState                       EmotionalState;                                             // 0x00E0   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x00E1   (0x0003)  MISSED
	float                                              ChanceForProp;                                              // 0x00E4   (0x0004)  
	TMap<UTigerNpcPropAsset*, float>                   PossibleNpcProps;                                           // 0x00E8   (0x0050)  
	float                                              WalkSpeed;                                                  // 0x0138   (0x0004)  
	float                                              WalkTurnSpeed;                                              // 0x013C   (0x0004)  
	float                                              SprintSpeed;                                                // 0x0140   (0x0004)  
	float                                              SprintTurnSpeed;                                            // 0x0144   (0x0004)  
	float                                              StrafeSpeed;                                                // 0x0148   (0x0004)  
	float                                              StrafeTurnSpeed;                                            // 0x014C   (0x0004)  
};

/// Class /Script/Tiger.TigerNPCBehaviorAsset
/// Size: 0x01E0 (0x000030 - 0x000210)
class UTigerNPCBehaviorAsset : public UDataAsset
{ 
public:
	UClass*                                            NPCBlueprint;                                               // 0x0030   (0x0008)  
	UClass*                                            MasqueradeActionResponseClass;                              // 0x0038   (0x0008)  
	UBehaviorTree*                                     DefaultBehaviorTree;                                        // 0x0040   (0x0008)  
	TMap<ETigerAIMasqueradeState, UBehaviorTree*>      BehaviorTrees;                                              // 0x0048   (0x0050)  
	TArray<UClass*>                                    AdditionalComponentClasses;                                 // 0x0098   (0x0010)  
	UClass*                                            WeaponClass;                                                // 0x00A8   (0x0008)  
	ETigerNPCType                                      NPCType;                                                    // 0x00B0   (0x0001)  
	ETigerAIAnimationMode                              AnimationMode;                                              // 0x00B1   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x00B2   (0x0002)  MISSED
	FTigerCharacterStatModification                    BaseStatModifications;                                      // 0x00B4   (0x00A8)  
	FTigerCharacterStatModification                    BaseGroupStatModifications;                                 // 0x015C   (0x00A8)  
	bool                                               bUseGroupStats;                                             // 0x0204   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0205   (0x0003)  MISSED
	float                                              OverrideBaseMaxHealth;                                      // 0x0208   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x020C   (0x0004)  MISSED
};

/// Class /Script/Tiger.TigerNPCAsset
/// Size: 0x0020 (0x000030 - 0x000050)
class UTigerNPCAsset : public UDataAsset
{ 
public:
	TArray<FTigerRandomVisualAsset>                    NormalizedVisualAssets;                                     // 0x0030   (0x0010)  
	UTigerNPCBehaviorAsset*                            BehaviorAsset;                                              // 0x0040   (0x0008)  
	UTigerGrimoireEntry*                               GrimoireEntry;                                              // 0x0048   (0x0008)  
};

/// Class /Script/Tiger.TigerColorSetAsset
/// Size: 0x00A0 (0x000030 - 0x0000D0)
class UTigerColorSetAsset : public UDataAsset
{ 
public:
	TMap<FName, FColor>                                ColorSets;                                                  // 0x0030   (0x0050)  
	TMap<FName, float>                                 ScalarParameters;                                           // 0x0080   (0x0050)  
};

/// Class /Script/Tiger.TigerNPCCheatCommandsAsset
/// Size: 0x0050 (0x000030 - 0x000080)
class UTigerNPCCheatCommandsAsset : public UDataAsset
{ 
public:
	TMap<FName, UTigerNPCAsset*>                       Commands;                                                   // 0x0030   (0x0050)  
};

/// Class /Script/Tiger.TigerLinearColorSetAsset
/// Size: 0x00A0 (0x000030 - 0x0000D0)
class UTigerLinearColorSetAsset : public UDataAsset
{ 
public:
	TMap<FName, FLinearColor>                          ColorSets;                                                  // 0x0030   (0x0050)  
	TMap<FName, float>                                 ScalarParameters;                                           // 0x0080   (0x0050)  
};

/// Class /Script/Tiger.TigerAIWithinMovementBoundsServices
/// Size: 0x0028 (0x000070 - 0x000098)
class UTigerAIWithinMovementBoundsServices : public UBTService
{ 
public:
	FBlackboardKeySelector                             TargetLocationKey;                                          // 0x0070   (0x0028)  
};

/// Class /Script/Tiger.TigerDisciplineMetaData
/// Size: 0x0008 (0x000028 - 0x000030)
class UTigerDisciplineMetaData : public UAnimMetaData
{ 
public:
	ETigerDisciplinesEnum                              DisicplineType;                                             // 0x0028   (0x0001)  
	bool                                               bAllowRotationLerp;                                         // 0x0029   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x002A   (0x0006)  MISSED
};

/// Class /Script/Tiger.TigerAnimationSet
/// Size: 0x0338 (0x000028 - 0x000360)
class UTigerAnimationSet : public UObject
{ 
public:
	TArray<UTigerAnimationSetAsset*>                   ParentSets;                                                 // 0x0028   (0x0010)  
	TMap<FName, UAnimSequence*>                        Sequences;                                                  // 0x0038   (0x0050)  
	TMap<FName, UAnimMontage*>                         Montages;                                                   // 0x0088   (0x0050)  
	TMap<FName, UTigerMontageList*>                    MontageLists;                                               // 0x00D8   (0x0050)  
	TMap<FName, UBlendSpace*>                          BlendSpaces;                                                // 0x0128   (0x0050)  
	TMap<FName, UBlendSpace1D*>                        BlendSpaces1D;                                              // 0x0178   (0x0050)  
	TMap<FName, UTigerRandomSequenceList*>             RandomSequenceLists;                                        // 0x01C8   (0x0050)  
	TMap<FName, UTigerCustomSequenceList*>             CustomSequences;                                            // 0x0218   (0x0050)  
	TMap<FName, UTigerCustomMontageList*>              CustomMontages;                                             // 0x0268   (0x0050)  
	TMap<FName, UTigerCustomBlendSpaceList*>           CustomBlendSpaces;                                          // 0x02B8   (0x0050)  
	TMap<FName, UTigerCustomBlendSpace1DList*>         CustomBlendSpaces1D;                                        // 0x0308   (0x0050)  
	int32_t                                            Priority;                                                   // 0x0358   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x035C   (0x0004)  MISSED
};

/// Class /Script/Tiger.TigerAnimationSetAsset
/// Size: 0x0008 (0x000030 - 0x000038)
class UTigerAnimationSetAsset : public UDataAsset
{ 
public:
	UTigerAnimationSet*                                Set;                                                        // 0x0030   (0x0008)  
};

/// Class /Script/Tiger.TigerAnimationSetCollection
/// Size: 0x0018 (0x000028 - 0x000040)
class UTigerAnimationSetCollection : public UObject
{ 
public:
	UTigerAnimationSet*                                ResultSet;                                                  // 0x0028   (0x0008)  
	TArray<UTigerAnimationSet*>                        AnimationSets;                                              // 0x0030   (0x0010)  


	/// Functions
	// Function /Script/Tiger.TigerAnimationSetCollection.AddSet
	void AddSet(UTigerAnimationSetAsset* Asset);                                                                             // [0x1488d30] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/Tiger.TigerMontageList
/// Size: 0x0010 (0x000028 - 0x000038)
class UTigerMontageList : public UObject
{ 
public:
	TArray<UAnimMontage*>                              MontageList;                                                // 0x0028   (0x0010)  


	/// Functions
	// Function /Script/Tiger.TigerMontageList.GetRandomMontage
	UAnimMontage* GetRandomMontage();                                                                                        // [0x1489640] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/Tiger.TigerCustomSequenceList
/// Size: 0x0000 (0x000028 - 0x000028)
class UTigerCustomSequenceList : public UObject
{ 
public:
};

/// Class /Script/Tiger.TigerCustomSequenceListClan
/// Size: 0x0028 (0x000028 - 0x000050)
class UTigerCustomSequenceListClan : public UTigerCustomSequenceList
{ 
public:
	UAnimSequence*                                     Sequences;                                                  // 0x0028   (0x0028)  
};

/// Class /Script/Tiger.TigerCustomSequenceListGender
/// Size: 0x0010 (0x000028 - 0x000038)
class UTigerCustomSequenceListGender : public UTigerCustomSequenceList
{ 
public:
	UAnimSequence*                                     Sequences;                                                  // 0x0028   (0x0010)  
};

/// Class /Script/Tiger.TigerCustomSequenceListClanAndGender
/// Size: 0x0050 (0x000028 - 0x000078)
class UTigerCustomSequenceListClanAndGender : public UTigerCustomSequenceList
{ 
public:
	FTigerPlayerSequenceByClan                         SequencesByClan;                                            // 0x0028   (0x0050)  
};

/// Class /Script/Tiger.TigerCustomMontageList
/// Size: 0x0000 (0x000028 - 0x000028)
class UTigerCustomMontageList : public UObject
{ 
public:
};

/// Class /Script/Tiger.TigerCustomMontageListClan
/// Size: 0x0028 (0x000028 - 0x000050)
class UTigerCustomMontageListClan : public UTigerCustomMontageList
{ 
public:
	UAnimMontage*                                      Montages;                                                   // 0x0028   (0x0028)  
};

/// Class /Script/Tiger.TigerCustomMontageListGender
/// Size: 0x0010 (0x000028 - 0x000038)
class UTigerCustomMontageListGender : public UTigerCustomMontageList
{ 
public:
	UAnimMontage*                                      Montages;                                                   // 0x0028   (0x0010)  
};

/// Class /Script/Tiger.TigerCustomMontageListClanAndGender
/// Size: 0x0050 (0x000028 - 0x000078)
class UTigerCustomMontageListClanAndGender : public UTigerCustomMontageList
{ 
public:
	FTigerPlayerMontageByClan                          MontagesByClan;                                             // 0x0028   (0x0050)  
};

/// Class /Script/Tiger.TigerCustomMontageListMeleeWeapon
/// Size: 0x0050 (0x000028 - 0x000078)
class UTigerCustomMontageListMeleeWeapon : public UTigerCustomMontageList
{ 
public:
	TMap<UClass*, UAnimMontage*>                       Montages;                                                   // 0x0028   (0x0050)  
};

/// Class /Script/Tiger.TigerCustomBlendSpaceList
/// Size: 0x0000 (0x000028 - 0x000028)
class UTigerCustomBlendSpaceList : public UObject
{ 
public:
};

/// Class /Script/Tiger.TigerCustomBlendSpaceListClan
/// Size: 0x0028 (0x000028 - 0x000050)
class UTigerCustomBlendSpaceListClan : public UTigerCustomBlendSpaceList
{ 
public:
	UBlendSpace*                                       BlendSpaces;                                                // 0x0028   (0x0028)  
};

/// Class /Script/Tiger.TigerCustomBlendSpaceListGender
/// Size: 0x0010 (0x000028 - 0x000038)
class UTigerCustomBlendSpaceListGender : public UTigerCustomBlendSpaceList
{ 
public:
	UBlendSpace*                                       BlendSpaces;                                                // 0x0028   (0x0010)  
};

/// Class /Script/Tiger.TigerCustomBlendSpaceListClanAndGender
/// Size: 0x0050 (0x000028 - 0x000078)
class UTigerCustomBlendSpaceListClanAndGender : public UTigerCustomBlendSpaceList
{ 
public:
	FTigerPlayerBlendSpaceByClan                       BlendSpacesByClan;                                          // 0x0028   (0x0050)  
};

/// Class /Script/Tiger.TigerCustomBlendSpace1DList
/// Size: 0x0000 (0x000028 - 0x000028)
class UTigerCustomBlendSpace1DList : public UObject
{ 
public:
};

/// Class /Script/Tiger.TigerCustomBlendSpace1DListClan
/// Size: 0x0028 (0x000028 - 0x000050)
class UTigerCustomBlendSpace1DListClan : public UTigerCustomBlendSpace1DList
{ 
public:
	UBlendSpace1D*                                     BlendSpaces;                                                // 0x0028   (0x0028)  
};

/// Class /Script/Tiger.TigerCustomBlendSpace1DListGender
/// Size: 0x0010 (0x000028 - 0x000038)
class UTigerCustomBlendSpace1DListGender : public UTigerCustomBlendSpace1DList
{ 
public:
	UBlendSpace1D*                                     BlendSpaces;                                                // 0x0028   (0x0010)  
};

/// Class /Script/Tiger.TigerCustomBlendSpace1DListClanAndGender
/// Size: 0x0050 (0x000028 - 0x000078)
class UTigerCustomBlendSpace1DListClanAndGender : public UTigerCustomBlendSpace1DList
{ 
public:
	FTigerPlayerBlendSpace1DByClan                     BlendSpacesByClan;                                          // 0x0028   (0x0050)  
};

/// Class /Script/Tiger.TigerAnimIKWindow
/// Size: 0x0048 (0x000030 - 0x000078)
class UTigerAnimIKWindow : public UAnimNotifyState
{ 
public:
	FName                                              SocketName;                                                 // 0x0030   (0x0008)  
	FName                                              SocketToLineTraceFrom;                                      // 0x0038   (0x0008)  
	ETigerIKDirection                                  IKSearchDirection;                                          // 0x0040   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0041   (0x0003)  MISSED
	FName                                              TargetJoint;                                                // 0x0044   (0x0008)  
	float                                              TargetJointVerticalOffsetAmount;                            // 0x004C   (0x0004)  
	float                                              TargetJointHorizontalOffsetAmount;                          // 0x0050   (0x0004)  
	float                                              TargetJointDepthOffsetAmount;                               // 0x0054   (0x0004)  
	float                                              IKResultVerticalAdjustment;                                 // 0x0058   (0x0004)  
	float                                              IKResultHorizontalAdjustment;                               // 0x005C   (0x0004)  
	float                                              IKResultDepthAdjustment;                                    // 0x0060   (0x0004)  
	float                                              IKResultAlpha;                                              // 0x0064   (0x0004)  
	bool                                               bIKShouldRemainActiveWhenAnimationLoops;                    // 0x0068   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0069   (0x0003)  MISSED
	float                                              InOutBlendSpeed;                                            // 0x006C   (0x0004)  
	bool                                               bShouldBlendInAndOut;                                       // 0x0070   (0x0001)  
	unsigned char                                      UnknownData02_6[0x7];                                       // 0x0071   (0x0007)  MISSED
};

/// Class /Script/Tiger.TigerFaceCurvesAnimationMap
/// Size: 0x00A0 (0x000028 - 0x0000C8)
class UTigerFaceCurvesAnimationMap : public UObject
{ 
public:
	TMap<FName, UAnimSequence*>                        CurveAnimations;                                            // 0x0028   (0x0050)  
	TMap<FName, UAnimMontage*>                         FaceMontages;                                               // 0x0078   (0x0050)  
};

/// Class /Script/Tiger.TigerAnimInstance
/// Size: 0x0100 (0x0002C0 - 0x0003C0)
class UTigerAnimInstance : public UAnimInstance
{ 
public:
	ETigerEquippedWeaponType                           EquippedWeaponType;                                         // 0x02B8   (0x0001)  
	bool                                               bOwnerIsLocked;                                             // 0x02B9   (0x0001)  
	unsigned char                                      UnknownData00_5[0x6];                                       // 0x02BA   (0x0006)  MISSED
	UPoseAsset*                                        FacePoseAsset;                                              // 0x02C0   (0x0008)  
	UAnimSequence*                                     FacePoseAnimation;                                          // 0x02C8   (0x0008)  
	UBlendSpace*                                       BlockStanceBlendSpace;                                      // 0x02D0   (0x0008)  
	UAnimSequence*                                     BodyModifierJointScalings;                                  // 0x02D8   (0x0008)  
	unsigned char                                      UnknownData01_5[0x50];                                      // 0x02E0   (0x0050)  MISSED
	UTigerAnimationSetAsset*                           DefaultAnimationSet;                                        // 0x0330   (0x0008)  
	UClass*                                            FaceCurvesAnimationMap;                                     // 0x0338   (0x0008)  
	TArray<FName>                                      AvailableFaceCurves;                                        // 0x0340   (0x0010)  
	UTigerAnimationFilter*                             FacialAnimationFilter;                                      // 0x0350   (0x0008)  
	UTigerAnimationSetCollection*                      AnimationSetCollection;                                     // 0x0358   (0x0008)  
	UTigerAnimationSetCollection*                      PreviousAnimationSetCollection;                             // 0x0360   (0x0008)  
	UAnimMontage*                                      LatestFacialAnim;                                           // 0x0368   (0x0008)  
	FVector                                            Velocity;                                                   // 0x0370   (0x000C)  
	FVector                                            PreviousVelocity;                                           // 0x037C   (0x000C)  
	float                                              Speed;                                                      // 0x0388   (0x0004)  
	float                                              Direction;                                                  // 0x038C   (0x0004)  
	float                                              AimAnglePitch;                                              // 0x0390   (0x0004)  
	float                                              AimAngleYaw;                                                // 0x0394   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x0398   (0x0004)  MISSED
	bool                                               bIsDead;                                                    // 0x039C   (0x0001)  
	bool                                               bShooting;                                                  // 0x039D   (0x0001)  
	bool                                               bIsBlocking;                                                // 0x039E   (0x0001)  
	bool                                               bIsMontagePlaying;                                          // 0x039F   (0x0001)  
	unsigned char                                      UnknownData03_5[0x4];                                       // 0x03A0   (0x0004)  MISSED
	float                                              MaxRootYawOffset;                                           // 0x03A4   (0x0004)  
	float                                              MaxAimingRootYawOffset;                                     // 0x03A8   (0x0004)  
	float                                              RootYawOffset;                                              // 0x03AC   (0x0004)  
	float                                              SmoothCharacterYaw;                                         // 0x03B0   (0x0004)  
	float                                              CharacterYawLastTick;                                       // 0x03B4   (0x0004)  
	float                                              CharacterYawChangeOverFrame;                                // 0x03B8   (0x0004)  
	float                                              CharacterDeltaYawSmooth;                                    // 0x03BC   (0x0004)  


	/// Functions
	// Function /Script/Tiger.TigerAnimInstance.WeaponTypeBranch
	void WeaponTypeBranch(ETigerEquippedWeaponType& WeaponType);                                                             // [0x1489990] Final|Native|Protected|HasOutParms|BlueprintCallable 
	// Function /Script/Tiger.TigerAnimInstance.UpdateAnimNotifyIKAlphaBlendOnBones
	void UpdateAnimNotifyIKAlphaBlendOnBones(float DeltaTime);                                                               // [0x1489910] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerAnimInstance.TurnInPlace
	void TurnInPlace(bool bInIsStandingOnGround);                                                                            // [0x1489880] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerAnimInstance.OnSuccessfulMeleeHit
	void OnSuccessfulMeleeHit();                                                                                             // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Script/Tiger.TigerAnimInstance.OnSettle
	void OnSettle(FTigerSettleEvent& SettleEvent);                                                                           // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Script/Tiger.TigerAnimInstance.OnMeleeAttack
	void OnMeleeAttack(int32_t InAttackIndex);                                                                               // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Script/Tiger.TigerAnimInstance.OnInitiateAnimationBlueprint
	void OnInitiateAnimationBlueprint();                                                                                     // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Script/Tiger.TigerAnimInstance.OnFootstep
	void OnFootstep(bool bIsLeftFoot, float FootstepDuration);                                                               // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Script/Tiger.TigerAnimInstance.OnFiredWeapon
	void OnFiredWeapon(bool bInSecondaryWeaponFired);                                                                        // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Script/Tiger.TigerAnimInstance.OnChangeAnimationSet
	void OnChangeAnimationSet();                                                                                             // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Script/Tiger.TigerAnimInstance.IsActiveMontageRootMotion
	bool IsActiveMontageRootMotion();                                                                                        // [0x1489780] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerAnimInstance.GetSequence
	UAnimSequence* GetSequence(FName SequenceName);                                                                          // [0x14896e0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerAnimInstance.GetRandomMontage
	UAnimMontage* GetRandomMontage(FName MontageListName);                                                                   // [0x14895a0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerAnimInstance.GetRandomAnimationSequenceList
	UTigerRandomSequenceList* GetRandomAnimationSequenceList(FName SequenceListName);                                        // [0x1489500] Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerAnimInstance.GetPreviousRandomAnimationSequenceList
	UTigerRandomSequenceList* GetPreviousRandomAnimationSequenceList(FName SequenceListName);                                // [0x1489460] Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerAnimInstance.GetPreviousBlendSpace
	UBlendSpace* GetPreviousBlendSpace(FName BlendSpaceName);                                                                // [0x14893c0] Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerAnimInstance.GetMontage
	UAnimMontage* GetMontage(FName InMontageName);                                                                           // [0x1489320] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerAnimInstance.GetFaceAnimSlotsWithActiveCurves
	void GetFaceAnimSlotsWithActiveCurves(FName& OutSlot0, FName& OutSlot1, FName& OutSlot2, FName& OutSlot3);               // [0x14890e0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Tiger.TigerAnimInstance.GetFaceAnimationForCurve
	UAnimSequence* GetFaceAnimationForCurve(FName& CurveName);                                                               // [0x1489280] Final|Native|Protected|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerAnimInstance.GetBlendSpace1D
	UBlendSpace1D* GetBlendSpace1D(FName BlendSpace1DName);                                                                  // [0x1488fa0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerAnimInstance.GetBlendSpace
	UBlendSpace* GetBlendSpace(FName BlendSpaceName);                                                                        // [0x1489040] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerAnimInstance.GetAnimSetAssetFromWeaponClass
	UTigerAnimationSetAsset* GetAnimSetAssetFromWeaponClass(UClass* InWeaponClass);                                          // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Script/Tiger.TigerAnimInstance.GetAnimNotifyIKDataForBone
	bool GetAnimNotifyIKDataForBone(FName BoneName, FTigerAnimNotifyIKData& IKData);                                         // [0x1488e70] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerAnimInstance.ApplyBlendShapeScalarValues
	void ApplyBlendShapeScalarValues(TArray<FTigerCharacterBlendShapeScalarValue>& InBlendShapeScalarValues);                // [0x1488dc0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Tiger.TigerAnimInstance.AddSets
	void AddSets(UTigerAnimationSetCollection* SetCollection);                                                               // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Script/Tiger.TigerAnimInstance.AbortFacialAnimCallback
	void AbortFacialAnimCallback();                                                                                          // [0x1488d10] Final|Native|Public  
	// Function /Script/Tiger.TigerAnimInstance.AbortAnimation
	void AbortAnimation(float BlendOutTime, UAnimMontage* AnimationMontage, bool bStopAllIfNullMontage);                     // [0x1488bf0] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/Tiger.TigerAnimNotiftyStateFlying
/// Size: 0x0000 (0x000030 - 0x000030)
class UTigerAnimNotiftyStateFlying : public UAnimNotifyState
{ 
public:
};

/// Class /Script/Tiger.TigerAnimNotify_AddProps
/// Size: 0x0018 (0x000038 - 0x000050)
class UTigerAnimNotify_AddProps : public UAnimNotify
{ 
public:
	UClass*                                            PropDummyClass;                                             // 0x0038   (0x0008)  
	TArray<FName>                                      PropsToSpawn;                                               // 0x0040   (0x0010)  
};

/// Class /Script/Tiger.TigerAnimNotify_CameraAnimation
/// Size: 0x0010 (0x000038 - 0x000048)
class UTigerAnimNotify_CameraAnimation : public UAnimNotify
{ 
public:
	UCameraAnim*                                       CameraAnimation;                                            // 0x0038   (0x0008)  
	float                                              AnimationRate;                                              // 0x0040   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0044   (0x0004)  MISSED
};

/// Class /Script/Tiger.TigerAnimNotify_CameraShake
/// Size: 0x0010 (0x000038 - 0x000048)
class UTigerAnimNotify_CameraShake : public UAnimNotify
{ 
public:
	UClass*                                            ShakeType;                                                  // 0x0038   (0x0008)  
	float                                              ShakeScale;                                                 // 0x0040   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0044   (0x0004)  MISSED
};

/// Class /Script/Tiger.TigerAnimNotify_Discipline
/// Size: 0x0008 (0x000038 - 0x000040)
class UTigerAnimNotify_Discipline : public UAnimNotify
{ 
public:
	ETigerDisciplinesEnum                              Discipline;                                                 // 0x0038   (0x0001)  
	ETigerDisciplineEvent                              DisciplineEvent;                                            // 0x0039   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x003A   (0x0006)  MISSED
};

/// Class /Script/Tiger.TigerAnimNotify_DropProps
/// Size: 0x0000 (0x000038 - 0x000038)
class UTigerAnimNotify_DropProps : public UAnimNotify
{ 
public:
};

/// Class /Script/Tiger.TigerAnimNotify_Footstep
/// Size: 0x0008 (0x000038 - 0x000040)
class UTigerAnimNotify_Footstep : public UAnimNotify
{ 
public:
	bool                                               bIsLeftFoot;                                                // 0x0038   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0039   (0x0003)  MISSED
	float                                              FootstepDuration;                                           // 0x003C   (0x0004)  


	/// Functions
	// Function /Script/Tiger.TigerAnimNotify_Footstep.SetData
	void SetData(bool bIsLeftFootIn, float FootstepDurationIn);                                                              // [0x14897b0] Final|Native|Public|BlueprintCallable|Const 
};

/// Class /Script/Tiger.TigerAnimNotify_Melee
/// Size: 0x0008 (0x000038 - 0x000040)
class UTigerAnimNotify_Melee : public UAnimNotify
{ 
public:
	FName                                              EventName;                                                  // 0x0038   (0x0008)  
};

/// Class /Script/Tiger.TigerAnimNotify_NiagaraEffect
/// Size: 0x0048 (0x000038 - 0x000080)
class UTigerAnimNotify_NiagaraEffect : public UAnimNotify
{ 
public:
	FSoftObjectPath                                    NiagaraPath;                                                // 0x0038   (0x0018)  
	UNiagaraSystem*                                    CachedNiagaraEffect;                                        // 0x0050   (0x0008)  
	FName                                              AttachPointName;                                            // 0x0058   (0x0008)  
	FVector                                            EffectLocation;                                             // 0x0060   (0x000C)  
	FRotator                                           EffectRotation;                                             // 0x006C   (0x000C)  
	TEnumAsByte<EAttachLocation>                       AttachLocationRule;                                         // 0x0078   (0x0001)  
	bool                                               bOnlySpawnOnLocalPlayer;                                    // 0x0079   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x007A   (0x0006)  MISSED
};

/// Class /Script/Tiger.TigerAnimNotify_ParticleEffect
/// Size: 0x0040 (0x000090 - 0x0000D0)
class UTigerAnimNotify_ParticleEffect : public UAnimNotify_PlayParticleEffect
{ 
public:
	UParticleSystem*                                   IndoorPSTemplate;                                           // 0x0090   (0x0008)  
	UParticleSystem*                                   OutdoorPSTemplate;                                          // 0x0098   (0x0008)  
	ETigerPlayOnClients                                PlayOnClients;                                              // 0x00A0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x1F];                                      // 0x00A1   (0x001F)  MISSED
	UTigerParticleStrategyChooseSystem*                ChooseParticleSystemOverride;                               // 0x00C0   (0x0008)  
	UTigerParticleStrategyPostSpawn*                   ParticlePostSpawnModification;                              // 0x00C8   (0x0008)  
};

/// Class /Script/Tiger.TigerAnimNotify_PlayCharEffect
/// Size: 0x0010 (0x000038 - 0x000048)
class UTigerAnimNotify_PlayCharEffect : public UAnimNotify
{ 
public:
	UClass*                                            Effect;                                                     // 0x0038   (0x0008)  
	FName                                              SocketToUse;                                                // 0x0040   (0x0008)  
};

/// Class /Script/Tiger.TigerAnimNotify_PlayVoEvent
/// Size: 0x0008 (0x000038 - 0x000040)
class UTigerAnimNotify_PlayVoEvent : public UAnimNotify
{ 
public:
	FTigerNpcVoCategory                                VoCategory;                                                 // 0x0038   (0x0008)  
};

/// Class /Script/Tiger.TigerAnimNotify_PrimeWeapon
/// Size: 0x0000 (0x000038 - 0x000038)
class UTigerAnimNotify_PrimeWeapon : public UAnimNotify
{ 
public:
};

/// Class /Script/Tiger.TigerAnimNotify_Ragdoll
/// Size: 0x0010 (0x000038 - 0x000048)
class UTigerAnimNotify_Ragdoll : public UAnimNotify
{ 
public:
	FName                                              RagdollOnlyBelowBone;                                       // 0x0038   (0x0008)  
	bool                                               bIncludeNamedBone;                                          // 0x0040   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0041   (0x0003)  MISSED
	float                                              VelocityScale;                                              // 0x0044   (0x0004)  
};

/// Class /Script/Tiger.TigerAnimNotify_Recklessness
/// Size: 0x0008 (0x000038 - 0x000040)
class UTigerAnimNotify_Recklessness : public UAnimNotify
{ 
public:
	bool                                               bActivate;                                                  // 0x0038   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0039   (0x0007)  MISSED
};

/// Class /Script/Tiger.TigerAnimNotify_ReloadSlot
/// Size: 0x0000 (0x000038 - 0x000038)
class UTigerAnimNotify_ReloadSlot : public UAnimNotify
{ 
public:
};

/// Class /Script/Tiger.TigerAnimNotify_ReloadComplete
/// Size: 0x0000 (0x000038 - 0x000038)
class UTigerAnimNotify_ReloadComplete : public UTigerAnimNotify_ReloadSlot
{ 
public:
};

/// Class /Script/Tiger.TigerAnimNotify_ReloadFull
/// Size: 0x0000 (0x000038 - 0x000038)
class UTigerAnimNotify_ReloadFull : public UTigerAnimNotify_ReloadSlot
{ 
public:
};

/// Class /Script/Tiger.TigerAnimNotify_ReloadSingle
/// Size: 0x0000 (0x000038 - 0x000038)
class UTigerAnimNotify_ReloadSingle : public UTigerAnimNotify_ReloadSlot
{ 
public:
};

/// Class /Script/Tiger.TigerAnimNotify_SetCapContext
/// Size: 0x0008 (0x000038 - 0x000040)
class UTigerAnimNotify_SetCapContext : public UAnimNotify
{ 
public:
	FName                                              ContextName;                                                // 0x0038   (0x0008)  
};

/// Class /Script/Tiger.TigerAnimNotify_SpawnMesh
/// Size: 0x0038 (0x000038 - 0x000070)
class UTigerAnimNotify_SpawnMesh : public UAnimNotify
{ 
public:
	UStaticMesh*                                       MeshToSpawn;                                                // 0x0038   (0x0008)  
	FName                                              SocketToSpawnFrom;                                          // 0x0040   (0x0008)  
	FVector                                            Direction;                                                  // 0x0048   (0x0018)  
	float                                              Speed;                                                      // 0x0060   (0x0008)  
	float                                              RandomAngularImpulseStrength;                               // 0x0068   (0x0004)  
	bool                                               bShowInEditor;                                              // 0x006C   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x006D   (0x0003)  MISSED
};

/// Class /Script/Tiger.TigerAnimNotify_TriggerUpdateWpnAppearance
/// Size: 0x0000 (0x000038 - 0x000038)
class UTigerAnimNotify_TriggerUpdateWpnAppearance : public UAnimNotify
{ 
public:
};

/// Class /Script/Tiger.TigerAnimNotifyState_AbortAnimationOnInput
/// Size: 0x0008 (0x000030 - 0x000038)
class UTigerAnimNotifyState_AbortAnimationOnInput : public UAnimNotifyState
{ 
public:
	float                                              BlendOutTime;                                               // 0x0030   (0x0004)  
	bool                                               bShouldAbortOnMovement;                                     // 0x0034   (0x0001)  
	bool                                               bShouldAbortOnHeldBlock;                                    // 0x0035   (0x0001)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x0036   (0x0002)  MISSED
};

/// Class /Script/Tiger.TigerAnimNotifyState_CameraPresetOverride
/// Size: 0x0008 (0x000030 - 0x000038)
class UTigerAnimNotifyState_CameraPresetOverride : public UAnimNotifyState
{ 
public:
	UClass*                                            CameraPreset;                                               // 0x0030   (0x0008)  
};

/// Class /Script/Tiger.TigerAnimNotifyState_CancelReactionIfThreatened
/// Size: 0x0008 (0x000030 - 0x000038)
class UTigerAnimNotifyState_CancelReactionIfThreatened : public UAnimNotifyState
{ 
public:
	ETigerAIAnimationMode                              StateToCancelFor;                                           // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0031   (0x0007)  MISSED


	/// Functions
	// Function /Script/Tiger.TigerAnimNotifyState_CancelReactionIfThreatened.OnReactionCanceled
	void OnReactionCanceled(ATigerNPC* NPC);                                                                                 // [0x197e4f0] Event|Public|BlueprintEvent|Const 
};

/// Class /Script/Tiger.TigerAnimNotifyState_DamageImmunity
/// Size: 0x0010 (0x000030 - 0x000040)
class UTigerAnimNotifyState_DamageImmunity : public UAnimNotifyState
{ 
public:
	TArray<UClass*>                                    ImmunityTo;                                                 // 0x0030   (0x0010)  
};

/// Class /Script/Tiger.TigerAnimNotifyState_EnableTurnStart
/// Size: 0x0000 (0x000030 - 0x000030)
class UTigerAnimNotifyState_EnableTurnStart : public UAnimNotifyState
{ 
public:
};

/// Class /Script/Tiger.TigerAnimNotifyState_EnableWeaponHitbox
/// Size: 0x0020 (0x000030 - 0x000050)
class UTigerAnimNotifyState_EnableWeaponHitbox : public UAnimNotifyState
{ 
public:
	unsigned char                                      UnknownData00_2[0x10];                                      // 0x0030   (0x0010)  MISSED
	UCurveFloat*                                       pitchOffsetCurve;                                           // 0x0040   (0x0008)  
	int32_t                                            WeaponIndex;                                                // 0x0048   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x004C   (0x0004)  MISSED
};

/// Class /Script/Tiger.TigerAnimNotifyState_FaceCameraDirection
/// Size: 0x0000 (0x000030 - 0x000030)
class UTigerAnimNotifyState_FaceCameraDirection : public UAnimNotifyState
{ 
public:
};

/// Class /Script/Tiger.TigerAnimNotifyState_HeavyAttackRange
/// Size: 0x0000 (0x000030 - 0x000030)
class UTigerAnimNotifyState_HeavyAttackRange : public UAnimNotifyState
{ 
public:
};

/// Class /Script/Tiger.TigerAnimNotifyState_HideWeapon
/// Size: 0x0008 (0x000030 - 0x000038)
class UTigerAnimNotifyState_HideWeapon : public UAnimNotifyState
{ 
public:
	ETigerTriggerUpdateWpnAppearance                   WeaponAppearanceUpdate;                                     // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0031   (0x0007)  MISSED
};

/// Class /Script/Tiger.TigerAnimNotifyState_Invulnerability
/// Size: 0x0000 (0x000030 - 0x000030)
class UTigerAnimNotifyState_Invulnerability : public UAnimNotifyState
{ 
public:
};

/// Class /Script/Tiger.TigerAnimNotifyState_LockOwner
/// Size: 0x0008 (0x000030 - 0x000038)
class UTigerAnimNotifyState_LockOwner : public UAnimNotifyState
{ 
public:
	bool                                               bStopActiveMovement;                                        // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0031   (0x0007)  MISSED
};

/// Class /Script/Tiger.TigerAnimNotifyState_MeleeRecoveryEnableMove
/// Size: 0x0000 (0x000030 - 0x000030)
class UTigerAnimNotifyState_MeleeRecoveryEnableMove : public UAnimNotifyState
{ 
public:
};

/// Class /Script/Tiger.TigerAnimNotifyState_OverrideCanInteractInDodge
/// Size: 0x0008 (0x000030 - 0x000038)
class UTigerAnimNotifyState_OverrideCanInteractInDodge : public UAnimNotifyState
{ 
public:
	UClass*                                            RequiredWeapon;                                             // 0x0030   (0x0008)  
};

/// Class /Script/Tiger.TigerAnimNotifyState_RangedHitAnimInterruptRange
/// Size: 0x0000 (0x000030 - 0x000030)
class UTigerAnimNotifyState_RangedHitAnimInterruptRange : public UAnimNotifyState
{ 
public:
};

/// Class /Script/Tiger.TigerAnimNotifyState_ResetCloth
/// Size: 0x0000 (0x000030 - 0x000030)
class UTigerAnimNotifyState_ResetCloth : public UAnimNotifyState
{ 
public:
};

/// Class /Script/Tiger.TigerAnimNotifyState_TimedIndoorOutDoorParticleEffect
/// Size: 0x0048 (0x000030 - 0x000078)
class UTigerAnimNotifyState_TimedIndoorOutDoorParticleEffect : public UAnimNotifyState
{ 
public:
	UParticleSystem*                                   IndoorPSTemplate;                                           // 0x0030   (0x0008)  
	UParticleSystem*                                   OutdoorPSTemplate;                                          // 0x0038   (0x0008)  
	ETigerPlayOnClients                                PlayOnClients;                                              // 0x0040   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0041   (0x0003)  MISSED
	FName                                              SocketName;                                                 // 0x0044   (0x0008)  
	FVector                                            LocationOffset;                                             // 0x004C   (0x000C)  
	FRotator                                           RotationOffset;                                             // 0x0058   (0x000C)  
	bool                                               bDestroyAtEnd;                                              // 0x0064   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0065   (0x0003)  MISSED
	UTigerParticleStrategyChooseSystem*                ChooseParticleSystemOverride;                               // 0x0068   (0x0008)  
	UTigerParticleStrategyPostSpawn*                   ParticlePostSpawnModification;                              // 0x0070   (0x0008)  
};

/// Class /Script/Tiger.TigerAnimNotifyState_WallGrindFX
/// Size: 0x0010 (0x000030 - 0x000040)
class UTigerAnimNotifyState_WallGrindFX : public UAnimNotifyState
{ 
public:
	TArray<FName>                                      SocketsToUse;                                               // 0x0030   (0x0010)  
};

/// Class /Script/Tiger.TigerAnimNotifyState_WeaponGlow
/// Size: 0x0000 (0x000030 - 0x000030)
class UTigerAnimNotifyState_WeaponGlow : public UAnimNotifyState
{ 
public:
};

/// Class /Script/Tiger.TigerAnimNotifyStateAttachMesh
/// Size: 0x0018 (0x000030 - 0x000048)
class UTigerAnimNotifyStateAttachMesh : public UAnimNotifyState
{ 
public:
	UStaticMesh*                                       MeshToSpawn;                                                // 0x0030   (0x0008)  
	FName                                              SocketName;                                                 // 0x0038   (0x0008)  
	bool                                               bShowInEditor;                                              // 0x0040   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0041   (0x0003)  MISSED
	float                                              PropTimeout;                                                // 0x0044   (0x0004)  
};

/// Class /Script/Tiger.TigerAnimNotifyStateJdgSword
/// Size: 0x0000 (0x000030 - 0x000030)
class UTigerAnimNotifyStateJdgSword : public UAnimNotifyState
{ 
public:
};

/// Class /Script/Tiger.TigerANS_DeltaCorrectionWindow
/// Size: 0x0000 (0x000030 - 0x000030)
class UTigerANS_DeltaCorrectionWindow : public UAnimNotifyState
{ 
public:
};

/// Class /Script/Tiger.TigerAnsSidewaysClimbBlocker
/// Size: 0x0000 (0x000030 - 0x000030)
class UTigerAnsSidewaysClimbBlocker : public UAnimNotifyState
{ 
public:
};

/// Class /Script/Tiger.TigerApartmentArchetype
/// Size: 0x0028 (0x000228 - 0x000250)
class ATigerApartmentArchetype : public AActor
{ 
public:
	USceneComponent*                                   Root;                                                       // 0x0228   (0x0008)  
	USceneComponent*                                   Min;                                                        // 0x0230   (0x0008)  
	USceneComponent*                                   Max;                                                        // 0x0238   (0x0008)  
	TArray<UMaterialInterface*>                        PossibleWallpapers;                                         // 0x0240   (0x0010)  
};

/// Class /Script/Tiger.TigerApartmentLight
/// Size: 0x0000 (0x000228 - 0x000228)
class ATigerApartmentLight : public AActor
{ 
public:
};

/// Class /Script/Tiger.TigerWidget
/// Size: 0x0020 (0x000260 - 0x000280)
class UTigerWidget : public UUserWidget
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0260   (0x0008)  MISSED
	UTigerTooltipWidget*                               TigerTooltipWidget;                                         // 0x0268   (0x0008)  
	TArray<FTigerTooltipAction>                        TooltipActions;                                             // 0x0270   (0x0010)  


	/// Functions
	// Function /Script/Tiger.TigerWidget.UpdateScrollOffsetFromGamepadInput
	void UpdateScrollOffsetFromGamepadInput(UScrollBox* ScrollBox);                                                          // [0x1630e20] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerWidget.ShouldIgnoreVisibilityChanges
	bool ShouldIgnoreVisibilityChanges();                                                                                    // [0x1630dc0] Native|Event|Public|BlueprintEvent|Const 
	// Function /Script/Tiger.TigerWidget.ReuseOrCreateNewTooltipWidget
	UTigerTooltipWidget* ReuseOrCreateNewTooltipWidget(UClass* InTooltipClass);                                              // [0x1630d20] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerWidget.RemoveTooltipInputListeners
	void RemoveTooltipInputListeners();                                                                                      // [0x1630d00] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerWidget.PostAkEvent
	void PostAkEvent(UAkAudioEvent* AudioEvent);                                                                             // [0x1630be0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerWidget.OnPlayerStateReceived
	void OnPlayerStateReceived(ATigerPlayerState* InPlayerState);                                                            // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Script/Tiger.TigerWidget.IsSharkmobAccountLoginsEnabled
	bool IsSharkmobAccountLoginsEnabled();                                                                                   // [0x1630680] Final|Native|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/Tiger.TigerWidget.IncrementCollapseVisibility
	void IncrementCollapseVisibility();                                                                                      // [0x1630660] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerWidget.GetViewTargetTigerPlayer
	ATigerPlayer* GetViewTargetTigerPlayer();                                                                                // [0x1630380] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerWidget.GetTigerSpectator
	ATigerSpectatorPawn* GetTigerSpectator();                                                                                // [0x1630350] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerWidget.GetTigerPlayerState
	ATigerPlayerState* GetTigerPlayerState();                                                                                // [0x1630320] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerWidget.GetTigerPlayerController
	ATigerPlayerController* GetTigerPlayerController();                                                                      // [0x16302f0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerWidget.GetTigerPlayer
	ATigerPlayer* GetTigerPlayer();                                                                                          // [0x16302c0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerWidget.GetTigerPersistentPlayerState
	UTigerPersistentPlayerState* GetTigerPersistentPlayerState();                                                            // [0x1630290] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerWidget.GetTigerMatchHUD
	ATigerMatchHUD* GetTigerMatchHUD();                                                                                      // [0x1630260] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerWidget.GetTigerMatchGameState
	ATigerMatchGameState* GetTigerMatchGameState();                                                                          // [0x1630230] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerWidget.GetTigerElysiumHUD
	ATigerElysiumHUD* GetTigerElysiumHUD();                                                                                  // [0x1630200] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerWidget.GetTigerBaseHUD
	ATigerHUD* GetTigerBaseHUD();                                                                                            // [0x16301d0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerWidget.GetSpectatedTigerPlayer
	ATigerPlayer* GetSpectatedTigerPlayer();                                                                                 // [0x16301a0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerWidget.GetScrollOffsetFromGamepadInput
	float GetScrollOffsetFromGamepadInput();                                                                                 // [0x1630170] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerWidget.GetRootWidget
	UWidget* GetRootWidget();                                                                                                // [0x1630140] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerWidget.GetPartyManager
	UTigerPartyManager* GetPartyManager();                                                                                   // [0x1630110] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerWidget.DecrementCollapseVisibility
	void DecrementCollapseVisibility();                                                                                      // [0x16300f0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerWidget.ConstructTooltipWidget
	UTigerTooltipWidget* ConstructTooltipWidget();                                                                           // [0x197e4f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Script/Tiger.TigerWidget.CallReleasedForAction
	void CallReleasedForAction(FName& InputAction);                                                                          // [0x162ff70] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Tiger.TigerWidget.CallPressedForAction
	void CallPressedForAction(FName& InputAction);                                                                           // [0x162fee0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Tiger.TigerWidget.AddTooltipInputListeners
	void AddTooltipInputListeners();                                                                                         // [0x162fe30] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerWidget.AddTooltipAction
	void AddTooltipAction(FTigerTooltipAction& NewTooltipAction, FDelegateProperty& OnPressed, FDelegateProperty& OnReleased); // [0x162fc50] Final|Native|Public|HasOutParms|BlueprintCallable 
};

/// Class /Script/Tiger.TigerArchetypeLevelWidget
/// Size: 0x0010 (0x000280 - 0x000290)
class UTigerArchetypeLevelWidget : public UTigerWidget
{ 
public:
	int32_t                                            ArchetypeLevel;                                             // 0x0280   (0x0004)  
	TWeakObjectPtr<ATigerPlayer*>                      RepresentedPlayer;                                          // 0x0284   (0x0008)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x028C   (0x0004)  MISSED


	/// Functions
	// Function /Script/Tiger.TigerArchetypeLevelWidget.UpdateArchetypeLevel
	void UpdateArchetypeLevel();                                                                                             // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Script/Tiger.TigerArchetypeLevelWidget.OnSelectedPerksUpdated
	void OnSelectedPerksUpdated();                                                                                           // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Script/Tiger.TigerArchetypeLevelWidget.OnSelectedCharacterChanged
	void OnSelectedCharacterChanged(UTigerPersistentPlayerState* InPersistentPlayerState);                                   // [0x148e480] Final|Native|Protected 
	// Function /Script/Tiger.TigerArchetypeLevelWidget.OnArchetypeChanged
	void OnArchetypeChanged(UTigerPlayerClanData* InClanData, UTigerPowerKit* InArchetypeData);                              // [0x148e070] Final|Native|Protected 
	// Function /Script/Tiger.TigerArchetypeLevelWidget.Init
	void Init(ATigerPlayer* InRepresentedPlayer);                                                                            // [0x148dfe0] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/Tiger.TigerArchetypeRewardData
/// Size: 0x00A0 (0x000030 - 0x0000D0)
class UTigerArchetypeRewardData : public UDataAsset
{ 
public:
	FTigerArchetype                                    Archetypes;                                                 // 0x0030   (0x00A0)  


	/// Functions
	// Function /Script/Tiger.TigerArchetypeRewardData.GetRewardsInLevelRange
	TArray<FTigerItemId> GetRewardsInLevelRange(ETigerPowerKitType InType, int32_t InLowerLevel, int32_t InUpperLevel);      // [0x148de80] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerArchetypeRewardData.GetRewardsBeforeLevel
	TArray<FTigerItemId> GetRewardsBeforeLevel(ETigerPowerKitType InType, int32_t InLevel);                                  // [0x148dd70] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerArchetypeRewardData.GetRewardsAfterLevel
	TArray<FTigerItemId> GetRewardsAfterLevel(ETigerPowerKitType InType, int32_t InLevel);                                   // [0x148dc60] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerArchetypeRewardData.GetRewards
	TArray<FTigerItemId> GetRewards(ETigerPowerKitType InType);                                                              // [0x148db80] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerArchetypeRewardData.GetRewardForLevel
	FTigerItemId GetRewardForLevel(ETigerPowerKitType InType, int32_t InLevel);                                              // [0x148daa0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerArchetypeRewardData.GetNextLevelReward
	bool GetNextLevelReward(ETigerPowerKitType InType, int32_t InLevel, FTigerArchetypeReward& OutArchetypeReward);          // [0x148d970] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerArchetypeRewardData.GetLevelRewards
	TArray<FTigerArchetypeReward> GetLevelRewards(ETigerPowerKitType InType);                                                // [0x148d890] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerArchetypeRewardData.GetFirstAndLastRewardLevels
	void GetFirstAndLastRewardLevels(ETigerPowerKitType InType, int32_t& OutFirstRewardLevel, int32_t& OutLastRewardLevel);  // [0x148d770] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerArchetypeRewardData.FindRewardUnlockLevel
	int32_t FindRewardUnlockLevel(ETigerPowerKitType InType, UTigerInventoryItemBase* InRewardItem);                         // [0x148d5c0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/Tiger.TigerMenuWidget
/// Size: 0x0018 (0x000280 - 0x000298)
class UTigerMenuWidget : public UTigerWidget
{ 
public:
	UTigerSharedMouseCursor*                           SharedMouseCursor;                                          // 0x0280   (0x0008)  
	bool                                               bStopPlayerInteractionsOnOpen;                              // 0x0288   (0x0001)  
	bool                                               bShouldShowMouseCursorOnOpenWithGamepad;                    // 0x0289   (0x0001)  
	unsigned char                                      UnknownData00_5[0x1];                                       // 0x028A   (0x0001)  MISSED
	bool                                               bShouldCloseOtherMenusOnOpen;                               // 0x028B   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x028C   (0x0002)  MISSED
	bool                                               bShouldThrottleFrameRate;                                   // 0x028E   (0x0001)  
	unsigned char                                      UnknownData02_6[0x9];                                       // 0x028F   (0x0009)  MISSED


	/// Functions
	// Function /Script/Tiger.TigerMenuWidget.TryMakeDateTime
	bool TryMakeDateTime(int32_t InYear, int32_t InMonth, int32_t InDay, FDateTime& OutDateTime);                            // [0x155f2f0] Final|Native|Protected|HasOutParms|HasDefaults|BlueprintCallable 
	// Function /Script/Tiger.TigerMenuWidget.Open
	void Open();                                                                                                             // [0x155f1d0] Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerMenuWidget.OnPersistentPlayerStateInitialized
	void OnPersistentPlayerStateInitialized(UTigerPersistentPlayerState* InPersistentPlayerState);                           // [0x155f0b0] Native|Event|Protected|BlueprintEvent 
	// Function /Script/Tiger.TigerMenuWidget.OnPersistentPlayerInitialized
	void OnPersistentPlayerInitialized(ATigerPlayerController* InPlayerController);                                          // [0x155f020] Final|Native|Protected 
	// Function /Script/Tiger.TigerMenuWidget.OnOpen
	void OnOpen();                                                                                                           // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Script/Tiger.TigerMenuWidget.OnClose
	void OnClose();                                                                                                          // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Script/Tiger.TigerMenuWidget.IsOpen
	bool IsOpen();                                                                                                           // [0x155eff0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerMenuWidget.Close
	void Close();                                                                                                            // [0x1549c60] Native|Public|BlueprintCallable 
};

/// Class /Script/Tiger.TigerIngameSubmenuWidget
/// Size: 0x0028 (0x000298 - 0x0002C0)
class UTigerIngameSubmenuWidget : public UTigerMenuWidget
{ 
public:
	FText                                              MenuName;                                                   // 0x0298   (0x0018)  
	UTigerIngameMenuWidget*                            MenuContainer;                                              // 0x02B0   (0x0008)  
	bool                                               InGameMenuEnabled;                                          // 0x02B8   (0x0001)  
	ETigerNewNotificationMenuOptions                   NewNotificationMenuOption;                                  // 0x02B9   (0x0001)  
	unsigned char                                      UnknownData00_6[0x6];                                       // 0x02BA   (0x0006)  MISSED


	/// Functions
	// Function /Script/Tiger.TigerIngameSubmenuWidget.UnregisterSharedInputs
	void UnregisterSharedInputs();                                                                                           // [0x197e4f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Script/Tiger.TigerIngameSubmenuWidget.RegisterSharedInputs
	void RegisterSharedInputs();                                                                                             // [0x197e4f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Script/Tiger.TigerIngameSubmenuWidget.GetIsTransitioning
	bool GetIsTransitioning();                                                                                               // [0x15295f0] Final|Native|Public  
};

/// Class /Script/Tiger.TigerSceneBackgroundUI
/// Size: 0x0100 (0x0002C0 - 0x0003C0)
class UTigerSceneBackgroundUI : public UTigerIngameSubmenuWidget
{ 
public:
	TWeakObjectPtr<UWorld*>                            DefaultSubLevel;                                            // 0x02C0   (0x0028)  
	unsigned char                                      UnknownData00_5[0x8];                                       // 0x02E8   (0x0008)  MISSED
	UTigerSubLevelList*                                SubLevelList;                                               // 0x02F0   (0x0008)  
	FName                                              DefaultCameraTag;                                           // 0x02F8   (0x0008)  
	FName                                              SpawnLocationTag;                                           // 0x0300   (0x0008)  
	FViewTargetTransitionParams                        CameraTransitionParams;                                     // 0x0308   (0x0010)  
	TWeakObjectPtr<UTigerItemPreviewAsset*>            ItemPreviews;                                               // 0x0318   (0x0028)  
	FName                                              ItemParentTag;                                              // 0x0340   (0x0008)  
	ATigerSingleChildActor*                            ItemParentActor;                                            // 0x0348   (0x0008)  
	TWeakObjectPtr<UClass*>                            CurrentPreviewItem;                                         // 0x0350   (0x0028)  
	TArray<ACineCameraActor*>                          CinematicCameras;                                           // 0x0378   (0x0010)  
	unsigned char                                      UnknownData01_5[0x20];                                      // 0x0388   (0x0020)  MISSED
	FMulticastInlineDelegate                           OnBackgroundShown;                                          // 0x03A8   (0x0010)  
	unsigned char                                      UnknownData02_6[0x8];                                       // 0x03B8   (0x0008)  MISSED


	/// Functions
	// Function /Script/Tiger.TigerSceneBackgroundUI.TransitionToCameraWithTag
	bool TransitionToCameraWithTag(FName& CameraTag, bool bUseCameraTransition);                                             // [0x15d7350] Final|Native|Protected|HasOutParms|BlueprintCallable 
	// Function /Script/Tiger.TigerSceneBackgroundUI.ShowDefaultBackgroundScene
	void ShowDefaultBackgroundScene();                                                                                       // [0x15d7330] Final|Native|Protected|BlueprintCallable 
	// Function /Script/Tiger.TigerSceneBackgroundUI.ShowBackgroundScene
	void ShowBackgroundScene(int32_t InSubLevelIndex);                                                                       // [0x15d72a0] Final|Native|Protected|BlueprintCallable 
	// Function /Script/Tiger.TigerSceneBackgroundUI.RetryPreviewItem
	void RetryPreviewItem();                                                                                                 // [0x15d7280] Final|Native|Protected 
	// Function /Script/Tiger.TigerSceneBackgroundUI.PreviewReward
	void PreviewReward(FTigerItemId ItemId);                                                                                 // [0x15d71f0] Final|Native|Protected|BlueprintCallable 
	// Function /Script/Tiger.TigerSceneBackgroundUI.PreviewItem
	void PreviewItem(TWeakObjectPtr<UClass*>& InItemClassPath);                                                              // [0x15d7130] Final|Native|Protected|HasOutParms|BlueprintCallable 
	// Function /Script/Tiger.TigerSceneBackgroundUI.OnPreviewItemUpdated
	void OnPreviewItemUpdated(UTigerInventoryItemBase* InPreviewItem, ATigerBattlepassRewardPreview* InPreviewActor, UTigerInventoryItemBase* InCombinedItemParent); // [0x197e4f0] Event|Protected|BlueprintCallable|BlueprintEvent 
	// Function /Script/Tiger.TigerSceneBackgroundUI.OnPreviewItemOpened
	void OnPreviewItemOpened();                                                                                              // [0x15d7080] Final|Native|Protected|BlueprintCallable 
	// Function /Script/Tiger.TigerSceneBackgroundUI.OnBackgroundSceneShownNative
	void OnBackgroundSceneShownNative();                                                                                     // [0x14e1610] Native|Protected     
	// Function /Script/Tiger.TigerSceneBackgroundUI.OnBackgroundSceneShown
	void OnBackgroundSceneShown();                                                                                           // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Script/Tiger.TigerSceneBackgroundUI.OnBackgroundSceneLoadedNative
	void OnBackgroundSceneLoadedNative();                                                                                    // [0x15d7060] Final|Native|Protected 
	// Function /Script/Tiger.TigerSceneBackgroundUI.HidePreviewItem
	void HidePreviewItem();                                                                                                  // [0x15d6f70] Final|Native|Protected|BlueprintCallable 
	// Function /Script/Tiger.TigerSceneBackgroundUI.GetCurrentPaperDollArray
	TArray<AActor*> GetCurrentPaperDollArray(FName InBattlePassSubLevelName);                                                // [0x15d6e60] Final|Native|Protected|BlueprintCallable 
};

/// Class /Script/Tiger.TigerArchetypeSelectElysiumUI
/// Size: 0x0020 (0x0003C0 - 0x0003E0)
class UTigerArchetypeSelectElysiumUI : public UTigerSceneBackgroundUI
{ 
public:
	TArray<FTigerPersistentPlayerCharacter>            PlayerCharacters;                                           // 0x03C0   (0x0010)  
	FTigerItemId                                       AdditionalCharacterSlotItem;                                // 0x03D0   (0x0008)  
	char                                               NumCharacterSlots;                                          // 0x03D8   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x03D9   (0x0007)  MISSED


	/// Functions
	// Function /Script/Tiger.TigerArchetypeSelectElysiumUI.SelectCharacter
	void SelectCharacter(FTigerPersistentCharacterID InCharacterId);                                                         // [0x148e5a0] Final|Native|Protected|BlueprintCallable 
	// Function /Script/Tiger.TigerArchetypeSelectElysiumUI.OnSelectedCharacterChanged
	void OnSelectedCharacterChanged(UTigerPersistentPlayerState* InPersistentPlayerState);                                   // [0x148e510] Final|Native|Protected 
	// Function /Script/Tiger.TigerArchetypeSelectElysiumUI.OnPlayerInventoryChanged
	void OnPlayerInventoryChanged(UTigerPersistentPlayerState* InPersistentPlayerState);                                     // [0x148e3f0] Final|Native|Protected 
	// Function /Script/Tiger.TigerArchetypeSelectElysiumUI.OnGotPlayerCharacters
	void OnGotPlayerCharacters(TArray<FTigerPersistentPlayerCharacter>& InCharacters, FString InErrorString);                // [0x148e290] Final|Native|Protected|HasOutParms 
	// Function /Script/Tiger.TigerArchetypeSelectElysiumUI.OnBuyCharacterSlotServerResponse
	void OnBuyCharacterSlotServerResponse(bool bInSuccess, FTigerItemId& InItemId, FString InErrorMessage);                  // [0x148e140] Final|Native|Protected|HasOutParms 
	// Function /Script/Tiger.TigerArchetypeSelectElysiumUI.OnBuyCharacterSlotResults
	void OnBuyCharacterSlotResults(bool bInSuccess, FString InErrorString);                                                  // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Script/Tiger.TigerArchetypeSelectElysiumUI.OnArchetypeChanged
	void OnArchetypeChanged(UTigerPowerKit* InArchetypeData, TArray<int32_t>& InPlayerArchetypeCharacterIndices);            // [0x197e4f0] Event|Protected|HasOutParms|BlueprintEvent 
	// Function /Script/Tiger.TigerArchetypeSelectElysiumUI.GetAdditionalSlotPrice
	FTigerItemIdWithPrice GetAdditionalSlotPrice();                                                                          // [0x148d690] Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerArchetypeSelectElysiumUI.CreateNewCharacter
	void CreateNewCharacter(UTigerPowerKit* InArchetypeData);                                                                // [0x148d530] Final|Native|Protected|BlueprintCallable 
	// Function /Script/Tiger.TigerArchetypeSelectElysiumUI.ChangeArchetype
	void ChangeArchetype(UTigerPowerKit* InArchetypeData);                                                                   // [0x148d4a0] Final|Native|Protected|BlueprintCallable 
	// Function /Script/Tiger.TigerArchetypeSelectElysiumUI.BuyAdditionalCharacterSlot
	void BuyAdditionalCharacterSlot();                                                                                       // [0x148d480] Final|Native|Protected|BlueprintCallable 
};

/// Class /Script/Tiger.TigerArchetypeSelectPragueUI
/// Size: 0x0078 (0x000298 - 0x000310)
class UTigerArchetypeSelectPragueUI : public UTigerMenuWidget
{ 
public:
	int32_t                                            GroupSize;                                                  // 0x0298   (0x0004)  
	int32_t                                            PreGameStateEndTime;                                        // 0x029C   (0x0004)  
	FString                                            PreHighlightTag;                                            // 0x02A0   (0x0010)  
	FName                                              CameraLevelName;                                            // 0x02B0   (0x0008)  
	float                                              TimeLeftUntilStateChange;                                   // 0x02B8   (0x0004)  
	ETigerArchetypeSelectUiState                       UiState;                                                    // 0x02BC   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x02BD   (0x0003)  MISSED
	TArray<FTigerPersistentPlayerCharacter>            PlayerCharacters;                                           // 0x02C0   (0x0010)  
	ETigerPowerKitType                                 SelectedArchetypeType;                                      // 0x02D0   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x02D1   (0x0007)  MISSED
	UTigerPreMatchPaperDollComponent*                  PreMatchPaperDollComp;                                      // 0x02D8   (0x0008)  
	unsigned char                                      UnknownData02_6[0x30];                                      // 0x02E0   (0x0030)  MISSED


	/// Functions
	// Function /Script/Tiger.TigerArchetypeSelectPragueUI.SelectCharacterForArchetype
	void SelectCharacterForArchetype(UTigerPowerKit* InArchetypeData);                                                       // [0x1492370] Final|Native|Protected|BlueprintCallable 
	// Function /Script/Tiger.TigerArchetypeSelectPragueUI.RevertLODBias
	void RevertLODBias();                                                                                                    // [0x1492350] Final|Native|Protected|BlueprintCallable 
	// Function /Script/Tiger.TigerArchetypeSelectPragueUI.OnUiStateChanged
	void OnUiStateChanged(ETigerArchetypeSelectUiState InPreviousUiState);                                                   // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Script/Tiger.TigerArchetypeSelectPragueUI.OnPlayerCharactersReceived
	void OnPlayerCharactersReceived(TArray<FTigerPersistentPlayerCharacter>& InCharacters, FString InErrorString);           // [0x1492090] Final|Native|Protected|HasOutParms 
	// Function /Script/Tiger.TigerArchetypeSelectPragueUI.OnPlayerChangedSelection
	void OnPlayerChangedSelection(ATigerPlayerState* InPlayerState);                                                         // [0x197e4f0] Event|Protected|BlueprintCallable|BlueprintEvent 
	// Function /Script/Tiger.TigerArchetypeSelectPragueUI.OnGroupMembersChanged
	void OnGroupMembersChanged(UTigerGroupStateComponent* InGroupStateComponent, TArray<ATigerPlayerState*>& InPreviousGroupMembers); // [0x197e4f0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Script/Tiger.TigerArchetypeSelectPragueUI.OnBackgroundLevelLoaded
	void OnBackgroundLevelLoaded();                                                                                          // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Script/Tiger.TigerArchetypeSelectPragueUI.OnArchetypeSelectionLocked
	void OnArchetypeSelectionLocked(ATigerPlayerState* InPlayerState, ETigerPowerKitType InArchetype);                       // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Script/Tiger.TigerArchetypeSelectPragueUI.HandleLevelVisibilityChanged
	void HandleLevelVisibilityChanged();                                                                                     // [0x1491e00] Final|Native|Protected 
	// Function /Script/Tiger.TigerArchetypeSelectPragueUI.GetSecondsLeftUntilPlayerSelection
	float GetSecondsLeftUntilPlayerSelection(ETigerArchetypeSelectUiState InPlayerUiState);                                  // [0x1491cc0] Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerArchetypeSelectPragueUI.EnablePaperDollHighlight
	void EnablePaperDollHighlight(ATigerPaperDoll* InPaperDoll, bool bInEnable);                                             // [0x1491a70] Final|Native|Protected|BlueprintCallable 
};

/// Class /Script/Tiger.TigerBuffInstance
/// Size: 0x0058 (0x000028 - 0x000080)
class UTigerBuffInstance : public UObject
{ 
public:
	FTigerBuffReplicatedInstanceData                   BuffReplicatedInstanceData;                                 // 0x0028   (0x0018)  
	TWeakObjectPtr<ATigerCharacter*>                   OwnerCharacter;                                             // 0x0040   (0x0008)  
	UTigerBuff*                                        Buff;                                                       // 0x0048   (0x0008)  
	unsigned char                                      UnknownData00_5[0x10];                                      // 0x0050   (0x0010)  MISSED
	UParticleSystemComponent*                          ActiveBuffParticles;                                        // 0x0060   (0x0008)  
	UNiagaraComponent*                                 ActiveNiagaraParticles;                                     // 0x0068   (0x0008)  
	TArray<UNiagaraComponent*>                         AdditionalActiveNiagaraParticles;                           // 0x0070   (0x0010)  


	/// Functions
	// Function /Script/Tiger.TigerBuffInstance.GetOwningCharacter
	ATigerCharacter* GetOwningCharacter();                                                                                   // [0x1496270] Final|Native|Protected|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerBuffInstance.GetActiveNiagaraParticles
	UNiagaraComponent* GetActiveNiagaraParticles();                                                                          // [0x1496030] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerBuffInstance.GetActiveBuffParticles
	UParticleSystemComponent* GetActiveBuffParticles();                                                                      // [0x1496010] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/Tiger.TigerAreaBuffInstance
/// Size: 0x0008 (0x000080 - 0x000088)
class UTigerAreaBuffInstance : public UTigerBuffInstance
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0080   (0x0008)  MISSED
};

/// Class /Script/Tiger.TigerAreaBuff
/// Size: 0x0000 (0x000268 - 0x000268)
class UTigerAreaBuff : public UTigerBuff
{ 
public:
};

/// Class /Script/Tiger.TigerAreaEffect
/// Size: 0x02D0 (0x000228 - 0x0004F8)
class ATigerAreaEffect : public AActor
{ 
public:
	UParticleSystem*                                   StartParticleType;                                          // 0x0228   (0x0008)  
	UParticleSystem*                                   LoopedParticleType;                                         // 0x0230   (0x0008)  
	UParticleSystem*                                   EndParticleType;                                            // 0x0238   (0x0008)  
	UClass*                                            DamageType;                                                 // 0x0240   (0x0008)  
	ETigerDamageCauser                                 DamageCauserType;                                           // 0x0248   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0249   (0x0007)  MISSED
	FRuntimeFloatCurve                                 TimeDamageModifierCurve;                                    // 0x0250   (0x0088)  
	FRuntimeFloatCurve                                 RangeDamageModifierCurve;                                   // 0x02D8   (0x0088)  
	FRuntimeFloatCurve                                 TimeHealingModifierCurve;                                   // 0x0360   (0x0088)  
	FRuntimeFloatCurve                                 RangeHealingModifierCurve;                                  // 0x03E8   (0x0088)  
	USphereComponent*                                  CollisionSphere;                                            // 0x0470   (0x0008)  
	float                                              Range;                                                      // 0x0478   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x047C   (0x0004)  MISSED
	UClass*                                            DamageBuff;                                                 // 0x0480   (0x0008)  
	float                                              InitialDamageAmount;                                        // 0x0488   (0x0004)  
	float                                              DamageAmount;                                               // 0x048C   (0x0004)  
	UClass*                                            HealBuff;                                                   // 0x0490   (0x0008)  
	float                                              InitialHealAmount;                                          // 0x0498   (0x0004)  
	float                                              HealAmount;                                                 // 0x049C   (0x0004)  
	float                                              TickRate;                                                   // 0x04A0   (0x0004)  
	float                                              Duration;                                                   // 0x04A4   (0x0004)  
	float                                              Delay;                                                      // 0x04A8   (0x0004)  
	float                                              CullDistanceInGunRange;                                     // 0x04AC   (0x0004)  
	bool                                               bShouldAffectCivilians;                                     // 0x04B0   (0x0001)  
	bool                                               bSkipLineTrace;                                             // 0x04B1   (0x0001)  
	unsigned char                                      UnknownData02_5[0x6];                                       // 0x04B2   (0x0006)  MISSED
	UParticleSystemComponent*                          LoopedParticleComponent;                                    // 0x04B8   (0x0008)  
	unsigned char                                      UnknownData03_5[0xD];                                       // 0x04C0   (0x000D)  MISSED
	bool                                               bCreatedInGunRange;                                         // 0x04CD   (0x0001)  
	unsigned char                                      UnknownData04_5[0x12];                                      // 0x04CE   (0x0012)  MISSED
	FTigerDamageContext                                DamageContext;                                              // 0x04E0   (0x0018)  


	/// Functions
	// Function /Script/Tiger.TigerAreaEffect.Trigger
	void Trigger();                                                                                                          // [0x1492400] Final|Native|Public  
	// Function /Script/Tiger.TigerAreaEffect.OnVehicleHit
	void OnVehicleHit(AActor* InActor);                                                                                      // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Script/Tiger.TigerAreaEffect.OnTriggerClient
	void OnTriggerClient();                                                                                                  // [0x197e4f0] Event|Public|BlueprintEvent 
};

/// Class /Script/Tiger.TigerAreaEffectSubsystem
/// Size: 0x0010 (0x000030 - 0x000040)
class UTigerAreaEffectSubsystem : public UWorldSubsystem
{ 
public:
	TArray<ATigerAreaEffect*>                          AreaEffects;                                                // 0x0030   (0x0010)  
};

/// Class /Script/Tiger.TigerArena
/// Size: 0x0000 (0x000028 - 0x000028)
class UTigerArena : public UObject
{ 
public:
};

/// Class /Script/Tiger.TigerArtifactComponent
/// Size: 0x0038 (0x0000B0 - 0x0000E8)
class UTigerArtifactComponent : public UActorComponent
{ 
public:
	FTigerSightConfigProperties                        UnseenOverrideSightProperties;                              // 0x00B0   (0x001C)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x00CC   (0x0004)  MISSED
	UClass*                                            UnseenBuffType;                                             // 0x00D0   (0x0008)  
	float                                              ActionlessTimeUntilUnseen;                                  // 0x00D8   (0x0004)  
	unsigned char                                      UnknownData01_6[0xC];                                       // 0x00DC   (0x000C)  MISSED


	/// Functions
	// Function /Script/Tiger.TigerArtifactComponent.OnCharacterAction
	void OnCharacterAction(ETigerCharacterAction InAction);                                                                  // [0x1492010] Final|Native|Private 
};

/// Class /Script/Tiger.TigerSimpleTextPrompt
/// Size: 0x0028 (0x000280 - 0x0002A8)
class UTigerSimpleTextPrompt : public UTigerWidget
{ 
public:
	FText                                              DisplayText;                                                // 0x0280   (0x0018)  
	float                                              PromptLifetimeFailsafe;                                     // 0x0298   (0x0004)  
	bool                                               bIsVisible;                                                 // 0x029C   (0x0001)  
	unsigned char                                      UnknownData00_6[0xB];                                       // 0x029D   (0x000B)  MISSED


	/// Functions
	// Function /Script/Tiger.TigerSimpleTextPrompt.SetText
	void SetText(FText Text);                                                                                                // [0x15e0190] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerSimpleTextPrompt.OnShowPrompt
	void OnShowPrompt();                                                                                                     // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Script/Tiger.TigerSimpleTextPrompt.OnHidePrompt
	void OnHidePrompt();                                                                                                     // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Script/Tiger.TigerSimpleTextPrompt.Hide
	void Hide();                                                                                                             // [0x15dfb10] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerSimpleTextPrompt.FailsafeHide
	void FailsafeHide();                                                                                                     // [0x15df980] Final|Native|Private 
	// Function /Script/Tiger.TigerSimpleTextPrompt.CanBeShown
	bool CanBeShown();                                                                                                       // [0x15df870] Native|Event|Public|BlueprintEvent|Const 
};

/// Class /Script/Tiger.TigerArtifactPickedupPrompt
/// Size: 0x0008 (0x0002A8 - 0x0002B0)
class UTigerArtifactPickedupPrompt : public UTigerSimpleTextPrompt
{ 
public:
	UTigerArtifactAsset*                               ArtifactAsset;                                              // 0x02A8   (0x0008)  


	/// Functions
	// Function /Script/Tiger.TigerArtifactPickedupPrompt.OnArtifactAssetSet
	void OnArtifactAssetSet(UTigerArtifactAsset* InArtifactAsset);                                                           // [0x197e4f0] Event|Public|BlueprintEvent 
};

/// Class /Script/Tiger.TigerAssistPromptUi
/// Size: 0x00D8 (0x0002A8 - 0x000380)
class UTigerAssistPromptUi : public UTigerSimpleTextPrompt
{ 
public:
	FTigerPlayerStateGameData                          PlayerStateData;                                            // 0x02A8   (0x00D0)  
	int32_t                                            ExperienceGained;                                           // 0x0378   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x037C   (0x0004)  MISSED
};

/// Class /Script/Tiger.TigerAsyncChooseNextWaypoint
/// Size: 0x0088 (0x000070 - 0x0000F8)
class UTigerAsyncChooseNextWaypoint : public UBTTaskNode
{ 
public:
	FBlackboardKeySelector                             Index;                                                      // 0x0070   (0x0028)  
	FBlackboardKeySelector                             Waypoint;                                                   // 0x0098   (0x0028)  
	FBlackboardKeySelector                             bWaypointDirectionIsForward;                                // 0x00C0   (0x0028)  
	unsigned char                                      UnknownData00_6[0x10];                                      // 0x00E8   (0x0010)  MISSED
};

/// Class /Script/Tiger.TigerAudioVisualizationSpawnerComponent
/// Size: 0x0028 (0x0000B0 - 0x0000D8)
class UTigerAudioVisualizationSpawnerComponent : public UActorComponent
{ 
public:
	UParticleSystem*                                   ParticleSystemToSpawn;                                      // 0x00B0   (0x0008)  
	int32_t                                            MaxSimultaneousVisualizations;                              // 0x00B8   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x00BC   (0x0004)  MISSED
	TArray<FTigerHeightenedSensesAudioVisualization>   ActiveVisualizations;                                       // 0x00C0   (0x0010)  
	unsigned char                                      UnknownData01_6[0x8];                                       // 0x00D0   (0x0008)  MISSED


	/// Functions
	// Function /Script/Tiger.TigerAudioVisualizationSpawnerComponent.VisualizeAudioEvent
	void VisualizeAudioEvent(FVector InLocation, bool InShowOnlyInHeightenedSenses);                                         // [0x1492420] Final|Native|Public|HasDefaults|BlueprintCallable 
};

/// Class /Script/Tiger.TigerAuthenticationManager
/// Size: 0x0160 (0x000038 - 0x000198)
class UTigerAuthenticationManager : public UTigerAuthenticationManagerBase
{ 
public:
	unsigned char                                      UnknownData00_2[0x38];                                      // 0x0038   (0x0038)  MISSED
	bool                                               bEnableSharkmobAccountLogin;                                // 0x0070   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x0071   (0x0007)  MISSED
	UTigerGameInstance*                                GameInstance;                                               // 0x0078   (0x0008)  
	unsigned char                                      UnknownData02_6[0x118];                                     // 0x0080   (0x0118)  MISSED


	/// Functions
	// Function /Script/Tiger.TigerAuthenticationManager.IsSharkmobAccountLoginsEnabled
	bool IsSharkmobAccountLoginsEnabled();                                                                                   // [0x1491e20] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerAuthenticationManager.GetUserLocation
	FString GetUserLocation();                                                                                               // [0x1491d80] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerAuthenticationManager.GetAuthenticatedChannel
	EShAccountChannel GetAuthenticatedChannel();                                                                             // [0x1491b40] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/Tiger.TigerAutoScrollBox
/// Size: 0x0020 (0x000880 - 0x0008A0)
class UTigerAutoScrollBox : public UScrollBox
{ 
public:
	unsigned char                                      UnknownData00_2[0x8];                                       // 0x0880   (0x0008)  MISSED
	bool                                               ResetScrollOnEnd;                                           // 0x0888   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0889   (0x0003)  MISSED
	float                                              ScrollSpeed;                                                // 0x088C   (0x0004)  
	float                                              WaitDurationBeforeScroll;                                   // 0x0890   (0x0004)  
	float                                              WaitDurationAfterScroll;                                    // 0x0894   (0x0004)  
	unsigned char                                      UnknownData02_6[0x8];                                       // 0x0898   (0x0008)  MISSED
};

/// Class /Script/Tiger.TigerBalconyVolumeDefaultValues
/// Size: 0x0010 (0x000030 - 0x000040)
class UTigerBalconyVolumeDefaultValues : public UDataAsset
{ 
public:
	TArray<FTigerBuildingSystemBalconyVolumeDefaults>  DefaultBalconyVolumeSets;                                   // 0x0030   (0x0010)  
};

/// Class /Script/Tiger.TigerNPCFacePoseMap
/// Size: 0x0010 (0x000028 - 0x000038)
class UTigerNPCFacePoseMap : public UObject
{ 
public:
	TArray<FTigerFacePoseData>                         HeadMeshsPoseAssets;                                        // 0x0028   (0x0010)  
};

/// Class /Script/Tiger.TigerCharacter
/// Size: 0x03B0 (0x0004C0 - 0x000870)
class ATigerCharacter : public ACharacter
{ 
public:
	UTigerCharacterMeshManager*                        MeshManager;                                                // 0x04C0   (0x0008)  
	UTigerRangedWeaponComponent*                       RangedWeaponComponent;                                      // 0x04C8   (0x0008)  
	UTigerMeleeWeaponComponent*                        MeleeWeaponComponent;                                       // 0x04D0   (0x0008)  
	UTigerCombatComponent*                             CombatComponent;                                            // 0x04D8   (0x0008)  
	UTigerFeedingComponent*                            FeedingComponent;                                           // 0x04E0   (0x0008)  
	UTigerBuffComponent*                               BuffComponent;                                              // 0x04E8   (0x0008)  
	UTigerOutlineComponent*                            OutlineComponent;                                           // 0x04F0   (0x0008)  
	UAkComponent*                                      AudioComponent;                                             // 0x04F8   (0x0008)  
	UAkComponent*                                      NonOccludedAudioComponent;                                  // 0x0500   (0x0008)  
	USceneComponent*                                   AdditionalMeshes;                                           // 0x0508   (0x0008)  
	USkeletalMeshComponentBudgeted*                    HeadMesh;                                                   // 0x0510   (0x0008)  
	USkeletalMeshComponentBudgeted*                    HoodieMesh;                                                 // 0x0518   (0x0008)  
	USkeletalMeshComponentBudgeted*                    HairMesh;                                                   // 0x0520   (0x0008)  
	USkeletalMeshComponentBudgeted*                    HeadgearMesh;                                               // 0x0528   (0x0008)  
	USkeletalMeshComponentBudgeted*                    EyewearMesh;                                                // 0x0530   (0x0008)  
	USkeletalMeshComponentBudgeted*                    BodyAdditionalMesh;                                         // 0x0538   (0x0008)  
	unsigned char                                      UnknownData00_5[0x20];                                      // 0x0540   (0x0020)  MISSED
	FMulticastInlineDelegate                           OnCharacterAction;                                          // 0x0560   (0x0010)  
	FMulticastInlineDelegate                           OnDamageMitigated;                                          // 0x0570   (0x0010)  
	FMulticastInlineDelegate                           OnDefeated;                                                 // 0x0580   (0x0010)  
	unsigned char                                      UnknownData01_5[0x10];                                      // 0x0590   (0x0010)  MISSED
	bool                                               bIsRootMotionDisabled;                                      // 0x05A0   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x05A1   (0x0003)  MISSED
	float                                              BaseMaxHealth;                                              // 0x05A4   (0x0004)  
	USkeletalMeshComponent*                            ThirdPersonWeaponMeshRef;                                   // 0x05A8   (0x0008)  
	USkeletalMeshComponent*                            SecondaryWeaponMeshRef;                                     // 0x05B0   (0x0008)  
	USceneComponent*                                   ProjectileSpawnRef;                                         // 0x05B8   (0x0008)  
	USceneComponent*                                   SecondaryProjectileSpawnRef;                                // 0x05C0   (0x0008)  
	FTigerCharacterStatModification                    BaseCharacterStats;                                         // 0x05C8   (0x00A8)  
	FTigerReplicatedCharacterStats                     ReplicatedCharacterStats;                                   // 0x0670   (0x0018)  
	unsigned char                                      UnknownData03_5[0x90];                                      // 0x0688   (0x0090)  MISSED
	bool                                               bBlueprintReferencesSetup;                                  // 0x0718   (0x0001)  
	unsigned char                                      UnknownData04_5[0x7];                                       // 0x0719   (0x0007)  MISSED
	FMulticastInlineDelegate                           OnCharacterDeath;                                           // 0x0720   (0x0010)  
	unsigned char                                      UnknownData05_5[0x30];                                      // 0x0730   (0x0030)  MISSED
	float                                              CurrentHealth;                                              // 0x0760   (0x0004)  
	unsigned char                                      UnknownData06_5[0x4];                                       // 0x0764   (0x0004)  MISSED
	FMulticastInlineDelegate                           OnMaxShieldReplicated;                                      // 0x0768   (0x0010)  
	uint16_t                                           MaxShield;                                                  // 0x0778   (0x0002)  
	int16_t                                            MaxAttainableShield;                                        // 0x077A   (0x0002)  
	uint16_t                                           CurrentShield;                                              // 0x077C   (0x0002)  
	unsigned char                                      UnknownData07_5[0x2];                                       // 0x077E   (0x0002)  MISSED
	float                                              LowHealthThreshold;                                         // 0x0780   (0x0004)  
	unsigned char                                      UnknownData08_5[0x4];                                       // 0x0784   (0x0004)  MISSED
	float                                              HitAnimationInterval;                                       // 0x0788   (0x0004)  
	unsigned char                                      UnknownData09_5[0xC];                                       // 0x078C   (0x000C)  MISSED
	FVector                                            HealthBarOffset;                                            // 0x0798   (0x000C)  
	ETigerGender                                       BodyType;                                                   // 0x07A4   (0x0001)  
	bool                                               bIsKindred;                                                 // 0x07A5   (0x0001)  
	ETigerCharacterType                                CharacterType;                                              // 0x07A6   (0x0001)  
	unsigned char                                      UnknownData10_5[0x1];                                       // 0x07A7   (0x0001)  MISSED
	FName                                              RangedHitAnimationListName;                                 // 0x07A8   (0x0008)  
	FName                                              MeleeHitAnimationListName;                                  // 0x07B0   (0x0008)  
	UPhysicsAsset*                                     HitboxPhysicsAsset;                                         // 0x07B8   (0x0008)  
	UPhysicsAsset*                                     RagdollPhysicsAsset;                                        // 0x07C0   (0x0008)  
	unsigned char                                      UnknownData11_5[0x10];                                      // 0x07C8   (0x0010)  MISSED
	FTimerHandle                                       RagdollTimer;                                               // 0x07D8   (0x0008)  
	UAnimMontage*                                      TimedMontageLoop;                                           // 0x07E0   (0x0008)  
	FTimerHandle                                       TimedMontageLoopTimer;                                      // 0x07E8   (0x0008)  
	unsigned char                                      UnknownData12_5[0x10];                                      // 0x07F0   (0x0010)  MISSED
	TArray<TWeakObjectPtr>                             CharmedByCharacters;                                        // 0x0800   (0x0010)  
	bool                                               bIsDodging;                                                 // 0x0810   (0x0001)  
	unsigned char                                      UnknownData13_5[0x7];                                       // 0x0811   (0x0007)  MISSED
	float                                              SmoothYawInterpSpeed;                                       // 0x0818   (0x0004)  
	unsigned char                                      UnknownData14_5[0xC];                                       // 0x081C   (0x000C)  MISSED
	UWidgetComponent*                                  HealthBarComponent;                                         // 0x0828   (0x0008)  
	USkeletalMeshSocket*                               WidgetSocket;                                               // 0x0830   (0x0008)  
	unsigned char                                      UnknownData15_6[0x38];                                      // 0x0838   (0x0038)  MISSED


	/// Functions
	// Function /Script/Tiger.TigerCharacter.TriggerLimitedHitAnimation
	void TriggerLimitedHitAnimation(bool bIsRangedHit);                                                                      // [0x14b0a50] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerCharacter.TriggerHitAnimation
	float TriggerHitAnimation(bool bInIsRangedHit);                                                                          // [0x14b09b0] Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerCharacter.TriggerAnimationByName
	float TriggerAnimationByName(FName AnimationMontageName, float PlayRate);                                                // [0x14b08e0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerCharacter.TigerOnMaxShieldReplicated__DelegateSignature
	void TigerOnMaxShieldReplicated__DelegateSignature();                                                                    // [0x197e4f0] MulticastDelegate|Public|Delegate 
	// Function /Script/Tiger.TigerCharacter.TigerOnDefeated__DelegateSignature
	void TigerOnDefeated__DelegateSignature(AController* InInstigatorController);                                            // [0x197e4f0] MulticastDelegate|Public|Delegate 
	// Function /Script/Tiger.TigerCharacter.TigerOnDamageMitigated__DelegateSignature
	void TigerOnDamageMitigated__DelegateSignature(float InTotalDamage, float InDamageMitigated);                            // [0x197e4f0] MulticastDelegate|Public|Delegate 
	// Function /Script/Tiger.TigerCharacter.TigerOnCrouchStateUpdated__DelegateSignature
	void TigerOnCrouchStateUpdated__DelegateSignature(bool bInIsCrouched);                                                   // [0x197e4f0] MulticastDelegate|Public|Delegate 
	// Function /Script/Tiger.TigerCharacter.TigerOnCharacterDeath__DelegateSignature
	void TigerOnCharacterDeath__DelegateSignature();                                                                         // [0x197e4f0] MulticastDelegate|Public|Delegate 
	// Function /Script/Tiger.TigerCharacter.TigerOnCharacterAction__DelegateSignature
	void TigerOnCharacterAction__DelegateSignature(ETigerCharacterAction InCharacterAction);                                 // [0x197e4f0] MulticastDelegate|Public|Delegate 
	// Function /Script/Tiger.TigerCharacter.SpawnBloodDecal
	void SpawnBloodDecal();                                                                                                  // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Script/Tiger.TigerCharacter.ShouldHealthbarBeVisible
	bool ShouldHealthbarBeVisible();                                                                                         // [0x14b08b0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerCharacter.SetClanSwitch
	void SetClanSwitch(ETigerClan InTigerClan);                                                                              // [0x14b0830] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerCharacter.SetBaseMaxHealth
	void SetBaseMaxHealth(float NewMaxHealth);                                                                               // [0x14b07b0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerCharacter.ReportCharacterAction
	void ReportCharacterAction(ETigerCharacterAction Action);                                                                // [0x14b0730] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerCharacter.RefreshCharacterStats
	void RefreshCharacterStats();                                                                                            // [0x14b0710] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerCharacter.PostAkEvent
	int32_t PostAkEvent(UAkAudioEvent* AudioEvent, bool bEnableOcclusion);                                                   // [0x14b0640] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerCharacter.OnWeaponVisualChangedEvent
	void OnWeaponVisualChangedEvent();                                                                                       // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Script/Tiger.TigerCharacter.OnWeaponFired
	void OnWeaponFired(bool bSecondaryWeaponFired);                                                                          // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Script/Tiger.TigerCharacter.OnShowDamageAmount
	void OnShowDamageAmount(FVector& InHitLocation, FLinearColor& InDamageColor, int32_t InTotalDamageAmount, int32_t InHealthDamageAmount, bool bInHasExtraHealth, bool bInHasShield, float InRangedDamageFalloffPercent); // [0x197e4f0] Event|Public|HasOutParms|HasDefaults|BlueprintEvent 
	// Function /Script/Tiger.TigerCharacter.OnRep_MaxShieldChanged
	void OnRep_MaxShieldChanged(uint16_t InOldMaxShield);                                                                    // [0x14b0330] Final|Native|Protected 
	// Function /Script/Tiger.TigerCharacter.OnRep_CurrentShieldChanged
	void OnRep_CurrentShieldChanged();                                                                                       // [0x14b0310] Final|Native|Protected 
	// Function /Script/Tiger.TigerCharacter.OnRep_CurrentHealth
	void OnRep_CurrentHealth(float InOldHealth);                                                                             // [0x14b0280] Native|Protected     
	// Function /Script/Tiger.TigerCharacter.OnPlayMeleeHitEffects
	void OnPlayMeleeHitEffects(UTigerMeleeWeapon* WeaponHitBy, FVector& ImpactLocation, FVector& HitDirection);              // [0x197e4f0] Event|Public|HasOutParms|HasDefaults|BlueprintEvent 
	// Function /Script/Tiger.TigerCharacter.OnLocalDisciplineUseFailed
	void OnLocalDisciplineUseFailed(FDisciplineUse& DisciplineUse);                                                          // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Script/Tiger.TigerCharacter.OnLocalDisciplineUse
	void OnLocalDisciplineUse(FDisciplineUse& DisciplineUse, float ExpectedDuration);                                        // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Script/Tiger.TigerCharacter.OnLocalDisciplineReleaseFailed
	void OnLocalDisciplineReleaseFailed(FDisciplineUse& DisciplineUse);                                                      // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Script/Tiger.TigerCharacter.OnLocalDisciplineRelease
	void OnLocalDisciplineRelease(FDisciplineUse& DisciplineUse, float ExpectedDuration);                                    // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Script/Tiger.TigerCharacter.OnDodged
	void OnDodged(bool IsControllingPlayer, bool bLaunchedInAir, FVector LaunchDirection, char DodgeStage);                  // [0x197e4f0] Event|Protected|HasDefaults|BlueprintEvent 
	// Function /Script/Tiger.TigerCharacter.OnDisciplineUseSucceeded
	void OnDisciplineUseSucceeded(FDisciplineUse& DisciplineUse);                                                            // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Script/Tiger.TigerCharacter.OnDisciplineReleaseSucceeded
	void OnDisciplineReleaseSucceeded(FDisciplineUse& DisciplineUse);                                                        // [0x197e4f0] Event|Public|HasOutParms|BlueprintEvent 
	// Function /Script/Tiger.TigerCharacter.Multicast_SetRagdollDeath
	void Multicast_SetRagdollDeath(bool bEnableRagdoll);                                                                     // [0x14afc40] Net|Native|Event|NetMulticast|Public 
	// Function /Script/Tiger.TigerCharacter.Multicast_PostAkEvent
	void Multicast_PostAkEvent(UAkAudioEvent* AudioEvent, bool bSkipLocallyControlled);                                      // [0x14afb70] Net|Native|Event|NetMulticast|Public 
	// Function /Script/Tiger.TigerCharacter.Multicast_PlaySoundAtActorLocation
	void Multicast_PlaySoundAtActorLocation(USoundBase* SoundBase);                                                          // [0x14afae0] Net|Native|Event|NetMulticast|Public 
	// Function /Script/Tiger.TigerCharacter.Multicast_PlayAnimationBroadcastUnreliable
	void Multicast_PlayAnimationBroadcastUnreliable(UAnimMontage* Animation, bool bSkipLocallyControlled);                   // [0x14afa10] Net|Native|Event|NetMulticast|Public 
	// Function /Script/Tiger.TigerCharacter.Multicast_PlayAnimationBroadcast
	void Multicast_PlayAnimationBroadcast(UAnimMontage* Animation, bool bSkipLocallyControlled);                             // [0x14af940] Net|NetReliableNative|Event|NetMulticast|Public 
	// Function /Script/Tiger.TigerCharacter.Multicast_OnJumped
	void Multicast_OnJumped(int32_t InJumpCount);                                                                            // [0x14af8b0] Net|NetReliableNative|Event|NetMulticast|Protected 
	// Function /Script/Tiger.TigerCharacter.Multicast_OnDefeated
	void Multicast_OnDefeated(AController* InInstigatorController);                                                          // [0x14af820] Net|NetReliableNative|Event|NetMulticast|Public 
	// Function /Script/Tiger.TigerCharacter.Multicast_ApplyEffectWithTarget
	void Multicast_ApplyEffectWithTarget(UClass* Effect, ATigerCharacter* Target);                                           // [0x14af750] Net|Native|Event|NetMulticast|Protected 
	// Function /Script/Tiger.TigerCharacter.Multicast_ApplyEffectWithSocket
	void Multicast_ApplyEffectWithSocket(UClass* Effect, FName SocketName);                                                  // [0x14af680] Net|Native|Event|NetMulticast|Protected 
	// Function /Script/Tiger.TigerCharacter.Multicast_ApplyEffect
	void Multicast_ApplyEffect(UClass* Effect);                                                                              // [0x14af5f0] Net|Native|Event|NetMulticast|Protected 
	// Function /Script/Tiger.TigerCharacter.Multicast_AbortAnimationBroadcastUnreliable
	void Multicast_AbortAnimationBroadcastUnreliable(UAnimMontage* Animation, bool bSkipLocallyControlled);                  // [0x14af520] Net|Native|Event|NetMulticast|Public 
	// Function /Script/Tiger.TigerCharacter.Multicast_AbortAnimationBroadcast
	void Multicast_AbortAnimationBroadcast(UAnimMontage* Animation, bool bSkipLocallyControlled);                            // [0x14af450] Net|NetReliableNative|Event|NetMulticast|Public 
	// Function /Script/Tiger.TigerCharacter.LocalApplyEffectWithTarget
	void LocalApplyEffectWithTarget(UClass* Effect, ATigerCharacter* Target);                                                // [0x14af380] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerCharacter.LocalApplyEffectWithSocket
	void LocalApplyEffectWithSocket(UClass* Effect, FName SocketName);                                                       // [0x14af2b0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerCharacter.LocalApplyEffect
	void LocalApplyEffect(UClass* Effect);                                                                                   // [0x14af220] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerCharacter.IsSprinting
	bool IsSprinting();                                                                                                      // [0x14af1f0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerCharacter.IsSimulatedProxy
	bool IsSimulatedProxy();                                                                                                 // [0x14af1c0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerCharacter.IsPlayingAnimationMontage
	bool IsPlayingAnimationMontage();                                                                                        // [0x14af190] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerCharacter.IsInvulnerable
	bool IsInvulnerable();                                                                                                   // [0x14af160] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerCharacter.IsInJump
	bool IsInJump();                                                                                                         // [0x14af130] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerCharacter.IsInAir
	bool IsInAir();                                                                                                          // [0x14af100] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerCharacter.IsFriendlyWith
	bool IsFriendlyWith(ATigerCharacter* OtherCharacter);                                                                    // [0x14af060] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerCharacter.IsDowned
	bool IsDowned();                                                                                                         // [0x14af030] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerCharacter.IsDead
	bool IsDead();                                                                                                           // [0x14af000] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerCharacter.IsClimbing
	bool IsClimbing();                                                                                                       // [0x14aefd0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerCharacter.IsCharacterVisible
	bool IsCharacterVisible();                                                                                               // [0x14aefb0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerCharacter.IsBelowLowHealthThreshold
	bool IsBelowLowHealthThreshold(float InHealthOffset);                                                                    // [0x14aef20] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerCharacter.GetTigerCharacterMovement
	UTigerCharacterMovementComponent* GetTigerCharacterMovement();                                                           // [0x14ae230] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerCharacter.GetTigerAnimInstance
	UTigerAnimInstance* GetTigerAnimInstance();                                                                              // [0x14ae200] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerCharacter.GetSmoothYaw
	float GetSmoothYaw();                                                                                                    // [0x14ae1d0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerCharacter.GetShieldFull
	bool GetShieldFull();                                                                                                    // [0x14ae1a0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerCharacter.GetReplicatedStats
	FTigerReplicatedCharacterStats GetReplicatedStats();                                                                     // [0x14ae160] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerCharacter.GetPlayerHostilityStatus
	ETigerHostilityStatus GetPlayerHostilityStatus(ATigerCharacter* InOtherCharacter);                                       // [0x14ae0c0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerCharacter.GetNonReplicatedStats
	FTigerNonReplicatedCharacterStats GetNonReplicatedStats();                                                               // [0x14ae040] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerCharacter.GetMaxShield
	float GetMaxShield();                                                                                                    // [0x14ae010] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerCharacter.GetMaxHealth
	float GetMaxHealth();                                                                                                    // [0x14adfd0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerCharacter.GetHeartVisibility
	float GetHeartVisibility();                                                                                              // [0x14adfb0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerCharacter.GetCurrentShield
	float GetCurrentShield();                                                                                                // [0x14adf80] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerCharacter.GetCurrentHealthPercentage
	float GetCurrentHealthPercentage();                                                                                      // [0x14adf50] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerCharacter.GetCurrentHealth
	float GetCurrentHealth();                                                                                                // [0x14adf20] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerCharacter.GetBaseMaxHealth
	float GetBaseMaxHealth();                                                                                                // [0x14adef0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerCharacter.GetAkCharacterAlignment
	ETigerCharacterAkAlignmentType GetAkCharacterAlignment();                                                                // [0x14adec0] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerCharacter.GetAimRotation
	FRotator GetAimRotation();                                                                                               // [0x14ade80] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerCharacter.GetAimAnglePitch
	float GetAimAnglePitch();                                                                                                // [0x14ade50] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerCharacter.ChangeHealth
	float ChangeHealth(float InHealAmount, ATigerCharacter* InInstigator, bool bInOnlyHealRecentDamage);                     // [0x14add30] Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerCharacter.CanBleed
	bool CanBleed();                                                                                                         // [0x14add00] Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerCharacter.CalculateCharacterStats
	void CalculateCharacterStats(FTigerCharacterStatModification& AccumulatedStats);                                         // [0x14adc60] Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerCharacter.AuthorityApplyEffectWithTarget
	void AuthorityApplyEffectWithTarget(UClass* Effect, ATigerCharacter* Target);                                            // [0x14adb90] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerCharacter.AuthorityApplyEffectWithSocket
	void AuthorityApplyEffectWithSocket(UClass* Effect, FName SocketName);                                                   // [0x14adac0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerCharacter.AuthorityApplyEffect
	void AuthorityApplyEffect(UClass* Effect);                                                                               // [0x14ada30] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerCharacter.AbortAnimationByName
	void AbortAnimationByName(FName InAnimationMontageName, float InBlendOutTime, bool bInStopAllIfNullMontage);             // [0x14ad910] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerCharacter.AbortAnimation
	void AbortAnimation(UAnimMontage* InAnimationMontage, float InBlendOutTime, bool bInStopAllIfNullMontage);               // [0x14ad7f0] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/Tiger.TigerBaseNPC
/// Size: 0x0160 (0x000870 - 0x0009D0)
class ATigerBaseNPC : public ATigerCharacter
{ 
public:
	unsigned char                                      UnknownData00_2[0x10];                                      // 0x0870   (0x0010)  MISSED
	UTigerHSensesTargetComponent*                      HeightenedSensesTargetComponent;                            // 0x0880   (0x0008)  
	UTigerNPCAsset*                                    NPCAsset;                                                   // 0x0888   (0x0008)  
	UTigerBloodPotencyComponent*                       BloodPotencyComponent;                                      // 0x0890   (0x0008)  
	UTigerNPCVisualAsset*                              VisualAsset;                                                // 0x0898   (0x0008)  
	UTigerNpcPropAsset*                                PropAsset;                                                  // 0x08A0   (0x0008)  
	UClass*                                            MasqueradeActionResponse;                                   // 0x08A8   (0x0008)  
	UClass*                                            HeadMeshsPoseAssetsClass;                                   // 0x08B0   (0x0008)  
	ETigerNPCType                                      NPCType;                                                    // 0x08B8   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x08B9   (0x0007)  MISSED
	UTigerInteractiveNpcComponent*                     InteractiveNpcComponent;                                    // 0x08C0   (0x0008)  
	FTigerMeshCollection                               ReplicatedMeshCollection;                                   // 0x08C8   (0x0030)  
	UClass*                                            ReplicatedAnimationInstanceClass;                           // 0x08F8   (0x0008)  
	ATigerAISplinePath*                                ActiveSplinePath;                                           // 0x0900   (0x0008)  
	ATigerNPCSpawningBase*                             Spawner;                                                    // 0x0908   (0x0008)  
	USkeletalMeshComponentBudgeted*                    HeightenedSensesHeartMesh;                                  // 0x0910   (0x0008)  
	USkeletalMeshComponentBudgeted*                    InWorldHeartMesh;                                           // 0x0918   (0x0008)  
	float                                              LastTimeReactingToLocalPlayerAction;                        // 0x0920   (0x0004)  
	int32_t                                            LastPlayedVoEventId;                                        // 0x0924   (0x0004)  
	bool                                               bHasSightOfLocalPlayer;                                     // 0x0928   (0x0001)  
	unsigned char                                      UnknownData02_5[0x7];                                       // 0x0929   (0x0007)  MISSED
	ETigerBloodType                                    BloodType;                                                  // 0x0930   (0x0001)  
	ETigerBloodPotency                                 BloodPotency;                                               // 0x0931   (0x0001)  
	unsigned char                                      UnknownData03_5[0x6];                                       // 0x0932   (0x0006)  MISSED
	TArray<ATigerAISplinePath*>                        StoredSplines;                                              // 0x0938   (0x0010)  
	ATigerWorldCompositionGrid*                        StreamingGrid;                                              // 0x0948   (0x0008)  
	unsigned char                                      UnknownData04_6[0x80];                                      // 0x0950   (0x0080)  MISSED


	/// Functions
	// Function /Script/Tiger.TigerBaseNPC.QueueVoEvent
	void QueueVoEvent(FName& InVoCategory, bool bInShouldMulticast);                                                         // [0x1492270] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Tiger.TigerBaseNPC.PickHeartMeshes
	void PickHeartMeshes();                                                                                                  // [0x197e4f0] Event|Protected|BlueprintCallable|BlueprintEvent 
	// Function /Script/Tiger.TigerBaseNPC.OverrideBloodPotency
	void OverrideBloodPotency(ETigerBloodPotency InNewBloodPotency);                                                         // [0x1491950] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerBaseNPC.OnStoppedBeingClosestNpcWithPotencyInHeightenedSenses
	void OnStoppedBeingClosestNpcWithPotencyInHeightenedSenses();                                                            // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Script/Tiger.TigerBaseNPC.OnSawLocalPlayerBreachMasquerade
	void OnSawLocalPlayerBreachMasquerade();                                                                                 // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Script/Tiger.TigerBaseNPC.OnRep_ReplicatedAnimationInstanceClassChanged
	void OnRep_ReplicatedAnimationInstanceClassChanged();                                                                    // [0x1492250] Final|Native|Protected 
	// Function /Script/Tiger.TigerBaseNPC.OnRep_BloodType
	void OnRep_BloodType();                                                                                                  // [0x1492230] Final|Native|Protected 
	// Function /Script/Tiger.TigerBaseNPC.OnRep_BloodPotency
	void OnRep_BloodPotency();                                                                                               // [0x1492210] Final|Native|Protected 
	// Function /Script/Tiger.TigerBaseNPC.OnRep_AdditionalMeshCollectionChanged
	void OnRep_AdditionalMeshCollectionChanged();                                                                            // [0x14921f0] Final|Native|Protected 
	// Function /Script/Tiger.TigerBaseNPC.OnLostSightOfLocalPlayer
	void OnLostSightOfLocalPlayer(ATigerPlayer* InPlayer);                                                                   // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Script/Tiger.TigerBaseNPC.OnGainedSightOfLocalPlayer
	void OnGainedSightOfLocalPlayer(ATigerPlayer* InPlayer);                                                                 // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Script/Tiger.TigerBaseNPC.OnBloodTypeChanged
	void OnBloodTypeChanged(ETigerBloodType InBloodType);                                                                    // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Script/Tiger.TigerBaseNPC.OnBloodPotencyChanged
	void OnBloodPotencyChanged(ETigerBloodPotency InBloodPotency);                                                           // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Script/Tiger.TigerBaseNPC.OnBecameClosestNpcWithPotencyInHeightenedSenses
	void OnBecameClosestNpcWithPotencyInHeightenedSenses();                                                                  // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Script/Tiger.TigerBaseNPC.Multicast_VerifySimulationLocation
	void Multicast_VerifySimulationLocation(FVector InAuthorityLocation);                                                    // [0x1491f90] Final|Net|NetReliableNative|Event|NetMulticast|Private|HasDefaults 
	// Function /Script/Tiger.TigerBaseNPC.Multicast_QueueVoEvent
	void Multicast_QueueVoEvent(int8_t InVoCategoryIndex);                                                                   // [0x1491f10] Final|Net|Native|Event|NetMulticast|Private 
	// Function /Script/Tiger.TigerBaseNPC.Multicast_ChangeBlood
	void Multicast_ChangeBlood(ETigerBloodPotency InNewBloodPotency, ETigerBloodType InNewBloodType);                        // [0x1491e40] Final|Net|NetReliableNative|Event|NetMulticast|Private 
	// Function /Script/Tiger.TigerBaseNPC.GetTigerAiBaseController
	ATigerAiBaseController* GetTigerAiBaseController();                                                                      // [0x1491d50] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerBaseNPC.GetBloodType
	ETigerBloodType GetBloodType();                                                                                          // [0x1491b80] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerBaseNPC.GetBloodPotency
	ETigerBloodPotency GetBloodPotency();                                                                                    // [0x1491b60] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerBaseNPC.DeactivateHeightenedSensesVisualization
	void DeactivateHeightenedSensesVisualization();                                                                          // [0x1491a50] Final|Native|Protected|BlueprintCallable 
	// Function /Script/Tiger.TigerBaseNPC.AuthoritySetBloodType
	void AuthoritySetBloodType(ETigerBloodType InBloodType);                                                                 // [0x14919d0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerBaseNPC.AuthoritySetBloodPotency
	void AuthoritySetBloodPotency(ETigerBloodPotency InNewBloodPotency);                                                     // [0x1491950] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerBaseNPC.AuthoritySetBlood
	void AuthoritySetBlood(ETigerBloodPotency InNewBloodPotency, ETigerBloodType InNewBloodType);                            // [0x1491880] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerBaseNPC.ActivateHeightenedSensesVisualization
	void ActivateHeightenedSensesVisualization();                                                                            // [0x1491860] Final|Native|Protected|BlueprintCallable 
};

/// Class /Script/Tiger.TigerBaseThrallData
/// Size: 0x0098 (0x000030 - 0x0000C8)
class UTigerBaseThrallData : public UDataAsset
{ 
public:
	ETigerThrallId                                     ThrallId;                                                   // 0x0030   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0031   (0x0007)  MISSED
	FText                                              ThrallName;                                                 // 0x0038   (0x0018)  
	FText                                              ThrallDescription;                                          // 0x0050   (0x0018)  
	FText                                              ThrallHintText;                                             // 0x0068   (0x0018)  
	TArray<UTexture2D*>                                ThrallPortraits;                                            // 0x0080   (0x0010)  
	FText                                              ThrallKeepsakeName;                                         // 0x0090   (0x0018)  
	UTexture2D*                                        ThrallKeepsakePortrait;                                     // 0x00A8   (0x0008)  
	FTigerThrallStats                                  StartingStats;                                              // 0x00B0   (0x0010)  
	UTigerGrimoireEntry*                               GrimoireEntry;                                              // 0x00C0   (0x0008)  
};

/// Class /Script/Tiger.TigerBattlepassUI
/// Size: 0x0030 (0x0003C0 - 0x0003F0)
class UTigerBattlepassUI : public UTigerSceneBackgroundUI
{ 
public:
	int32_t                                            MaxPageItems;                                               // 0x03C0   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x03C4   (0x0004)  MISSED
	TArray<int32_t>                                    PageSizes;                                                  // 0x03C8   (0x0010)  
	int32_t                                            CurrentPageIndex;                                           // 0x03D8   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x03DC   (0x0004)  MISSED
	TArray<UTigerClientSeasonalRewardTier*>            RewardTiers;                                                // 0x03E0   (0x0010)  


	/// Functions
	// Function /Script/Tiger.TigerBattlepassUI.GetPageItemIndices
	void GetPageItemIndices(int32_t PageIndex, int32_t& FirstItemIndex, int32_t& LastItemIndex);                             // [0x1491ba0] Final|Native|Protected|HasOutParms|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/Tiger.TigerBelowBalconyEntryTrigger
/// Size: 0x0008 (0x000260 - 0x000268)
class ATigerBelowBalconyEntryTrigger : public ATriggerVolume
{ 
public:
	FName                                              EnterBalconyFromBelowAnimName;                              // 0x0260   (0x0008)  
};

/// Class /Script/Tiger.TigerBlindingBeautyEffectActor
/// Size: 0x0010 (0x000228 - 0x000238)
class ATigerBlindingBeautyEffectActor : public AActor
{ 
public:
	ATigerPlayer*                                      Player;                                                     // 0x0228   (0x0008)  
	float                                              TriggerTime;                                                // 0x0230   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0234   (0x0004)  MISSED


	/// Functions
	// Function /Script/Tiger.TigerBlindingBeautyEffectActor.OnDashExit
	void OnDashExit(bool bInShouldTrigger);                                                                                  // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Script/Tiger.TigerBlindingBeautyEffectActor.OnDashEnter
	void OnDashEnter();                                                                                                      // [0x197e4f0] Event|Public|BlueprintEvent 
};

/// Class /Script/Tiger.TigerBloodDecalTrail
/// Size: 0x0008 (0x000228 - 0x000230)
class ATigerBloodDecalTrail : public AActor
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0228   (0x0008)  MISSED
};

/// Class /Script/Tiger.TigerBloodPotencyVisualizationConfig
/// Size: 0x0050 (0x000030 - 0x000080)
class UTigerBloodPotencyVisualizationConfig : public UDataAsset
{ 
public:
	TArray<UMaterialInstance*>                         HeartMeshMaterialTarget;                                    // 0x0030   (0x0010)  
	TWeakObjectPtr<UNiagaraSystem*>                    NiagaraPath;                                                // 0x0040   (0x0028)  
	UParticleSystem*                                   ParticleSystem;                                             // 0x0068   (0x0008)  
	FName                                              ParticleSystemAttachmentSocket;                             // 0x0070   (0x0008)  
	bool                                               bParticleSystemAbsoluteRotation;                            // 0x0078   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0079   (0x0007)  MISSED
};

/// Class /Script/Tiger.TigerBloodPotencyComponent
/// Size: 0x01A8 (0x0000B0 - 0x000258)
class UTigerBloodPotencyComponent : public UActorComponent
{ 
public:
	float                                              BloodTypeWeights;                                           // 0x00B0   (0x001C)  
	bool                                               bEnableBloodTypeEffects;                                    // 0x00CC   (0x0001)  
	bool                                               bVisualizeBloodTypeNone;                                    // 0x00CD   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x00CE   (0x0002)  MISSED
	UTigerBloodPotencyVisualizationConfig*             CurrentHeightenedSensesConfig;                              // 0x00D0   (0x0008)  
	UTigerBloodPotencyVisualizationConfig*             CurrentInWorldConfig;                                       // 0x00D8   (0x0008)  
	UTigerBloodPotencyVisualizationConfig*             HeightenedSensesVisualConfiguration;                        // 0x00E0   (0x0020)  
	UTigerBloodPotencyVisualizationConfig*             HeightenedSensesVisualConfigurationByBloodType;             // 0x0100   (0x0038)  
	UTigerBloodPotencyVisualizationConfig*             InWorldVisualConfiguration;                                 // 0x0138   (0x0020)  
	UTigerBloodPotencyVisualizationConfig*             InWorldVisualConfigurationByBloodType;                      // 0x0158   (0x0038)  
	FName                                              HeartMeshMaximumVisibilityDistanceName;                     // 0x0190   (0x0008)  
	TArray<UMaterialInstance*>                         HsMeshPreviousMaterials;                                    // 0x0198   (0x0010)  
	TArray<UMaterialInstance*>                         HsMeshTargetMaterials;                                      // 0x01A8   (0x0010)  
	TArray<UMaterialInstanceDynamic*>                  HsMeshCurrentMaterials;                                     // 0x01B8   (0x0010)  
	USkeletalMeshComponent*                            HsSkeletalMeshComponent;                                    // 0x01C8   (0x0008)  
	UParticleSystemComponent*                          HsParticleSystemComponent;                                  // 0x01D0   (0x0008)  
	UNiagaraComponent*                                 HsNiagaraComponent;                                         // 0x01D8   (0x0008)  
	TArray<UMaterialInstance*>                         InWorldMeshPreviousMaterials;                               // 0x01E0   (0x0010)  
	TArray<UMaterialInstance*>                         InWorldMeshTargetMaterials;                                 // 0x01F0   (0x0010)  
	TArray<UMaterialInstanceDynamic*>                  InWorldMeshCurrentMaterials;                                // 0x0200   (0x0010)  
	USkeletalMeshComponent*                            InWorldSkeletalMeshComponent;                               // 0x0210   (0x0008)  
	UParticleSystemComponent*                          InWorldParticleSystemComponent;                             // 0x0218   (0x0008)  
	UNiagaraComponent*                                 InWorldNiagaraComponent;                                    // 0x0220   (0x0008)  
	ATigerBaseNPC*                                     NpcOwner;                                                   // 0x0228   (0x0008)  
	unsigned char                                      UnknownData01_5[0x10];                                      // 0x0230   (0x0010)  MISSED
	float                                              MaterialInterpolationDuration;                              // 0x0240   (0x0004)  
	unsigned char                                      UnknownData02_6[0x14];                                      // 0x0244   (0x0014)  MISSED


	/// Functions
	// Function /Script/Tiger.TigerBloodPotencyComponent.RefreshBloodPotencyVisualization
	void RefreshBloodPotencyVisualization(bool bInForceRefresh);                                                             // [0x1496640] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/Tiger.TigerBloodResonanceAsset
/// Size: 0x0158 (0x000030 - 0x000188)
class UTigerBloodResonanceAsset : public UDataAsset
{ 
public:
	FText                                              ResonanceName;                                              // 0x0030   (0x0018)  
	TWeakObjectPtr<UTexture2D*>                        ResonanceIcon;                                              // 0x0048   (0x0028)  
	FText                                              InventoryLevel0Description;                                 // 0x0070   (0x0018)  
	FText                                              InventoryLevel1Description;                                 // 0x0088   (0x0018)  
	FText                                              InventoryLevel2Description;                                 // 0x00A0   (0x0018)  
	FText                                              InventoryLevel3Description;                                 // 0x00B8   (0x0018)  
	FText                                              FeedRewardLevel1Description;                                // 0x00D0   (0x0018)  
	FText                                              FeedRewardLevel2Description;                                // 0x00E8   (0x0018)  
	FText                                              FeedRewardLevel3Description;                                // 0x0100   (0x0018)  
	FText                                              FeedRewardLevelMaxedDescription;                            // 0x0118   (0x0018)  
	FColor                                             ResonanceColor;                                             // 0x0130   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0134   (0x0004)  MISSED
	TWeakObjectPtr<UMaterial*>                         ResonanceVfx;                                               // 0x0138   (0x0028)  
	TWeakObjectPtr<UMaterial*>                         ResonanceMaxedVfx;                                          // 0x0160   (0x0028)  
};

/// Class /Script/Tiger.TigerBloodResonanceComponent
/// Size: 0x01A8 (0x0000B0 - 0x000258)
class UTigerBloodResonanceComponent : public UActorComponent
{ 
public:
	FMulticastInlineDelegate                           OnBloodResonanceBlockedByCap;                               // 0x00B0   (0x0010)  
	float                                              BloodCapIncreasePerEvent;                                   // 0x00C0   (0x0088)  
	TSet<ETigerPlayerEvent>                            AddRandomResonanceOnEvents;                                 // 0x0148   (0x0050)  
	FTigerBloodResonanceBuffs                          BloodResonanceBuffs;                                        // 0x0198   (0x0040)  
	int32_t                                            StartingBloodCap;                                           // 0x01D8   (0x0004)  
	int32_t                                            StartingBloodCapIncreaseGameMode;                           // 0x01DC   (0x0004)  
	int32_t                                            BloodTypeCap;                                               // 0x01E0   (0x0004)  
	int32_t                                            MaxBloodCap;                                                // 0x01E4   (0x0004)  
	int32_t                                            CurrentBloodCap;                                            // 0x01E8   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x01EC   (0x0004)  MISSED
	FMulticastInlineDelegate                           OnBloodCapChanged;                                          // 0x01F0   (0x0010)  
	FMulticastInlineDelegate                           OnBloodResonanceAdded;                                      // 0x0200   (0x0010)  
	TArray<ETigerBloodType>                            CurrentBloodResonance;                                      // 0x0210   (0x0010)  
	int32_t                                            BloodResonanceLevels;                                       // 0x0220   (0x0010)  
	int32_t                                            OldBloodResonanceLevels;                                    // 0x0230   (0x0010)  
	unsigned char                                      UnknownData01_5[0x10];                                      // 0x0240   (0x0010)  MISSED
	float                                              CurrentBloodSlotsIncrease;                                  // 0x0250   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x0254   (0x0004)  MISSED


	/// Functions
	// Function /Script/Tiger.TigerBloodResonanceComponent.OnRep_CurrentBloodCap
	void OnRep_CurrentBloodCap();                                                                                            // [0x1496600] Final|Native|Private 
	// Function /Script/Tiger.TigerBloodResonanceComponent.OnRep_BloodResonanceLevels
	void OnRep_BloodResonanceLevels();                                                                                       // [0x14965e0] Final|Native|Private 
	// Function /Script/Tiger.TigerBloodResonanceComponent.OnPlayerEvent
	void OnPlayerEvent(ETigerPlayerEvent InEvent, ATigerCharacter* InEventTiedCharacter);                                    // [0x1496510] Final|Native|Private 
	// Function /Script/Tiger.TigerBloodResonanceComponent.OnLifeStatusChanged
	void OnLifeStatusChanged(ETigerPlayerLifeStatus InNewLifeStatus);                                                        // [0x1496490] Final|Native|Private 
	// Function /Script/Tiger.TigerBloodResonanceComponent.GetTotalBloodResonanceNum
	int32_t GetTotalBloodResonanceNum();                                                                                     // [0x14962d0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerBloodResonanceComponent.GetMaxBloodCap
	int32_t GetMaxBloodCap();                                                                                                // [0x1496250] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerBloodResonanceComponent.GetCurrentBloodResonanceOfType
	int32_t GetCurrentBloodResonanceOfType(ETigerBloodType InBloodType);                                                     // [0x1496100] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerBloodResonanceComponent.GetCurrentBloodResonance
	TArray<ETigerBloodType> GetCurrentBloodResonance();                                                                      // [0x1496070] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerBloodResonanceComponent.GetCurrentBloodCap
	int32_t GetCurrentBloodCap();                                                                                            // [0x1496050] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerBloodResonanceComponent.Client_AddBloodResonance
	void Client_AddBloodResonance(ETigerBloodType InBloodType);                                                              // [0x1495ec0] Final|Net|NetReliableNative|Event|Private|NetClient 
	// Function /Script/Tiger.TigerBloodResonanceComponent.BlueprintServerAddBloodResonance
	void BlueprintServerAddBloodResonance(ETigerBloodType InBloodType);                                                      // [0x1495e40] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerBloodResonanceComponent.AddGameModeStartingBloodResonances
	void AddGameModeStartingBloodResonances();                                                                               // [0x1495e20] Final|Native|Private 
};

/// Class /Script/Tiger.TigerBloodVein
/// Size: 0x0050 (0x000228 - 0x000278)
class ATigerBloodVein : public AActor
{ 
public:
	FMulticastInlineDelegate                           OnEndOfVeinReached;                                         // 0x0228   (0x0010)  
	USplineComponent*                                  Spline;                                                     // 0x0238   (0x0008)  
	USceneComponent*                                   CurrentPlayerSpot;                                          // 0x0240   (0x0008)  
	float                                              EarliestDisconnectPoint;                                    // 0x0248   (0x0004)  
	float                                              LatestDisconnectPoint;                                      // 0x024C   (0x0004)  
	float                                              VeinMovementSpeed;                                          // 0x0250   (0x0004)  
	bool                                               bIsVeinActive;                                              // 0x0254   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0255   (0x0003)  MISSED
	ATigerHolyIncense*                                 HolyIncense;                                                // 0x0258   (0x0008)  
	unsigned char                                      UnknownData01_5[0xC];                                       // 0x0260   (0x000C)  MISSED
	float                                              StartSynchronizedTime;                                      // 0x026C   (0x0004)  
	unsigned char                                      UnknownData02_6[0x8];                                       // 0x0270   (0x0008)  MISSED


	/// Functions
	// Function /Script/Tiger.TigerBloodVein.TigerOnEndOfVeinReached__DelegateSignature
	void TigerOnEndOfVeinReached__DelegateSignature();                                                                       // [0x197e4f0] MulticastDelegate|Public|Delegate 
	// Function /Script/Tiger.TigerBloodVein.OnVeinActivated
	void OnVeinActivated();                                                                                                  // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Script/Tiger.TigerBloodVein.OnRep_IsVeinActive
	void OnRep_IsVeinActive();                                                                                               // [0x1496620] Final|Native|Private 
	// Function /Script/Tiger.TigerBloodVein.Multicast_StartMovement
	void Multicast_StartMovement(float ServerTime);                                                                          // [0x1496400] Final|Net|NetReliableNative|Event|NetMulticast|Private 
	// Function /Script/Tiger.TigerBloodVein.MatchStateChanged
	void MatchStateChanged(ETigerMatchState OldMatchState, ETigerMatchState NewMatchState);                                  // [0x1496330] Final|Native|Private 
	// Function /Script/Tiger.TigerBloodVein.GetCurrentPlayerLocation
	FVector GetCurrentPlayerLocation();                                                                                      // [0x14961d0] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerBloodVein.GetCurrentPlayerDirection
	FVector GetCurrentPlayerDirection();                                                                                     // [0x1496190] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/Tiger.TigerBloodVeinTrackWidget
/// Size: 0x0000 (0x000280 - 0x000280)
class UTigerBloodVeinTrackWidget : public UTigerWidget
{ 
public:
};

/// Class /Script/Tiger.TigerBlueprintLootComponent
/// Size: 0x0018 (0x0000B0 - 0x0000C8)
class UTigerBlueprintLootComponent : public UActorComponent
{ 
public:
	UTigerItemLootTable*                               LootTable;                                                  // 0x00B0   (0x0008)  
	TArray<AActor*>                                    SpawnedItemActors;                                          // 0x00B8   (0x0010)  


	/// Functions
	// Function /Script/Tiger.TigerBlueprintLootComponent.GetSpawnedItemActors
	TArray<AActor*> GetSpawnedItemActors();                                                                                  // [0x14962a0] Final|Native|Public|Const 
	// Function /Script/Tiger.TigerBlueprintLootComponent.GetLootTable
	UTigerItemLootTable* GetLootTable();                                                                                     // [0x1496230] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/Tiger.TigerBlueprintLootLocationComponent
/// Size: 0x0010 (0x0000B0 - 0x0000C0)
class UTigerBlueprintLootLocationComponent : public UActorComponent
{ 
public:
	UTigerLootLocationConfiguration*                   Configuration;                                              // 0x00B0   (0x0008)  
	char                                               GameTypeFilter;                                             // 0x00B8   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x00B9   (0x0007)  MISSED
};

/// Class /Script/Tiger.TigerBootGameMode
/// Size: 0x0020 (0x0002C8 - 0x0002E8)
class ATigerBootGameMode : public AGameModeBase
{ 
public:
	ESessionType                                       SessionTraveledFrom;                                        // 0x02C8   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x02C9   (0x0007)  MISSED
	UTigerGameFlowStateMap*                            GameFlowStateMap;                                           // 0x02D0   (0x0008)  
	UTigerGameFlowStateMap*                            BotGameFlowStateMap;                                        // 0x02D8   (0x0008)  
	UTigerLegalDocuments*                              LegalDocumentsObj;                                          // 0x02E0   (0x0008)  


	/// Functions
	// Function /Script/Tiger.TigerBootGameMode.GetLegalDocuments
	UTigerLegalDocuments* GetLegalDocuments();                                                                               // [0x1496210] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/Tiger.TigerGameState
/// Size: 0x0118 (0x000278 - 0x000390)
class ATigerGameState : public AGameStateBase
{ 
public:
	FMulticastInlineDelegate                           OnWeatherScenarioChangedEvent;                              // 0x0278   (0x0010)  
	TArray<int32_t>                                    FakeMatchmakingDelayGameModeIndices;                        // 0x0288   (0x0010)  
	unsigned char                                      UnknownData00_5[0x20];                                      // 0x0298   (0x0020)  MISSED
	FMulticastInlineDelegate                           OnPrePlayerStateRemoved;                                    // 0x02B8   (0x0010)  
	FGuid                                              MatchID;                                                    // 0x02C8   (0x0010)  
	TWeakObjectPtr<ATigerHolyIncense*>                 HolyIncense;                                                // 0x02D8   (0x0008)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x02E0   (0x0004)  MISSED
	float                                              SynchronizedTime;                                           // 0x02E4   (0x0004)  
	unsigned char                                      UnknownData02_5[0x10];                                      // 0x02E8   (0x0010)  MISSED
	UClass*                                            WeatherScenarioClass;                                       // 0x02F8   (0x0008)  
	UTigerWeatherScenarioData*                         WeatherScenario;                                            // 0x0300   (0x0008)  
	unsigned char                                      UnknownData03_5[0x50];                                      // 0x0308   (0x0050)  MISSED
	FString                                            ServerId;                                                   // 0x0358   (0x0010)  
	ETigerServerScalabilityTarget                      CurrentScalabilityTarget;                                   // 0x0368   (0x0001)  
	unsigned char                                      UnknownData04_6[0x27];                                      // 0x0369   (0x0027)  MISSED


	/// Functions
	// Function /Script/Tiger.TigerGameState.UnsubscribeOnPlayerStateGameDataChanged
	bool UnsubscribeOnPlayerStateGameDataChanged(int32_t InPlayerId, FDelegateProperty& InDelegate);                         // [0x1516ed0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Tiger.TigerGameState.TryGetPlayerStateFromID
	ATigerPlayerState* TryGetPlayerStateFromID(FTigerPersistentPlayerID& InID);                                              // [0x1516e10] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Tiger.TigerGameState.TigerPrintServerScalabilityTarget
	void TigerPrintServerScalabilityTarget();                                                                                // [0xb7a5a0] Final|Exec|Native|Public 
	// Function /Script/Tiger.TigerGameState.TigerDisplayServerId
	void TigerDisplayServerId();                                                                                             // [0xb7a5a0] Final|Exec|Native|Private 
	// Function /Script/Tiger.TigerGameState.SubscribeOnPlayerStateGameDataChanged
	bool SubscribeOnPlayerStateGameDataChanged(int32_t InPlayerId, FDelegateProperty& InDelegate);                           // [0x1516c50] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/Tiger.TigerGameState.PlayerStateRemoved__DelegateSignature
	void PlayerStateRemoved__DelegateSignature(ATigerPlayerState* InPlayerState);                                            // [0x197e4f0] MulticastDelegate|Public|Delegate 
	// Function /Script/Tiger.TigerGameState.OnWeatherScenarioChanged__DelegateSignature
	void OnWeatherScenarioChanged__DelegateSignature(UTigerWeatherScenarioData* WeatherScenarioData);                        // [0x197e4f0] MulticastDelegate|Public|Delegate 
	// Function /Script/Tiger.TigerGameState.OnRep_WeatherScenarioClass
	void OnRep_WeatherScenarioClass();                                                                                       // [0x15144b0] Final|Native|Private 
	// Function /Script/Tiger.TigerGameState.OnRep_SynchronizedTime
	void OnRep_SynchronizedTime();                                                                                           // [0x1514490] Final|Native|Private 
	// Function /Script/Tiger.TigerGameState.OnRep_FakeMatchmakingDelayRemovedForGameModeIndex
	void OnRep_FakeMatchmakingDelayRemovedForGameModeIndex();                                                                // [0x1514470] Final|Native|Private 
	// Function /Script/Tiger.TigerGameState.OnPlayerStateGameDataChangeDelegate__DelegateSignature
	void OnPlayerStateGameDataChangeDelegate__DelegateSignature();                                                           // [0x197e4f0] Public|Delegate      
	// Function /Script/Tiger.TigerGameState.OnPlayerStateGameDataChanged__DelegateSignature
	void OnPlayerStateGameDataChanged__DelegateSignature();                                                                  // [0x197e4f0] MulticastDelegate|Public|Delegate 
	// Function /Script/Tiger.TigerGameState.Multicast_SynchronizeTime
	void Multicast_SynchronizeTime(float InNewSynchronizedTime);                                                             // [0x15143e0] Final|Net|Native|Event|NetMulticast|Private 
	// Function /Script/Tiger.TigerGameState.GetSynchronizedTimeNonInterpolated
	float GetSynchronizedTimeNonInterpolated();                                                                              // [0x1513f70] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerGameState.GetSynchronizedTime
	float GetSynchronizedTime();                                                                                             // [0x1513f40] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerGameState.GetPlayerStateDataCopy
	FTigerPlayerStateGameData GetPlayerStateDataCopy(int32_t InPlayerId);                                                    // [0x1513e20] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/Tiger.TigerGameState.GetMatchId
	FGuid GetMatchId();                                                                                                      // [0x1513cf0] Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/Tiger.TigerBootGameState
/// Size: 0x0008 (0x000390 - 0x000398)
class ATigerBootGameState : public ATigerGameState
{ 
public:
	unsigned char                                      UnknownData00_1[0x8];                                       // 0x0390   (0x0008)  MISSED
};

/// Class /Script/Tiger.TigerPassiveConfig
/// Size: 0x0110 (0x000030 - 0x000140)
class UTigerPassiveConfig : public UDataAsset
{ 
public:
	FText                                              Name;                                                       // 0x0030   (0x0018)  
	FText                                              Description;                                                // 0x0048   (0x0018)  
	FText                                              Summary;                                                    // 0x0060   (0x0018)  
	UTexture2D*                                        Icon;                                                       // 0x0078   (0x0008)  
	UMediaSource*                                      PreviewVideo;                                               // 0x0080   (0x0008)  
	UClass*                                            CustomWidget;                                               // 0x0088   (0x0008)  
	UClass*                                            LogicComponent;                                             // 0x0090   (0x0008)  
	FTigerCharacterStatModification                    PassiveStatChanges;                                         // 0x0098   (0x00A8)  
};

/// Class /Script/Tiger.TigerBrujahBaneRecklessness
/// Size: 0x0008 (0x000140 - 0x000148)
class UTigerBrujahBaneRecklessness : public UTigerPassiveConfig
{ 
public:
	float                                              DamageTakenMultiplier;                                      // 0x0140   (0x0004)  
	float                                              AutoDeactivateTimer;                                        // 0x0144   (0x0004)  
};

/// Class /Script/Tiger.TigerPassiveComponent
/// Size: 0x0018 (0x0000B0 - 0x0000C8)
class UTigerPassiveComponent : public UActorComponent
{ 
public:
	ATigerPlayer*                                      PlayerOwner;                                                // 0x00B0   (0x0008)  
	UTigerWidget*                                      PassiveWidget;                                              // 0x00B8   (0x0008)  
	unsigned char                                      UnknownData00_6[0x8];                                       // 0x00C0   (0x0008)  MISSED


	/// Functions
	// Function /Script/Tiger.TigerPassiveComponent.SetPassiveWidget
	void SetPassiveWidget(UTigerWidget* InWidget);                                                                           // [0x1570ae0] Final|Native|Public|BlueprintCallable 
	// Function /Script/Tiger.TigerPassiveComponent.OnFirstPossessed
	void OnFirstPossessed(ATigerPlayer* InPlayer, bool InHasAuthority);                                                      // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Script/Tiger.TigerPassiveComponent.OnCreated
	void OnCreated(ATigerPlayer* InPlayer, bool InHasAuthority);                                                             // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Script/Tiger.TigerPassiveComponent.IsPassiveActive
	bool IsPassiveActive();                                                                                                  // [0x15707e0] Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Script/Tiger.TigerPassiveComponent.GetPassiveWidget
	UTigerWidget* GetPassiveWidget();                                                                                        // [0x15701a0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/Tiger.TigerBrujahBaneRecklessnessLogic
/// Size: 0x00C0 (0x0000C8 - 0x000188)
class UTigerBrujahBaneRecklessnessLogic : public UTigerPassiveComponent
{ 
public:
	UTigerBrujahBaneRecklessness*                      Config;                                                     // 0x00C8   (0x0008)  
	ATigerPlayer*                                      Player;                                                     // 0x00D0   (0x0008)  
	unsigned char                                      UnknownData00_6[0xB0];                                      // 0x00D8   (0x00B0)  MISSED
};

/// Class /Script/Tiger.TigerBrujahTraitMomentum
/// Size: 0x0020 (0x000140 - 0x000160)
class UTigerBrujahTraitMomentum : public UTigerPassiveConfig
{ 
public:
	float                                              MomentumActiveTimer;                                        // 0x0140   (0x0004)  
	float                                              GroundSlamRadiusMultiplier;                                 // 0x0144   (0x0004)  
	float                                              MightyLeapVelocityMultiplier;                               // 0x0148   (0x0004)  
	float                                              FOTTKnockbackDistanceMultiplier;                            // 0x014C   (0x0004)  
	float                                              FOTTWallImpactDamageMultiplier;                             // 0x0150   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x0154   (0x0004)  MISSED
	UAkAudioEvent*                                     MomentumStartedAudioEvent;                                  // 0x0158   (0x0008)  
};

/// Class /Script/Tiger.TigerBrujahTraitMomentumLogic
/// Size: 0x0020 (0x0000C8 - 0x0000E8)
class UTigerBrujahTraitMomentumLogic : public UTigerPassiveComponent
{ 
public:
	UTigerBrujahTraitMomentum*                         Config;                                                     // 0x00C8   (0x0008)  
	ATigerPlayer*                                      Player;                                                     // 0x00D0   (0x0008)  
	unsigned char                                      UnknownData00_6[0x10];                                      // 0x00D8   (0x0010)  MISSED


	/// Functions
	// Function /Script/Tiger.TigerBrujahTraitMomentumLogic.IsMomentumActive
	bool IsMomentumActive();                                                                                                 // [0x1496300] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/Tiger.TigerBTServiceAvoidRedGas
/// Size: 0x0010 (0x000070 - 0x000080)
class UTigerBTServiceAvoidRedGas : public UBTService
{ 
public:
	float                                              HolyIncenseCountdownThreshold;                              // 0x0070   (0x0004)  
	float                                              DesireMoveNextWaveThreshold;                                // 0x0074   (0x0004)  
	float                                              NextWaveDangerThreshold;                                    // 0x0078   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x007C   (0x0004)  MISSED
};

/// Class /Script/Tiger.TigerBTServiceTrackHaven
/// Size: 0x0050 (0x000070 - 0x0000C0)
class UTigerBTServiceTrackHaven : public UBTService
{ 
public:
	FBlackboardKeySelector                             FinalHavenKey;                                              // 0x0070   (0x0028)  
	FBlackboardKeySelector                             CapturePointKey;                                            // 0x0098   (0x0028)  
};

/// Class /Script/Tiger.TigerBuffAdrenalineRushInstance
/// Size: 0x0000 (0x000080 - 0x000080)
class UTigerBuffAdrenalineRushInstance : public UTigerBuffInstance
{ 
public:
};

/// Class /Script/Tiger.TigerBuffAdrenalineRush
/// Size: 0x0000 (0x000268 - 0x000268)
class UTigerBuffAdrenalineRush : public UTigerBuff
{ 
public:
};

/// Class /Script/Tiger.TigerBuffAnarchHuntingKnife
/// Size: 0x0020 (0x000268 - 0x000288)
class UTigerBuffAnarchHuntingKnife : public UTigerBuff
{ 
public:
	UCurveFloat*                                       EffectStrengthBasedOnDistance;                              // 0x0268   (0x0008)  
	UCurveFloat*                                       EffectStrengthBasedOnKills;                                 // 0x0270   (0x0008)  
	UCurveFloat*                                       DamageBasedOnEnemiesKilled;                                 // 0x0278   (0x0008)  
	float                                              MaxDistanceToCheckForEnemies;                               // 0x0280   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x0284   (0x0004)  MISSED
};

/// Class /Script/Tiger.TigerBuffAnarchHuntingKnifeInstance
/// Size: 0x0010 (0x000080 - 0x000090)
class UTigerBuffAnarchHuntingKnifeInstance : public UTigerBuffInstance
{ 
public:
	UTigerBuffAnarchHuntingKnife*                      HuntingKnifeBuff;                                           // 0x0080   (0x0008)  
	ATigerPlayer*                                      Player;                                                     // 0x0088   (0x0008)  
};

/// Class /Script/Tiger.TigerBuffAnarchHuntingKnifeStack
/// Size: 0x0000 (0x000268 - 0x000268)
class UTigerBuffAnarchHuntingKnifeStack : public UTigerBuff
{ 
public:
};

/// Class /Script/Tiger.TigerBuffAnarchHuntingKnifeStackInstance
/// Size: 0x0008 (0x000080 - 0x000088)
class UTigerBuffAnarchHuntingKnifeStackInstance : public UTigerBuffInstance
{ 
public:
	ATigerPlayer*                                      Player;                                                     // 0x0080   (0x0008)  
};

