/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

/// Package UI.

/// Class /Game/UI/Widgets/Cursor/TBP_UI_Cursor.TBP_UI_Cursor_C
/// Size: 0x0025 (0x000298 - 0x0002BD)
class UTBP_UI_Cursor_C : public UTigerCursor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0298   (0x0008)  
	UImage*                                            Cursor_Gamepad;                                             // 0x02A0   (0x0008)  
	UImage*                                            Cursor_Mouse;                                               // 0x02A8   (0x0008)  
	float                                              PreviousViewportScale;                                      // 0x02B0   (0x0004)  
	FVector2D                                          Starting_Size;                                              // 0x02B4   (0x0008)  
	bool                                               HasBound;                                                   // 0x02BC   (0x0001)  


	/// Functions
	// Function /Game/UI/Widgets/Cursor/TBP_UI_Cursor.TBP_UI_Cursor_C.IsCursorVisible
	bool IsCursorVisible();                                                                                                  // [0x197e4f0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Widgets/Cursor/TBP_UI_Cursor.TBP_UI_Cursor_C.FixCursorHotspot
	void FixCursorHotspot();                                                                                                 // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Cursor/TBP_UI_Cursor.TBP_UI_Cursor_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Cursor/TBP_UI_Cursor.TBP_UI_Cursor_C.Tick
	void Tick(FGeometry MyGeometry, float InDeltaTime);                                                                      // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Cursor/TBP_UI_Cursor.TBP_UI_Cursor_C.SetRenderOpacityForDuration
	void SetRenderOpacityForDuration(float InTime, float InOpacity);                                                         // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Cursor/TBP_UI_Cursor.TBP_UI_Cursor_C.On Use GamePad Changed
	void On Use GamePad Changed(bool bNewIsProbablyUsingGamepad);                                                            // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Cursor/TBP_UI_Cursor.TBP_UI_Cursor_C.ForceRefreshMouseVisibility
	void ForceRefreshMouseVisibility();                                                                                      // [0x197e4f0] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Cursor/TBP_UI_Cursor.TBP_UI_Cursor_C.ExecuteUbergraph_TBP_UI_Cursor
	void ExecuteUbergraph_TBP_UI_Cursor(int32_t EntryPoint);                                                                 // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/UI/BlueprintFunctionLibraries/TBFL_UIColors.TBFL_UIColors_C
/// Size: 0x0000 (0x000028 - 0x000028)
class UTBFL_UIColors_C : public UBlueprintFunctionLibrary
{ 
public:
};

/// Class /Game/UI/Widgets/Compass/TBP_UI_CompassObject.TBP_UI_CompassObject_C
/// Size: 0x0020 (0x0002A0 - 0x0002C0)
class UTBP_UI_CompassObject_C : public UTigerCompassMarkerWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02A0   (0x0008)  
	UCanvasPanel*                                      CompassMarker;                                              // 0x02A8   (0x0008)  
	UImage*                                            CompassMarkerImage;                                         // 0x02B0   (0x0008)  
	UMaterialInstanceDynamic*                          CompassMarkerMaterial;                                      // 0x02B8   (0x0008)  


	/// Functions
	// Function /Game/UI/Widgets/Compass/TBP_UI_CompassObject.TBP_UI_CompassObject_C.GetCompassObjectScreenMinMax
	void GetCompassObjectScreenMinMax(float& Screen Pos Min, float& Screen Pos Max);                                         // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Widgets/Compass/TBP_UI_CompassObject.TBP_UI_CompassObject_C.GetProximityToCompassAreaCenter
	void GetProximityToCompassAreaCenter(float& 0-1 Proximity);                                                              // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Widgets/Compass/TBP_UI_CompassObject.TBP_UI_CompassObject_C.GetObjectImageSizeX
	void GetObjectImageSizeX(float& Image Size X);                                                                           // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Widgets/Compass/TBP_UI_CompassObject.TBP_UI_CompassObject_C.GetCompassAreaSizeX
	void GetCompassAreaSizeX(float& Compass Area Size X);                                                                    // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Widgets/Compass/TBP_UI_CompassObject.TBP_UI_CompassObject_C.UpdatePosition
	void UpdatePosition();                                                                                                   // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Compass/TBP_UI_CompassObject.TBP_UI_CompassObject_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Compass/TBP_UI_CompassObject.TBP_UI_CompassObject_C.Tick
	void Tick(FGeometry MyGeometry, float InDeltaTime);                                                                      // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Compass/TBP_UI_CompassObject.TBP_UI_CompassObject_C.SetColorBasedOnPlayerIndex
	void SetColorBasedOnPlayerIndex(char InIndex);                                                                           // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Compass/TBP_UI_CompassObject.TBP_UI_CompassObject_C.ExecuteUbergraph_TBP_UI_CompassObject
	void ExecuteUbergraph_TBP_UI_CompassObject(int32_t EntryPoint);                                                          // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/UI/Widgets/Map/MapMarkers/TBP_UI_MapMarker.TBP_UI_MapMarker_C
/// Size: 0x0008 (0x0002C8 - 0x0002D0)
class UTBP_UI_MapMarker_C : public UTigerMapMarkerWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C8   (0x0008)  


	/// Functions
	// Function /Game/UI/Widgets/Map/MapMarkers/TBP_UI_MapMarker.TBP_UI_MapMarker_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Map/MapMarkers/TBP_UI_MapMarker.TBP_UI_MapMarker_C.Tick
	void Tick(FGeometry MyGeometry, float InDeltaTime);                                                                      // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Map/MapMarkers/TBP_UI_MapMarker.TBP_UI_MapMarker_C.ExecuteUbergraph_TBP_UI_MapMarker
	void ExecuteUbergraph_TBP_UI_MapMarker(int32_t EntryPoint);                                                              // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/UI/Widgets/Group/TBP_GroupMemberMapMarkerWidget.TBP_GroupMemberMapMarkerWidget_C
/// Size: 0x0062 (0x0002D0 - 0x000332)
class UTBP_GroupMemberMapMarkerWidget_C : public UTBP_UI_MapMarker_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02D0   (0x0008)  
	UWidgetAnimation*                                  OnRespawned;                                                // 0x02D8   (0x0008)  
	UWidgetAnimation*                                  OnDeath;                                                    // 0x02E0   (0x0008)  
	UImage*                                            PlayerImageDead;                                            // 0x02E8   (0x0008)  
	UImage*                                            PlayerImageGroup;                                           // 0x02F0   (0x0008)  
	UImage*                                            PlayerImageGroupOutline;                                    // 0x02F8   (0x0008)  
	UImage*                                            PlayerImageGroupShadow;                                     // 0x0300   (0x0008)  
	UImage*                                            PlayerImageTeam;                                            // 0x0308   (0x0008)  
	UImage*                                            PlayerImageTeamOutline;                                     // 0x0310   (0x0008)  
	UImage*                                            PlayerImageTeamShadow;                                      // 0x0318   (0x0008)  
	bool                                               bIsExtendedGroupMember;                                     // 0x0320   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0321   (0x0007)  MISSED
	UTigerGroupMemberMarkerProxy*                      GroupMemberMarkerProxy;                                     // 0x0328   (0x0008)  
	bool                                               bIsDead;                                                    // 0x0330   (0x0001)  
	bool                                               bShouldShowDeathIcon;                                       // 0x0331   (0x0001)  


	/// Functions
	// Function /Game/UI/Widgets/Group/TBP_GroupMemberMapMarkerWidget.TBP_GroupMemberMapMarkerWidget_C.UpdateDeathIcon
	void UpdateDeathIcon();                                                                                                  // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Group/TBP_GroupMemberMapMarkerWidget.TBP_GroupMemberMapMarkerWidget_C.UpdateExtendedGroupMember
	void UpdateExtendedGroupMember();                                                                                        // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Group/TBP_GroupMemberMapMarkerWidget.TBP_GroupMemberMapMarkerWidget_C.IsExtendedGroupMember
	void IsExtendedGroupMember(bool& bExtendedGroupMember);                                                                  // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Widgets/Group/TBP_GroupMemberMapMarkerWidget.TBP_GroupMemberMapMarkerWidget_C.GetPlayerIndex
	void GetPlayerIndex(char& PlayerIndex);                                                                                  // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Widgets/Group/TBP_GroupMemberMapMarkerWidget.TBP_GroupMemberMapMarkerWidget_C.OnUpdated
	void OnUpdated();                                                                                                        // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Group/TBP_GroupMemberMapMarkerWidget.TBP_GroupMemberMapMarkerWidget_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Group/TBP_GroupMemberMapMarkerWidget.TBP_GroupMemberMapMarkerWidget_C.HandleMatchSettings
	void HandleMatchSettings();                                                                                              // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Group/TBP_GroupMemberMapMarkerWidget.TBP_GroupMemberMapMarkerWidget_C.ExecuteUbergraph_TBP_GroupMemberMapMarkerWidget
	void ExecuteUbergraph_TBP_GroupMemberMapMarkerWidget(int32_t EntryPoint);                                                // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard_RankedBanner.TBP_UI_PlayerCard_RankedBanner_C
/// Size: 0x002C (0x000260 - 0x00028C)
class UTBP_UI_PlayerCard_RankedBanner_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	UImage*                                            Backplate;                                                  // 0x0268   (0x0008)  
	UImage*                                            Backplate_Color;                                            // 0x0270   (0x0008)  
	UImage*                                            RankIcon;                                                   // 0x0278   (0x0008)  
	URetainerBox*                                      RetainerBox;                                                // 0x0280   (0x0008)  
	int32_t                                            RepresentedPlayerID;                                        // 0x0288   (0x0004)  


	/// Functions
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard_RankedBanner.TBP_UI_PlayerCard_RankedBanner_C.UpdatePlayerDataSubscription
	void UpdatePlayerDataSubscription(int32_t PreviousID, int32_t CurrentID);                                                // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard_RankedBanner.TBP_UI_PlayerCard_RankedBanner_C.GetDataFromID
	void GetDataFromID(bool& IsValid, FTigerPlayerStateGameData& OutData);                                                   // [0x197e4f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard_RankedBanner.TBP_UI_PlayerCard_RankedBanner_C.UpdateRepresentedPlayer
	void UpdateRepresentedPlayer(int32_t InPlayerId);                                                                        // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard_RankedBanner.TBP_UI_PlayerCard_RankedBanner_C.UpdateRank
	void UpdateRank();                                                                                                       // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard_RankedBanner.TBP_UI_PlayerCard_RankedBanner_C.PlayerDataUpdated
	void PlayerDataUpdated();                                                                                                // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard_RankedBanner.TBP_UI_PlayerCard_RankedBanner_C.ExecuteUbergraph_TBP_UI_PlayerCard_RankedBanner
	void ExecuteUbergraph_TBP_UI_PlayerCard_RankedBanner(int32_t EntryPoint);                                                // [0x197e4f0] Final                
};

/// Class /Game/UI/Widgets/Subwidgets/TBP_UI_ListItemVisual.TBP_UI_ListItemVisual_C
/// Size: 0x00B0 (0x000370 - 0x000420)
class UTBP_UI_ListItemVisual_C : public UTigerUIDPadNavNode
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0370   (0x0008)  
	UWidgetAnimation*                                  HighlightAnim;                                              // 0x0378   (0x0008)  
	UButton*                                           Button;                                                     // 0x0380   (0x0008)  
	UNamedSlot*                                        Content;                                                    // 0x0388   (0x0008)  
	UImage*                                            HoverBackground;                                            // 0x0390   (0x0008)  
	UImage*                                            HoverBorderBot;                                             // 0x0398   (0x0008)  
	UImage*                                            HoverBorderTop;                                             // 0x03A0   (0x0008)  
	UCanvasPanel*                                      HoveredContainer;                                           // 0x03A8   (0x0008)  
	UImage*                                            NormalBorderBot;                                            // 0x03B0   (0x0008)  
	UImage*                                            NormalBorderTop;                                            // 0x03B8   (0x0008)  
	UImage*                                            SelectBakground;                                            // 0x03C0   (0x0008)  
	UTBP_UI_ListItem_C*                                Parrent;                                                    // 0x03C8   (0x0008)  
	FMulticastInlineDelegate                           OnClick;                                                    // 0x03D0   (0x0010)  
	FMulticastInlineDelegate                           OnPress;                                                    // 0x03E0   (0x0010)  
	FMulticastInlineDelegate                           OnRelease;                                                  // 0x03F0   (0x0010)  
	FMulticastInlineDelegate                           OnHover;                                                    // 0x0400   (0x0010)  
	FMulticastInlineDelegate                           OnUnhover;                                                  // 0x0410   (0x0010)  


	/// Functions
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ListItemVisual.TBP_UI_ListItemVisual_C.BndEvt__ListItem_Button_26_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature
	void BndEvt__ListItem_Button_26_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature();                    // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ListItemVisual.TBP_UI_ListItemVisual_C.BndEvt__ListItem_Button_26_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
	void BndEvt__ListItem_Button_26_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();                    // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ListItemVisual.TBP_UI_ListItemVisual_C.OnSelect
	void OnSelect();                                                                                                         // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ListItemVisual.TBP_UI_ListItemVisual_C.OnDeselect
	void OnDeselect();                                                                                                       // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ListItemVisual.TBP_UI_ListItemVisual_C.BndEvt__ListItem_Button_26_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
	void BndEvt__ListItem_Button_26_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();                  // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ListItemVisual.TBP_UI_ListItemVisual_C.BndEvt__ListItem_Button_26_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature
	void BndEvt__ListItem_Button_26_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature();                  // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ListItemVisual.TBP_UI_ListItemVisual_C.BndEvt__ListItem_Button_26_K2Node_ComponentBoundEvent_4_OnButtonReleasedEvent__DelegateSignature
	void BndEvt__ListItem_Button_26_K2Node_ComponentBoundEvent_4_OnButtonReleasedEvent__DelegateSignature();                 // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ListItemVisual.TBP_UI_ListItemVisual_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ListItemVisual.TBP_UI_ListItemVisual_C.OnHighlight
	void OnHighlight();                                                                                                      // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ListItemVisual.TBP_UI_ListItemVisual_C.OnUnHightlight
	void OnUnHightlight();                                                                                                   // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ListItemVisual.TBP_UI_ListItemVisual_C.OnInteraction
	void OnInteraction();                                                                                                    // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ListItemVisual.TBP_UI_ListItemVisual_C.ExecuteUbergraph_TBP_UI_ListItemVisual
	void ExecuteUbergraph_TBP_UI_ListItemVisual(int32_t EntryPoint);                                                         // [0x197e4f0] Final|HasDefaults    
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ListItemVisual.TBP_UI_ListItemVisual_C.OnRelease__DelegateSignature
	void OnRelease__DelegateSignature();                                                                                     // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ListItemVisual.TBP_UI_ListItemVisual_C.OnPress__DelegateSignature
	void OnPress__DelegateSignature();                                                                                       // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ListItemVisual.TBP_UI_ListItemVisual_C.OnUnhover__DelegateSignature
	void OnUnhover__DelegateSignature();                                                                                     // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ListItemVisual.TBP_UI_ListItemVisual_C.OnHover__DelegateSignature
	void OnHover__DelegateSignature();                                                                                       // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ListItemVisual.TBP_UI_ListItemVisual_C.OnClick__DelegateSignature
	void OnClick__DelegateSignature();                                                                                       // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/Widgets/Subwidgets/TBP_UI_ListItem.TBP_UI_ListItem_C
/// Size: 0x0011 (0x000370 - 0x000381)
class UTBP_UI_ListItem_C : public UTigerUIDPadNavNode
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0370   (0x0008)  
	UTBP_UI_List_C*                                    Parrent;                                                    // 0x0378   (0x0008)  
	bool                                               bIsSelected;                                                // 0x0380   (0x0001)  


	/// Functions
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ListItem.TBP_UI_ListItem_C.OnDeselect
	void OnDeselect();                                                                                                       // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ListItem.TBP_UI_ListItem_C.OnSelect
	void OnSelect();                                                                                                         // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ListItem.TBP_UI_ListItem_C.SelectListItem
	void SelectListItem();                                                                                                   // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ListItem.TBP_UI_ListItem_C.OnSelectWidget
	void OnSelectWidget();                                                                                                   // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ListItem.TBP_UI_ListItem_C.OnDeselectWidget
	void OnDeselectWidget();                                                                                                 // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ListItem.TBP_UI_ListItem_C.Initialize
	void Initialize(UTBP_UI_List_C* InParrent);                                                                              // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ListItem.TBP_UI_ListItem_C.OnInteraction
	void OnInteraction();                                                                                                    // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ListItem.TBP_UI_ListItem_C.ExecuteUbergraph_TBP_UI_ListItem
	void ExecuteUbergraph_TBP_UI_ListItem(int32_t EntryPoint);                                                               // [0x197e4f0] Final                
};

/// Class /Game/UI/Widgets/Team/TBP_UI_ListItemReport.TBP_UI_ListItemReport_C
/// Size: 0x0040 (0x000381 - 0x0003C1)
class UTBP_UI_ListItemReport_C : public UTBP_UI_ListItem_C
{ 
public:
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0381   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0388   (0x0008)  
	UWidgetAnimation*                                  HighlightAnim;                                              // 0x0390   (0x0008)  
	UTigerStyledRichTextBlock*                         Display_Text;                                               // 0x0398   (0x0008)  
	UTBP_UI_ListItemVisual_C*                          TBP_UI_ListItemVisual;                                      // 0x03A0   (0x0008)  
	FText                                              Text;                                                       // 0x03A8   (0x0018)  
	ETigerReportReason                                 ReportReason;                                               // 0x03C0   (0x0001)  


	/// Functions
	// Function /Game/UI/Widgets/Team/TBP_UI_ListItemReport.TBP_UI_ListItemReport_C.OnDeselect
	void OnDeselect();                                                                                                       // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_ListItemReport.TBP_UI_ListItemReport_C.OnSelect
	void OnSelect();                                                                                                         // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_ListItemReport.TBP_UI_ListItemReport_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_ListItemReport.TBP_UI_ListItemReport_C.ButtonClicked
	void ButtonClicked();                                                                                                    // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_ListItemReport.TBP_UI_ListItemReport_C.SetText
	void SetText(FText Text);                                                                                                // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_ListItemReport.TBP_UI_ListItemReport_C.ButtonHovered
	void ButtonHovered();                                                                                                    // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_ListItemReport.TBP_UI_ListItemReport_C.ButtonUnHovered
	void ButtonUnHovered();                                                                                                  // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_ListItemReport.TBP_UI_ListItemReport_C.OnHighlight
	void OnHighlight();                                                                                                      // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_ListItemReport.TBP_UI_ListItemReport_C.OnUnHightlight
	void OnUnHightlight();                                                                                                   // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_ListItemReport.TBP_UI_ListItemReport_C.OnInteraction
	void OnInteraction();                                                                                                    // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_ListItemReport.TBP_UI_ListItemReport_C.ResetVisuals
	void ResetVisuals();                                                                                                     // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_ListItemReport.TBP_UI_ListItemReport_C.ExecuteUbergraph_TBP_UI_ListItemReport
	void ExecuteUbergraph_TBP_UI_ListItemReport(int32_t EntryPoint);                                                         // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/UI/Widgets/Login/TBP_UI_SmallErrorMessage.TBP_UI_SmallErrorMessage_C
/// Size: 0x0020 (0x000260 - 0x000280)
class UTBP_UI_SmallErrorMessage_C : public UUserWidget
{ 
public:
	UImage*                                            Background;                                                 // 0x0260   (0x0008)  
	UImage*                                            Border;                                                     // 0x0268   (0x0008)  
	UImage*                                            ErrorImage;                                                 // 0x0270   (0x0008)  
	UTigerStyledRichTextBlock*                         ErrorText;                                                  // 0x0278   (0x0008)  


	/// Functions
	// Function /Game/UI/Widgets/Login/TBP_UI_SmallErrorMessage.TBP_UI_SmallErrorMessage_C.SetError
	void SetError(bool InError, FText InText);                                                                               // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Login/TBP_UI_SmallErrorMessage.TBP_UI_SmallErrorMessage_C.Reset
	void Reset();                                                                                                            // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard.TBP_UI_PlayerCard_C
/// Size: 0x0097 (0x000280 - 0x000317)
class UTBP_UI_PlayerCard_C : public UTigerWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UWidgetAnimation*                                  Press_Anim;                                                 // 0x0288   (0x0008)  
	UWidgetAnimation*                                  Highlight_Anim;                                             // 0x0290   (0x0008)  
	UImage*                                            AvatarBackGlow_Image;                                       // 0x0298   (0x0008)  
	UImage*                                            BannerBackGlow_Image;                                       // 0x02A0   (0x0008)  
	UImage*                                            GroupColor_Image;                                           // 0x02A8   (0x0008)  
	UImage*                                            GroupColor_Image_Outline;                                   // 0x02B0   (0x0008)  
	UImage*                                            PlatfromIndicator_Image;                                    // 0x02B8   (0x0008)  
	UImage*                                            PlayerAvatar_Image;                                         // 0x02C0   (0x0008)  
	UImage*                                            PlayerBanner_Image;                                         // 0x02C8   (0x0008)  
	UTigerStyledRichTextBlock*                         PlayerName_Text;                                            // 0x02D0   (0x0008)  
	UImage*                                            RedTint_Avatar_Image;                                       // 0x02D8   (0x0008)  
	UImage*                                            RedTint_Banner_Image;                                       // 0x02E0   (0x0008)  
	UTBP_UI_MaskedCardBorder_C*                        TBP_UI_MaskedCardBorder_Avatar;                             // 0x02E8   (0x0008)  
	UTBP_UI_MaskedCardBorder_C*                        TBP_UI_MaskedCardBorder_Banner;                             // 0x02F0   (0x0008)  
	UTBP_UI_PlayerCard_RankedBanner_C*                 TBP_UI_PlayerCard_RankedBanner;                             // 0x02F8   (0x0008)  
	UTBP_UI_Tag_PlayerLevel_C*                         TBP_UI_Tag_PlayerLevel;                                     // 0x0300   (0x0008)  
	UTBP_UI_VoiceChatIndicator_C*                      TBP_UI_VoiceChatIndicator;                                  // 0x0308   (0x0008)  
	int32_t                                            RepresentedPlayerID;                                        // 0x0310   (0x0004)  
	bool                                               bIsHovered;                                                 // 0x0314   (0x0001)  
	bool                                               bShowGroupColor;                                            // 0x0315   (0x0001)  
	bool                                               bShowRankedBanner;                                          // 0x0316   (0x0001)  


	/// Functions
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard.TBP_UI_PlayerCard_C.UpdatePlayerDataSubscription
	void UpdatePlayerDataSubscription(int32_t PreviousID, int32_t CurrentID);                                                // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard.TBP_UI_PlayerCard_C.GetDataFromID
	void GetDataFromID(bool& IsValid, FTigerPlayerStateGameData& OutData);                                                   // [0x197e4f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard.TBP_UI_PlayerCard_C.DisplayGroupColor
	void DisplayGroupColor(bool InShowGroupColor);                                                                           // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard.TBP_UI_PlayerCard_C.DisplayRankedBanner
	void DisplayRankedBanner(bool InShowRankedBanner);                                                                       // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard.TBP_UI_PlayerCard_C.UpdateApperance
	void UpdateApperance();                                                                                                  // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard.TBP_UI_PlayerCard_C.UpdateRepresentedPlayer
	void UpdateRepresentedPlayer(int32_t InRepresentedPlayer);                                                               // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard.TBP_UI_PlayerCard_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard.TBP_UI_PlayerCard_C.Tick
	void Tick(FGeometry MyGeometry, float InDeltaTime);                                                                      // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard.TBP_UI_PlayerCard_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard.TBP_UI_PlayerCard_C.Hover
	void Hover();                                                                                                            // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard.TBP_UI_PlayerCard_C.UnHover
	void UnHover();                                                                                                          // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard.TBP_UI_PlayerCard_C.Press
	void Press();                                                                                                            // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard.TBP_UI_PlayerCard_C.Release
	void Release();                                                                                                          // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard.TBP_UI_PlayerCard_C.Click
	void Click();                                                                                                            // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard.TBP_UI_PlayerCard_C.GameStateDataUpdated
	void GameStateDataUpdated();                                                                                             // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard.TBP_UI_PlayerCard_C.ExecuteUbergraph_TBP_UI_PlayerCard
	void ExecuteUbergraph_TBP_UI_PlayerCard(int32_t EntryPoint);                                                             // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/UI/Widgets/Subwidgets/TBP_UI_Tag_PlayerLevel.TBP_UI_Tag_PlayerLevel_C
/// Size: 0x0084 (0x000280 - 0x000304)
class UTBP_UI_Tag_PlayerLevel_C : public UTigerWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UWidgetAnimation*                                  FadeInBadge;                                                // 0x0288   (0x0008)  
	UImage*                                            Background;                                                 // 0x0290   (0x0008)  
	UCanvasPanel*                                      CanvasPanel;                                                // 0x0298   (0x0008)  
	UNamedSlot*                                        Content;                                                    // 0x02A0   (0x0008)  
	UImage*                                            LeftBackground;                                             // 0x02A8   (0x0008)  
	UImage*                                            LeftOutline;                                                // 0x02B0   (0x0008)  
	UImage*                                            Outline;                                                    // 0x02B8   (0x0008)  
	UTigerStyledRichTextBlock*                         PlayerLevelText;                                            // 0x02C0   (0x0008)  
	UImage*                                            RightBackground;                                            // 0x02C8   (0x0008)  
	UImage*                                            RightOutline;                                               // 0x02D0   (0x0008)  
	FLinearColor                                       OutlineColor;                                               // 0x02D8   (0x0010)  
	FLinearColor                                       BGColor;                                                    // 0x02E8   (0x0010)  
	bool                                               ThinOutline;                                                // 0x02F8   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x02F9   (0x0003)  MISSED
	int32_t                                            RepresentedPlayerID;                                        // 0x02FC   (0x0004)  
	int32_t                                            DisplayedLevel;                                             // 0x0300   (0x0004)  


	/// Functions
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_Tag_PlayerLevel.TBP_UI_Tag_PlayerLevel_C.SetPlayerLevel
	void SetPlayerLevel(int32_t InLevel);                                                                                    // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_Tag_PlayerLevel.TBP_UI_Tag_PlayerLevel_C.GetDataFromID
	void GetDataFromID(bool& IsValid, FTigerPlayerStateGameData& OutData);                                                   // [0x197e4f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_Tag_PlayerLevel.TBP_UI_Tag_PlayerLevel_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_Tag_PlayerLevel.TBP_UI_Tag_PlayerLevel_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_Tag_PlayerLevel.TBP_UI_Tag_PlayerLevel_C.UpdateDisplayedLevel
	void UpdateDisplayedLevel();                                                                                             // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_Tag_PlayerLevel.TBP_UI_Tag_PlayerLevel_C.SetRepresentedPlayer
	void SetRepresentedPlayer(int32_t RepresentedPlayerID);                                                                  // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_Tag_PlayerLevel.TBP_UI_Tag_PlayerLevel_C.PlayerDataUpdated
	void PlayerDataUpdated();                                                                                                // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_Tag_PlayerLevel.TBP_UI_Tag_PlayerLevel_C.WidgetAnimationEvt_FadeInBadge_K2Node_WidgetAnimationEvent
	void WidgetAnimationEvt_FadeInBadge_K2Node_WidgetAnimationEvent();                                                       // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_Tag_PlayerLevel.TBP_UI_Tag_PlayerLevel_C.ExecuteUbergraph_TBP_UI_Tag_PlayerLevel
	void ExecuteUbergraph_TBP_UI_Tag_PlayerLevel(int32_t EntryPoint);                                                        // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/UI/Widgets/Subwidgets/TBP_UI_MaskedCardBorder.TBP_UI_MaskedCardBorder_C
/// Size: 0x0041 (0x000150 - 0x000191)
class UTBP_UI_MaskedCardBorder_C : public UTigerDeferredGroupRetainerBox
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0150   (0x0008)  
	float                                              InitialCornerRadius;                                        // 0x0158   (0x0004)  
	float                                              InitialBorderWidth;                                         // 0x015C   (0x0004)  
	FLinearColor                                       InitialBorderColor;                                         // 0x0160   (0x0010)  
	UTexture2D*                                        InitialWeatheringTexture;                                   // 0x0170   (0x0008)  
	float                                              InitialWeatheringOpacity;                                   // 0x0178   (0x0004)  
	float                                              InitialWeatheringWidth;                                     // 0x017C   (0x0004)  
	float                                              InitialWeatheringFadeWidth;                                 // 0x0180   (0x0004)  
	float                                              InitialWeatheringScale;                                     // 0x0184   (0x0004)  
	FVector2D                                          InitialWeatheringOffset;                                    // 0x0188   (0x0008)  
	bool                                               bRandomizeInitialWeatheringOffset;                          // 0x0190   (0x0001)  


	/// Functions
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_MaskedCardBorder.TBP_UI_MaskedCardBorder_C.SetWeatheringOpacity
	void SetWeatheringOpacity(float InWeatheringOpacity);                                                                    // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_MaskedCardBorder.TBP_UI_MaskedCardBorder_C.RandomizeWeatheringOffset
	void RandomizeWeatheringOffset();                                                                                        // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_MaskedCardBorder.TBP_UI_MaskedCardBorder_C.SetWeatheringOffset
	void SetWeatheringOffset(FVector2D InWeatheringOffset);                                                                  // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_MaskedCardBorder.TBP_UI_MaskedCardBorder_C.SetWeatheringScale
	void SetWeatheringScale(float InWeatheringScale);                                                                        // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_MaskedCardBorder.TBP_UI_MaskedCardBorder_C.SetWeatheringFadeWidth
	void SetWeatheringFadeWidth(float InWeatheringFadeWidth);                                                                // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_MaskedCardBorder.TBP_UI_MaskedCardBorder_C.SetWeatheringWidth
	void SetWeatheringWidth(float InWeatheringWidth);                                                                        // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_MaskedCardBorder.TBP_UI_MaskedCardBorder_C.SetWeatheringTexture
	void SetWeatheringTexture(UTexture2D* InWeatheringTexture);                                                              // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_MaskedCardBorder.TBP_UI_MaskedCardBorder_C.SetBorderColor
	void SetBorderColor(FLinearColor InBorderColor);                                                                         // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_MaskedCardBorder.TBP_UI_MaskedCardBorder_C.SetBorderWidth
	void SetBorderWidth(float InBorderWidth);                                                                                // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_MaskedCardBorder.TBP_UI_MaskedCardBorder_C.SetCornerRadius
	void SetCornerRadius(float InCornerRadius);                                                                              // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_MaskedCardBorder.TBP_UI_MaskedCardBorder_C.InitializeParameters
	void InitializeParameters();                                                                                             // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_MaskedCardBorder.TBP_UI_MaskedCardBorder_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Protected|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_MaskedCardBorder.TBP_UI_MaskedCardBorder_C.ExecuteUbergraph_TBP_UI_MaskedCardBorder
	void ExecuteUbergraph_TBP_UI_MaskedCardBorder(int32_t EntryPoint);                                                       // [0x197e4f0] Final                
};

/// Class /Game/UI/Widgets/TBP_UI_Scrollbar_Bg_Ornament.TBP_UI_Scrollbar_Bg_Ornament_C
/// Size: 0x0064 (0x000260 - 0x0002C4)
class UTBP_UI_Scrollbar_Bg_Ornament_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	UImage*                                            Decoration;                                                 // 0x0268   (0x0008)  
	UImage*                                            Left_Line;                                                  // 0x0270   (0x0008)  
	UImage*                                            LeftArrow;                                                  // 0x0278   (0x0008)  
	UImage*                                            Line;                                                       // 0x0280   (0x0008)  
	UOverlay*                                          Line_Overlay;                                               // 0x0288   (0x0008)  
	UWidgetSwitcher*                                   LineStyleIndex;                                             // 0x0290   (0x0008)  
	UImage*                                            RightArrow;                                                 // 0x0298   (0x0008)  
	UImage*                                            RightLine;                                                  // 0x02A0   (0x0008)  
	USizeBox*                                          SizeBox_Override;                                           // 0x02A8   (0x0008)  
	float                                              ArrowSize;                                                  // 0x02B0   (0x0004)  
	bool                                               EnableMiddleDecoration;                                     // 0x02B4   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x02B5   (0x0003)  MISSED
	UTexture2D*                                        ArrowTexture;                                               // 0x02B8   (0x0008)  
	float                                              LineThickness;                                              // 0x02C0   (0x0004)  


	/// Functions
	// Function /Game/UI/Widgets/TBP_UI_Scrollbar_Bg_Ornament.TBP_UI_Scrollbar_Bg_Ornament_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_Scrollbar_Bg_Ornament.TBP_UI_Scrollbar_Bg_Ornament_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_Scrollbar_Bg_Ornament.TBP_UI_Scrollbar_Bg_Ornament_C.ExecuteUbergraph_TBP_UI_Scrollbar_Bg_Ornament
	void ExecuteUbergraph_TBP_UI_Scrollbar_Bg_Ornament(int32_t EntryPoint);                                                  // [0x197e4f0] Final                
};

/// Class /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard_Minimal.TBP_UI_PlayerCard_Minimal_C
/// Size: 0x0070 (0x000260 - 0x0002D0)
class UTBP_UI_PlayerCard_Minimal_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	UWidgetAnimation*                                  Press_Anim;                                                 // 0x0268   (0x0008)  
	UWidgetAnimation*                                  Highlight_Anim;                                             // 0x0270   (0x0008)  
	UImage*                                            AvatarBackGlow_Image;                                       // 0x0278   (0x0008)  
	UImage*                                            PlatfromIndicator_Image;                                    // 0x0280   (0x0008)  
	UImage*                                            PlayerAvatar_Image;                                         // 0x0288   (0x0008)  
	UTigerStyledRichTextBlock*                         PlayerName_Text;                                            // 0x0290   (0x0008)  
	UImage*                                            RedTint_Avatar_Image;                                       // 0x0298   (0x0008)  
	UImage*                                            StatusDot;                                                  // 0x02A0   (0x0008)  
	UTigerStyledRichTextBlock*                         StatusText;                                                 // 0x02A8   (0x0008)  
	UTBP_UI_MaskedCardBorder_C*                        TBP_UI_MaskedCardBorder_Avatar;                             // 0x02B0   (0x0008)  
	UTBP_UI_Tag_PlayerLevel_C*                         TBP_UI_Tag_PlayerLevel;                                     // 0x02B8   (0x0008)  
	UTBP_UI_VoiceChatIndicator_C*                      TBP_UI_VoiceChatIndicator;                                  // 0x02C0   (0x0008)  
	bool                                               bIsHovered;                                                 // 0x02C8   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x02C9   (0x0003)  MISSED
	int32_t                                            RepresentedPlayerID;                                        // 0x02CC   (0x0004)  


	/// Functions
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard_Minimal.TBP_UI_PlayerCard_Minimal_C.UpdatePlayerDataSubscription
	void UpdatePlayerDataSubscription(int32_t PreviousID, int32_t CurrentID);                                                // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard_Minimal.TBP_UI_PlayerCard_Minimal_C.GetDataFromID
	void GetDataFromID(bool& IsValid, FTigerPlayerStateGameData& OutData);                                                   // [0x197e4f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard_Minimal.TBP_UI_PlayerCard_Minimal_C.UpdateOnlineStatus
	void UpdateOnlineStatus();                                                                                               // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard_Minimal.TBP_UI_PlayerCard_Minimal_C.UpdateRepresentedPlayer
	void UpdateRepresentedPlayer(int32_t InRepresentedPlayer);                                                               // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard_Minimal.TBP_UI_PlayerCard_Minimal_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard_Minimal.TBP_UI_PlayerCard_Minimal_C.Tick
	void Tick(FGeometry MyGeometry, float InDeltaTime);                                                                      // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard_Minimal.TBP_UI_PlayerCard_Minimal_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard_Minimal.TBP_UI_PlayerCard_Minimal_C.Hover
	void Hover();                                                                                                            // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard_Minimal.TBP_UI_PlayerCard_Minimal_C.UnHover
	void UnHover();                                                                                                          // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard_Minimal.TBP_UI_PlayerCard_Minimal_C.Press
	void Press();                                                                                                            // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard_Minimal.TBP_UI_PlayerCard_Minimal_C.Release
	void Release();                                                                                                          // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard_Minimal.TBP_UI_PlayerCard_Minimal_C.Click
	void Click();                                                                                                            // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard_Minimal.TBP_UI_PlayerCard_Minimal_C.GameStateDataUpdated
	void GameStateDataUpdated();                                                                                             // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_PlayerCard_Minimal.TBP_UI_PlayerCard_Minimal_C.ExecuteUbergraph_TBP_UI_PlayerCard_Minimal
	void ExecuteUbergraph_TBP_UI_PlayerCard_Minimal(int32_t EntryPoint);                                                     // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/UI/Widgets/Team/TBP_UI_TeamMenu_Playercard.TBP_UI_TeamMenu_Playercard_C
/// Size: 0x0068 (0x000370 - 0x0003D8)
class UTBP_UI_TeamMenu_Playercard_C : public UTigerUIDPadNavNode
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0370   (0x0008)  
	UWidgetAnimation*                                  HoverMuteButton;                                            // 0x0378   (0x0008)  
	UButton*                                           CardButton;                                                 // 0x0380   (0x0008)  
	UImage*                                            MuteBackGlow;                                               // 0x0388   (0x0008)  
	UButton*                                           MuteButton;                                                 // 0x0390   (0x0008)  
	UImage*                                            MuteButtonBorder;                                           // 0x0398   (0x0008)  
	UCanvasPanel*                                      MuteCanvas;                                                 // 0x03A0   (0x0008)  
	UImage*                                            MuteIcon;                                                   // 0x03A8   (0x0008)  
	UTBP_UI_PlayerCard_C*                              TBP_UI_PlayerCard;                                          // 0x03B0   (0x0008)  
	UTBP_UI_TeamMenu_C*                                Parent;                                                     // 0x03B8   (0x0008)  
	int32_t                                            RepresentedPlayerID;                                        // 0x03C0   (0x0004)  
	bool                                               bIsSelected;                                                // 0x03C4   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x03C5   (0x0003)  MISSED
	FMulticastInlineDelegate                           OnHovered;                                                  // 0x03C8   (0x0010)  


	/// Functions
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu_Playercard.TBP_UI_TeamMenu_Playercard_C.SetShowMute
	void SetShowMute(bool ShowMute);                                                                                         // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu_Playercard.TBP_UI_TeamMenu_Playercard_C.UpdateMuteStatus
	void UpdateMuteStatus();                                                                                                 // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu_Playercard.TBP_UI_TeamMenu_Playercard_C.UpdateRepresentedPlayer
	void UpdateRepresentedPlayer(int32_t InRepresentedPlayerID);                                                             // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu_Playercard.TBP_UI_TeamMenu_Playercard_C.BndEvt__TBP_UI_TeamMenu_Playercard_Button_212_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
	void BndEvt__TBP_UI_TeamMenu_Playercard_Button_212_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu_Playercard.TBP_UI_TeamMenu_Playercard_C.BndEvt__TBP_UI_TeamMenu_Playercard_Button_212_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature
	void BndEvt__TBP_UI_TeamMenu_Playercard_Button_212_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu_Playercard.TBP_UI_TeamMenu_Playercard_C.BndEvt__TBP_UI_TeamMenu_Playercard_Button_212_K2Node_ComponentBoundEvent_4_OnButtonReleasedEvent__DelegateSignature
	void BndEvt__TBP_UI_TeamMenu_Playercard_Button_212_K2Node_ComponentBoundEvent_4_OnButtonReleasedEvent__DelegateSignature(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu_Playercard.TBP_UI_TeamMenu_Playercard_C.BndEvt__TBP_UI_TeamMenu_Playercard_Button_212_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
	void BndEvt__TBP_UI_TeamMenu_Playercard_Button_212_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu_Playercard.TBP_UI_TeamMenu_Playercard_C.BndEvt__TBP_UI_TeamMenu_Playercard_Button_212_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature
	void BndEvt__TBP_UI_TeamMenu_Playercard_Button_212_K2Node_ComponentBoundEvent_0_OnButtonHoverEvent__DelegateSignature(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu_Playercard.TBP_UI_TeamMenu_Playercard_C.BndEvt__TBP_UI_TeamMenu_Playercard_MuteButton_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature
	void BndEvt__TBP_UI_TeamMenu_Playercard_MuteButton_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu_Playercard.TBP_UI_TeamMenu_Playercard_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu_Playercard.TBP_UI_TeamMenu_Playercard_C.BndEvt__TBP_UI_TeamMenu_Playercard_MuteButton_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature
	void BndEvt__TBP_UI_TeamMenu_Playercard_MuteButton_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu_Playercard.TBP_UI_TeamMenu_Playercard_C.BndEvt__TBP_UI_TeamMenu_Playercard_MuteButton_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature
	void BndEvt__TBP_UI_TeamMenu_Playercard_MuteButton_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu_Playercard.TBP_UI_TeamMenu_Playercard_C.OnInteraction
	void OnInteraction();                                                                                                    // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu_Playercard.TBP_UI_TeamMenu_Playercard_C.OnHighlight
	void OnHighlight();                                                                                                      // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu_Playercard.TBP_UI_TeamMenu_Playercard_C.OnUnHightlight
	void OnUnHightlight();                                                                                                   // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu_Playercard.TBP_UI_TeamMenu_Playercard_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu_Playercard.TBP_UI_TeamMenu_Playercard_C.ToggleMute
	void ToggleMute();                                                                                                       // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu_Playercard.TBP_UI_TeamMenu_Playercard_C.ExecuteUbergraph_TBP_UI_TeamMenu_Playercard
	void ExecuteUbergraph_TBP_UI_TeamMenu_Playercard(int32_t EntryPoint);                                                    // [0x197e4f0] Final                
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu_Playercard.TBP_UI_TeamMenu_Playercard_C.OnHovered__DelegateSignature
	void OnHovered__DelegateSignature();                                                                                     // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/Widgets/Team/TBP_UI_ReportMenu.TBP_UI_ReportMenu_C
/// Size: 0x00D0 (0x000318 - 0x0003E8)
class UTBP_UI_ReportMenu_C : public UTigerReportMenuUI
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0318   (0x0008)  
	UImage*                                            Background;                                                 // 0x0320   (0x0008)  
	UTBP_UI_InputPromptCombined_C*                     ClosePrompt;                                                // 0x0328   (0x0008)  
	UVerticalBox*                                      Content;                                                    // 0x0330   (0x0008)  
	UTBP_UI_DPadNavSection_C*                          DPadExitSection;                                            // 0x0338   (0x0008)  
	UTBP_UI_DPadNavSection_C*                          DPadReportingRoot;                                          // 0x0340   (0x0008)  
	UTBP_UI_MenuButton_C*                              Exit;                                                       // 0x0348   (0x0008)  
	UTBP_UI_InputPromptCombined_C*                     ExitPrompt;                                                 // 0x0350   (0x0008)  
	UTBP_UI_Menu_Button_Prompt_Footer_C*               Footer;                                                     // 0x0358   (0x0008)  
	UTBP_UI_Menu_Button_Prompt_Footer_C*               Footer;                                                     // 0x0360   (0x0008)  
	UTBP_UI_InputPrompt_Gamepad_C*                     InputPrompt_Select_Gamepad;                                 // 0x0368   (0x0008)  
	UTBP_UI_InputPrompt_Keyboard_C*                    InputPrompt_Select_Keyboard;                                // 0x0370   (0x0008)  
	UWidgetSwitcher*                                   MenuSwitcher;                                               // 0x0378   (0x0008)  
	UImage*                                            Ornament;                                                   // 0x0380   (0x0008)  
	UCanvasPanel*                                      ReportingContainer;                                         // 0x0388   (0x0008)  
	UTBP_UI_MenuButton_C*                              Send;                                                       // 0x0390   (0x0008)  
	UTBP_UI_Bloodvein_Bg_Menu_C*                       TBP_UI_Bloodvein_Bg_Menu;                                   // 0x0398   (0x0008)  
	UTBP_UI_List_C*                                    TBP_UI_List;                                                // 0x03A0   (0x0008)  
	UTBP_UI_PlayerCard_Minimal_C*                      TBP_UI_PlayerCard_Minimal;                                  // 0x03A8   (0x0008)  
	UTBP_UI_SmallErrorMessage_C*                       TBP_UI_SmallErrorMessage;                                   // 0x03B0   (0x0008)  
	UCanvasPanel*                                      ThankYouContainer;                                          // 0x03B8   (0x0008)  
	UTigerSafeZoneWidget*                              TigerSafeZoneWidget;                                        // 0x03C0   (0x0008)  
	FMulticastInlineDelegate                           OnExitPressed;                                              // 0x03C8   (0x0010)  
	FMulticastInlineDelegate                           OnBackPressed;                                              // 0x03D8   (0x0010)  


	/// Functions
	// Function /Game/UI/Widgets/Team/TBP_UI_ReportMenu.TBP_UI_ReportMenu_C.ResetSelectedItem
	void ResetSelectedItem();                                                                                                // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_ReportMenu.TBP_UI_ReportMenu_C.Init Dpad
	void Init Dpad();                                                                                                        // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_ReportMenu.TBP_UI_ReportMenu_C.UpdateReportErrorMessage
	void UpdateReportErrorMessage(bool bShowError, FText Message);                                                           // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_ReportMenu.TBP_UI_ReportMenu_C.TryReportSelectedPlayer
	void TryReportSelectedPlayer();                                                                                          // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_ReportMenu.TBP_UI_ReportMenu_C.GetReportReasonString
	void GetReportReasonString(ETigerReportReason Reason, FText& NewParam);                                                  // [0x197e4f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_ReportMenu.TBP_UI_ReportMenu_C.CreateReportButtons
	void CreateReportButtons();                                                                                              // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_ReportMenu.TBP_UI_ReportMenu_C.ResetInputBindings
	void ResetInputBindings();                                                                                               // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_ReportMenu.TBP_UI_ReportMenu_C.SetupInputBindings
	void SetupInputBindings();                                                                                               // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_ReportMenu.TBP_UI_ReportMenu_C.BndEvt__TBP_UI_TeamMenu_ClosePrompt_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
	void BndEvt__TBP_UI_TeamMenu_ClosePrompt_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();                    // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Team/TBP_UI_ReportMenu.TBP_UI_ReportMenu_C.BndEvt__TBP_UI_ReportMenu_Send_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature
	void BndEvt__TBP_UI_ReportMenu_Send_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();                         // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Team/TBP_UI_ReportMenu.TBP_UI_ReportMenu_C.BndEvt__TBP_UI_ReportMenu_Exit_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
	void BndEvt__TBP_UI_ReportMenu_Exit_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();                         // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Team/TBP_UI_ReportMenu.TBP_UI_ReportMenu_C.BndEvt__TBP_UI_ReportMenu_ExitPrompt_1_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature
	void BndEvt__TBP_UI_ReportMenu_ExitPrompt_1_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature();                 // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Team/TBP_UI_ReportMenu.TBP_UI_ReportMenu_C.HideError
	void HideError();                                                                                                        // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_ReportMenu.TBP_UI_ReportMenu_C.EscapePressed
	void EscapePressed();                                                                                                    // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_ReportMenu.TBP_UI_ReportMenu_C.OnClose
	void OnClose();                                                                                                          // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_ReportMenu.TBP_UI_ReportMenu_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_ReportMenu.TBP_UI_ReportMenu_C.OnOpen
	void OnOpen();                                                                                                           // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_ReportMenu.TBP_UI_ReportMenu_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_ReportMenu.TBP_UI_ReportMenu_C.ExecuteUbergraph_TBP_UI_ReportMenu
	void ExecuteUbergraph_TBP_UI_ReportMenu(int32_t EntryPoint);                                                             // [0x197e4f0] Final                
	// Function /Game/UI/Widgets/Team/TBP_UI_ReportMenu.TBP_UI_ReportMenu_C.OnBackPressed__DelegateSignature
	void OnBackPressed__DelegateSignature();                                                                                 // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_ReportMenu.TBP_UI_ReportMenu_C.OnExitPressed__DelegateSignature
	void OnExitPressed__DelegateSignature();                                                                                 // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/Widgets/Team/TBP_UI_TeamMenu.TBP_UI_TeamMenu_C
/// Size: 0x01F8 (0x0002C0 - 0x0004B8)
class UTBP_UI_TeamMenu_C : public UTigerTeamMenuUI
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C0   (0x0008)  
	UImage*                                            Background;                                                 // 0x02C8   (0x0008)  
	UTBP_UI_InputMenuPrompt_C*                         BackPrompt;                                                 // 0x02D0   (0x0008)  
	UTBP_UI_InputPromptCombined_C*                     ClosePrompt;                                                // 0x02D8   (0x0008)  
	UTBP_UI_InputPromptCombined_C*                     ClosePrompt;                                                // 0x02E0   (0x0008)  
	UTigerStyledRichTextBlock*                         Description_Text;                                           // 0x02E8   (0x0008)  
	UTBP_UI_DPadNavSection_C*                          DPad_NavRoot;                                               // 0x02F0   (0x0008)  
	UTBP_UI_Scrollbox_C*                               EnemyListScrollBox;                                         // 0x02F8   (0x0008)  
	UVerticalBox*                                      EnemyTeamList;                                              // 0x0300   (0x0008)  
	UTBP_UI_DPadNavSection_C*                          EnemyTeamSection;                                           // 0x0308   (0x0008)  
	UTBP_UI_Menu_Button_Prompt_Footer_C*               Footer;                                                     // 0x0310   (0x0008)  
	UTBP_UI_Menu_Button_Prompt_Footer_C*               Footer;                                                     // 0x0318   (0x0008)  
	UTBP_UI_Menu_Button_Prompt_Footer_C*               Footer;                                                     // 0x0320   (0x0008)  
	UTBP_UI_DPadNavSection_C*                          FriendlyTeamSection;                                        // 0x0328   (0x0008)  
	UTBP_UI_InputPrompt_Gamepad_C*                     InputPrompt_Select_Gamepad;                                 // 0x0330   (0x0008)  
	UTBP_UI_InputPrompt_Gamepad_C*                     InputPrompt_Select_Gamepad;                                 // 0x0338   (0x0008)  
	UTBP_UI_InputPrompt_Gamepad_C*                     InputPrompt_Select_Gamepad;                                 // 0x0340   (0x0008)  
	UTBP_UI_InputPrompt_Keyboard_C*                    InputPrompt_Select_Keyboard;                                // 0x0348   (0x0008)  
	UTBP_UI_InputPrompt_Keyboard_C*                    InputPrompt_Select_Keyboard;                                // 0x0350   (0x0008)  
	UTBP_UI_InputPrompt_Keyboard_C*                    InputPrompt_Select_Keyboard;                                // 0x0358   (0x0008)  
	UTBP_UI_TeamMenu_Playercard_C*                     LocalPlayerCard;                                            // 0x0360   (0x0008)  
	UTBP_UI_TeamMenu_Playercard_C*                     LocalPlayerCard2;                                           // 0x0368   (0x0008)  
	UWidgetSwitcher*                                   MenuSwitcher;                                               // 0x0370   (0x0008)  
	UTBP_UI_MenuButton_C*                              MuteButton;                                                 // 0x0378   (0x0008)  
	UTBP_UI_DPadNavSection_C*                          NotTDMGroupListSection;                                     // 0x0380   (0x0008)  
	UCanvasPanel*                                      PlayerActionMenu;                                           // 0x0388   (0x0008)  
	UTigerStyledRichTextBlock*                         PlayerActions;                                              // 0x0390   (0x0008)  
	UVerticalBox*                                      PlayerList;                                                 // 0x0398   (0x0008)  
	UTBP_UI_MenuButton_C*                              ReportButton;                                               // 0x03A0   (0x0008)  
	URetainerBox*                                      RetainerBox;                                                // 0x03A8   (0x0008)  
	URetainerBox*                                      RetainerBox;                                                // 0x03B0   (0x0008)  
	UTBP_UI_Bloodvein_Bg_Menu_C*                       TBP_UI_Bloodvein_Bg_Menu;                                   // 0x03B8   (0x0008)  
	UTBP_UI_Divider_C*                                 TBP_UI_Divider;                                             // 0x03C0   (0x0008)  
	UTBP_UI_Divider_C*                                 TBP_UI_Divider;                                             // 0x03C8   (0x0008)  
	UTBP_UI_InputPrompt_C*                             TBP_UI_InputPrompt;                                         // 0x03D0   (0x0008)  
	UTBP_UI_InputPrompt_C*                             TBP_UI_InputPrompt;                                         // 0x03D8   (0x0008)  
	UTBP_UI_MuteGroupInputPrompt_C*                    TBP_UI_MuteGroupInputPrompt;                                // 0x03E0   (0x0008)  
	UTBP_UI_PlayerCard_Minimal_C*                      TBP_UI_PlayerCard_Minimal;                                  // 0x03E8   (0x0008)  
	UTBP_UI_TeamMenu_Playercard_C*                     TBP_UI_TeamMenu_Playercard;                                 // 0x03F0   (0x0008)  
	UTBP_UI_TeamMenu_Playercard_C*                     TBP_UI_TeamMenu_Playercard;                                 // 0x03F8   (0x0008)  
	UTBP_UI_TeamMenu_Playercard_C*                     TBP_UI_TeamMenu_Playercard;                                 // 0x0400   (0x0008)  
	UTigerStyledRichTextBlock*                         TDMEnemyTeamTitle;                                          // 0x0408   (0x0008)  
	UCanvasPanel*                                      TDMMenu;                                                    // 0x0410   (0x0008)  
	UVerticalBox*                                      TDMYourGroupList;                                           // 0x0418   (0x0008)  
	UVerticalBox*                                      TDMYourTeamList;                                            // 0x0420   (0x0008)  
	UTigerStyledRichTextBlock*                         TDMYourTeamTitle;                                           // 0x0428   (0x0008)  
	UTBP_UI_Scrollbox_C*                               TeamListScrollBox;                                          // 0x0430   (0x0008)  
	UTigerSafeZoneWidget*                              TigerSafeZoneWidget;                                        // 0x0438   (0x0008)  
	UTigerStyledRichTextBlock*                         TigerStyledRichTextBlock;                                   // 0x0440   (0x0008)  
	UTigerStyledRichTextBlock*                         Title_Text;                                                 // 0x0448   (0x0008)  
	UTigerStyledRichTextBlock*                         Title_Text;                                                 // 0x0450   (0x0008)  
	UCanvasPanel*                                      YourGroupMenu;                                              // 0x0458   (0x0008)  
	TArray<ATigerPlayerState*>                         GroupMembers;                                               // 0x0460   (0x0010)  
	UTBP_UI_TeamMenu_Playercard_C*                     SelectedCard;                                               // 0x0470   (0x0008)  
	FText                                              MuteText;                                                   // 0x0478   (0x0018)  
	FText                                              UnmuteText;                                                 // 0x0490   (0x0018)  
	ATigerPlayerController*                            PlayerController;                                           // 0x04A8   (0x0008)  
	UTigerUIDPadNavNode*                               LastHighlightedNode;                                        // 0x04B0   (0x0008)  


	/// Functions
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu.TBP_UI_TeamMenu_C.SetDirectionalReferencesForTeamCards
	void SetDirectionalReferencesForTeamCards();                                                                             // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu.TBP_UI_TeamMenu_C.ScrollToWidgetInScrollBox
	void ScrollToWidgetInScrollBox();                                                                                        // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu.TBP_UI_TeamMenu_C.AssignDPadRootToFirstPlayer
	void AssignDPadRootToFirstPlayer();                                                                                      // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu.TBP_UI_TeamMenu_C.CreateCard
	void CreateCard(UVerticalBox* List, int32_t PlayerId, FMargin Margin, bool IsGrouped);                                   // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu.TBP_UI_TeamMenu_C.CreateTDMPlayerCards
	void CreateTDMPlayerCards();                                                                                             // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu.TBP_UI_TeamMenu_C.CreateTeamPlayerCards
	void CreateTeamPlayerCards();                                                                                            // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu.TBP_UI_TeamMenu_C.CreatePlayerCards
	void CreatePlayerCards();                                                                                                // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu.TBP_UI_TeamMenu_C.ResetInputBindings
	void ResetInputBindings();                                                                                               // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu.TBP_UI_TeamMenu_C.SetupInputBindings
	void SetupInputBindings();                                                                                               // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu.TBP_UI_TeamMenu_C.OpenReportMenu
	void OpenReportMenu(int32_t TargetPlayerID);                                                                             // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu.TBP_UI_TeamMenu_C.EscapePressed
	void EscapePressed();                                                                                                    // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu.TBP_UI_TeamMenu_C.BndEvt__TBP_UI_TeamMenu_ClosePrompt_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
	void BndEvt__TBP_UI_TeamMenu_ClosePrompt_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();                    // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu.TBP_UI_TeamMenu_C.OpenPlayerActionMenu
	void OpenPlayerActionMenu(int32_t InSelectedPlayer);                                                                     // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu.TBP_UI_TeamMenu_C.OnClose
	void OnClose();                                                                                                          // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu.TBP_UI_TeamMenu_C.OnOpen
	void OnOpen();                                                                                                           // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu.TBP_UI_TeamMenu_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu.TBP_UI_TeamMenu_C.BndEvt__TBP_UI_TeamMenu_ClosePrompt_1_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
	void BndEvt__TBP_UI_TeamMenu_ClosePrompt_1_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();                  // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu.TBP_UI_TeamMenu_C.BindGamepadMuteAction
	void BindGamepadMuteAction();                                                                                            // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu.TBP_UI_TeamMenu_C.UnbindGamepadMuteAction
	void UnbindGamepadMuteAction();                                                                                          // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu.TBP_UI_TeamMenu_C.GamepadMenuSecondaryPressed
	void GamepadMenuSecondaryPressed();                                                                                      // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu.TBP_UI_TeamMenu_C.OnReportMenuClosed
	void OnReportMenuClosed();                                                                                               // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Team/TBP_UI_TeamMenu.TBP_UI_TeamMenu_C.ExecuteUbergraph_TBP_UI_TeamMenu
	void ExecuteUbergraph_TBP_UI_TeamMenu(int32_t EntryPoint);                                                               // [0x197e4f0] Final                
};

/// Class /Game/UI/Widgets/Boot/TBP_UI_TitleError.TBP_UI_TitleError_C
/// Size: 0x0068 (0x000290 - 0x0002F8)
class UTBP_UI_TitleError_C : public UTigerTitleErrorUI
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0290   (0x0008)  
	UTBP_UI_DPadNavSection_C*                          DPad_Root;                                                  // 0x0298   (0x0008)  
	UTigerStyledRichTextBlock*                         ErrorCodeBlock;                                             // 0x02A0   (0x0008)  
	UTigerStyledRichTextBlock*                         MessageTextBlock;                                           // 0x02A8   (0x0008)  
	UHorizontalBox*                                    RetryDelayBox;                                              // 0x02B0   (0x0008)  
	UTigerStyledRichTextBlock*                         RetryDelayDurationText;                                     // 0x02B8   (0x0008)  
	UTBP_UI_MenuButton_C*                              TBP_UI_MenuButton_Exit;                                     // 0x02C0   (0x0008)  
	UTBP_UI_MenuButton_C*                              TBP_UI_MenuButton_Retry;                                    // 0x02C8   (0x0008)  
	UTBP_UI_Popup_Base_C*                              TBP_UI_Popup_Base;                                          // 0x02D0   (0x0008)  
	UTigerStyledRichTextBlock*                         TitleTextBlock;                                             // 0x02D8   (0x0008)  
	FMulticastInlineDelegate                           OnRetry;                                                    // 0x02E0   (0x0010)  
	FTimerHandle                                       RetryDelayTimerHandle;                                      // 0x02F0   (0x0008)  


	/// Functions
	// Function /Game/UI/Widgets/Boot/TBP_UI_TitleError.TBP_UI_TitleError_C.CanRetry
	void CanRetry(bool& Output);                                                                                             // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Widgets/Boot/TBP_UI_TitleError.TBP_UI_TitleError_C.UpdateRetryVisibility
	void UpdateRetryVisibility();                                                                                            // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Boot/TBP_UI_TitleError.TBP_UI_TitleError_C.DisableRetry
	void DisableRetry();                                                                                                     // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Boot/TBP_UI_TitleError.TBP_UI_TitleError_C.EnabledRetry
	void EnabledRetry();                                                                                                     // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Boot/TBP_UI_TitleError.TBP_UI_TitleError_C.UpdateRetryDelay
	void UpdateRetryDelay();                                                                                                 // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Boot/TBP_UI_TitleError.TBP_UI_TitleError_C.OnOpen
	void OnOpen();                                                                                                           // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/UI/Widgets/Boot/TBP_UI_TitleError.TBP_UI_TitleError_C.BndEvt__TBP_UI_MenuButton_Exit_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature
	void BndEvt__TBP_UI_MenuButton_Exit_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();                         // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Boot/TBP_UI_TitleError.TBP_UI_TitleError_C.BndEvt__TBP_UI_MenuButton_Retry_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature
	void BndEvt__TBP_UI_MenuButton_Retry_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature();                        // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Boot/TBP_UI_TitleError.TBP_UI_TitleError_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Boot/TBP_UI_TitleError.TBP_UI_TitleError_C.BndEvt__TBP_UI_TitleError_TBP_UI_MenuButton_Retry_K2Node_ComponentBoundEvent_0_OnNodeStateChange__DelegateSignature
	void BndEvt__TBP_UI_TitleError_TBP_UI_MenuButton_Retry_K2Node_ComponentBoundEvent_0_OnNodeStateChange__DelegateSignature(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Boot/TBP_UI_TitleError.TBP_UI_TitleError_C.BndEvt__TBP_UI_TitleError_TBP_UI_MenuButton_Exit_K2Node_ComponentBoundEvent_1_OnNodeStateChange__DelegateSignature
	void BndEvt__TBP_UI_TitleError_TBP_UI_MenuButton_Exit_K2Node_ComponentBoundEvent_1_OnNodeStateChange__DelegateSignature(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Boot/TBP_UI_TitleError.TBP_UI_TitleError_C.ExecuteUbergraph_TBP_UI_TitleError
	void ExecuteUbergraph_TBP_UI_TitleError(int32_t EntryPoint);                                                             // [0x197e4f0] Final|HasDefaults    
	// Function /Game/UI/Widgets/Boot/TBP_UI_TitleError.TBP_UI_TitleError_C.OnRetry__DelegateSignature
	void OnRetry__DelegateSignature();                                                                                       // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/Widgets/Elysium/Groups/TBP_UI_GroupInvitation.TBP_UI_GroupInvitation_C
/// Size: 0x0029 (0x000280 - 0x0002A9)
class UTBP_UI_GroupInvitation_C : public UTigerWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UTBP_UI_ConfirmMenu_C*                             TBP_UI_ConfirmMenu;                                         // 0x0288   (0x0008)  
	FTigerGroupInvitation                              Invite;                                                     // 0x0290   (0x0010)  
	ATigerPlayerState*                                 Inviter;                                                    // 0x02A0   (0x0008)  
	bool                                               HasHandledInvite;                                           // 0x02A8   (0x0001)  


	/// Functions
	// Function /Game/UI/Widgets/Elysium/Groups/TBP_UI_GroupInvitation.TBP_UI_GroupInvitation_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/Groups/TBP_UI_GroupInvitation.TBP_UI_GroupInvitation_C.BndEvt__TBP_UI_ConfirmMenu_K2Node_ComponentBoundEvent_0_Confirm__DelegateSignature
	void BndEvt__TBP_UI_ConfirmMenu_K2Node_ComponentBoundEvent_0_Confirm__DelegateSignature();                               // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Elysium/Groups/TBP_UI_GroupInvitation.TBP_UI_GroupInvitation_C.BndEvt__TBP_UI_ConfirmMenu_K2Node_ComponentBoundEvent_4_Decline__DelegateSignature
	void BndEvt__TBP_UI_ConfirmMenu_K2Node_ComponentBoundEvent_4_Decline__DelegateSignature();                               // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Elysium/Groups/TBP_UI_GroupInvitation.TBP_UI_GroupInvitation_C.Destruct
	void Destruct();                                                                                                         // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/Groups/TBP_UI_GroupInvitation.TBP_UI_GroupInvitation_C.ExecuteUbergraph_TBP_UI_GroupInvitation
	void ExecuteUbergraph_TBP_UI_GroupInvitation(int32_t EntryPoint);                                                        // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/UI/Widgets/Loading/TBP_LoadingToolTip.TBP_LoadingToolTip_C
/// Size: 0x0014 (0x000030 - 0x000044)
class UTBP_LoadingToolTip_C : public UPrimaryDataAsset
{ 
public:
	TArray<FTS_LoadingTip>                             LoadingTips;                                                // 0x0030   (0x0010)  
	int32_t                                            SecondsBetweenLoadingTips;                                  // 0x0040   (0x0004)  
};

/// Class /Game/UI/Widgets/Loading/TBP_LoadingScreen_Simple.TBP_LoadingScreen_Simple_C
/// Size: 0x0050 (0x000078 - 0x0000C8)
class UTBP_LoadingScreen_Simple_C : public UTigerLoadingScreenAsset
{ 
public:
	TWeakObjectPtr<UTBP_LoadingToolTip_C*>             Tooltips;                                                   // 0x0078   (0x0028)  
	TWeakObjectPtr<UMaterialInterface*>                BackgroundMaterial;                                         // 0x00A0   (0x0028)  


	/// Functions
	// Function /Game/UI/Widgets/Loading/TBP_LoadingScreen_Simple.TBP_LoadingScreen_Simple_C.PrepareAssets
	void PrepareAssets(TArray<FSoftObjectPath>& OutAssetsToLoad);                                                            // [0x197e4f0] Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/Widgets/InputInstructions/TBP_UI_InputMenuPrompt.TBP_UI_InputMenuPrompt_C
/// Size: 0x0099 (0x000370 - 0x000409)
class UTBP_UI_InputMenuPrompt_C : public UTigerUIDPadNavNode
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0370   (0x0008)  
	UButton*                                           Button;                                                     // 0x0378   (0x0008)  
	UTBP_UI_InputPrompt_Gamepad_C*                     InputPrompt_Gamepad;                                        // 0x0380   (0x0008)  
	UTBP_UI_InputPrompt_Keyboard_C*                    InputPrompt_Keyboard;                                       // 0x0388   (0x0008)  
	UWidgetSwitcher*                                   InputSwitcher;                                              // 0x0390   (0x0008)  
	FText                                              PrefixText;                                                 // 0x0398   (0x0018)  
	FText                                              PostfixTest;                                                // 0x03B0   (0x0018)  
	FName                                              InputAction;                                                // 0x03C8   (0x0008)  
	bool                                               bListenForInput;                                            // 0x03D0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x03D1   (0x0007)  MISSED
	FMulticastInlineDelegate                           OnInputPressed;                                             // 0x03D8   (0x0010)  
	bool                                               IsClickable;                                                // 0x03E8   (0x0001)  
	unsigned char                                      UnknownData01_5[0x7];                                       // 0x03E9   (0x0007)  MISSED
	FMulticastInlineDelegate                           OnClicked;                                                  // 0x03F0   (0x0010)  
	bool                                               bShowCustomOpacity;                                         // 0x0400   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x0401   (0x0003)  MISSED
	float                                              CustomOpacity;                                              // 0x0404   (0x0004)  
	bool                                               bIsHoldAction;                                              // 0x0408   (0x0001)  


	/// Functions
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputMenuPrompt.TBP_UI_InputMenuPrompt_C.UpdatePromptVisibility
	void UpdatePromptVisibility();                                                                                           // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputMenuPrompt.TBP_UI_InputMenuPrompt_C.SetText
	void SetText(FText InText);                                                                                              // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputMenuPrompt.TBP_UI_InputMenuPrompt_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputMenuPrompt.TBP_UI_InputMenuPrompt_C.OnInitialized
	void OnInitialized();                                                                                                    // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputMenuPrompt.TBP_UI_InputMenuPrompt_C.Internal_OnInputPressed
	void Internal_OnInputPressed();                                                                                          // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputMenuPrompt.TBP_UI_InputMenuPrompt_C.BndEvt__TBP_UI_InputMenuPrompt_Button_107_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	void BndEvt__TBP_UI_InputMenuPrompt_Button_107_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();   // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputMenuPrompt.TBP_UI_InputMenuPrompt_C.BndEvt__TBP_UI_InputMenuPrompt_Button_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature
	void BndEvt__TBP_UI_InputMenuPrompt_Button_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();         // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputMenuPrompt.TBP_UI_InputMenuPrompt_C.BndEvt__TBP_UI_InputMenuPrompt_Button_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature
	void BndEvt__TBP_UI_InputMenuPrompt_Button_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature();         // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputMenuPrompt.TBP_UI_InputMenuPrompt_C.SetClickability
	void SetClickability(bool Index);                                                                                        // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputMenuPrompt.TBP_UI_InputMenuPrompt_C.OnUseGamepadChanged
	void OnUseGamepadChanged(bool bNewIsProbablyUsingGamepad);                                                               // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputMenuPrompt.TBP_UI_InputMenuPrompt_C.OnHighlight
	void OnHighlight();                                                                                                      // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputMenuPrompt.TBP_UI_InputMenuPrompt_C.OnUnHightlight
	void OnUnHightlight();                                                                                                   // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputMenuPrompt.TBP_UI_InputMenuPrompt_C.OnInteraction
	void OnInteraction();                                                                                                    // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputMenuPrompt.TBP_UI_InputMenuPrompt_C.ExecuteUbergraph_TBP_UI_InputMenuPrompt
	void ExecuteUbergraph_TBP_UI_InputMenuPrompt(int32_t EntryPoint);                                                        // [0x197e4f0] Final                
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputMenuPrompt.TBP_UI_InputMenuPrompt_C.OnClicked__DelegateSignature
	void OnClicked__DelegateSignature();                                                                                     // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputMenuPrompt.TBP_UI_InputMenuPrompt_C.OnInputPressed__DelegateSignature
	void OnInputPressed__DelegateSignature();                                                                                // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/Widgets/InputInstructions/TBP_UI_InputPrompt.TBP_UI_InputPrompt_C
/// Size: 0x00D4 (0x000280 - 0x000354)
class UTBP_UI_InputPrompt_C : public UTigerWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UTigerStyledRichTextBlock*                         Hold_TextBlock;                                             // 0x0288   (0x0008)  
	UButton*                                           InputPrompt_Button;                                         // 0x0290   (0x0008)  
	UCanvasPanel*                                      InputPrompt_Container;                                      // 0x0298   (0x0008)  
	UImage*                                            Key_Image;                                                  // 0x02A0   (0x0008)  
	UTigerStyledRichTextBlock*                         Post_TextBlock;                                             // 0x02A8   (0x0008)  
	UTigerStyledRichTextBlock*                         Pre_TextBlock;                                              // 0x02B0   (0x0008)  
	FMulticastInlineDelegate                           Clicked;                                                    // 0x02B8   (0x0010)  
	FMulticastInlineDelegate                           Hovered;                                                    // 0x02C8   (0x0010)  
	FMulticastInlineDelegate                           UnHovered;                                                  // 0x02D8   (0x0010)  
	bool                                               bIsHoldAction;                                              // 0x02E8   (0x0001)  
	bool                                               bIsDisabled;                                                // 0x02E9   (0x0001)  
	bool                                               bIsClickable;                                               // 0x02EA   (0x0001)  
	bool                                               bIsHovered;                                                 // 0x02EB   (0x0001)  
	bool                                               bIsValidTexture;                                            // 0x02EC   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x02ED   (0x0003)  MISSED
	FName                                              Keyboard_Action;                                            // 0x02F0   (0x0008)  
	FName                                              Gamepad_Action;                                             // 0x02F8   (0x0008)  
	UTexture2D*                                        Keyboard_Texture;                                           // 0x0300   (0x0008)  
	UTexture2D*                                        Gamepad_Texture;                                            // 0x0308   (0x0008)  
	FText                                              Pre_Text;                                                   // 0x0310   (0x0018)  
	FText                                              Post_Text;                                                  // 0x0328   (0x0018)  
	UTigerKeyTextureMapping*                           KeyTextureMapping;                                          // 0x0340   (0x0008)  
	UTigerKeyTextureMapping*                           KeyTextureMappingXbox;                                      // 0x0348   (0x0008)  
	float                                              CustomOpacity;                                              // 0x0350   (0x0004)  


	/// Functions
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputPrompt.TBP_UI_InputPrompt_C.UpdateActionTexture
	void UpdateActionTexture(FName InAction, bool bInIsGamepad, UTexture2D*& OutTexture);                                    // [0x197e4f0] Private|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputPrompt.TBP_UI_InputPrompt_C.UpdateVisiblilty
	void UpdateVisiblilty();                                                                                                 // [0x197e4f0] Private|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputPrompt.TBP_UI_InputPrompt_C.UpdateIsUsingGamepad
	void UpdateIsUsingGamepad(bool bIsUsingGamepad);                                                                         // [0x197e4f0] Private|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputPrompt.TBP_UI_InputPrompt_C.SetCustomOpacity
	void SetCustomOpacity(float CustomOpacity);                                                                              // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputPrompt.TBP_UI_InputPrompt_C.SetActionGamepad
	void SetActionGamepad(FName Gamepad_Action);                                                                             // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputPrompt.TBP_UI_InputPrompt_C.SetActionKeyboard
	void SetActionKeyboard(FName Keyboard_Action);                                                                           // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputPrompt.TBP_UI_InputPrompt_C.SetIsDisabled
	void SetIsDisabled(bool bIsDisabled);                                                                                    // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputPrompt.TBP_UI_InputPrompt_C.SetIsClickable
	void SetIsClickable(bool bIsClickable);                                                                                  // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputPrompt.TBP_UI_InputPrompt_C.SetIsHoldAction
	void SetIsHoldAction(bool bIsHoldIcon);                                                                                  // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputPrompt.TBP_UI_InputPrompt_C.SetPreText
	void SetPreText(FText& InText);                                                                                          // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputPrompt.TBP_UI_InputPrompt_C.SetPostText
	void SetPostText(FText& InText);                                                                                         // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputPrompt.TBP_UI_InputPrompt_C.BndEvt__TBP_UI_InputPrompt_InputPrompt_Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	void BndEvt__TBP_UI_InputPrompt_InputPrompt_Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputPrompt.TBP_UI_InputPrompt_C.BndEvt__TBP_UI_InputPrompt_InputPrompt_Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
	void BndEvt__TBP_UI_InputPrompt_InputPrompt_Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputPrompt.TBP_UI_InputPrompt_C.BndEvt__TBP_UI_InputPrompt_InputPrompt_Button_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature
	void BndEvt__TBP_UI_InputPrompt_InputPrompt_Button_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputPrompt.TBP_UI_InputPrompt_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputPrompt.TBP_UI_InputPrompt_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputPrompt.TBP_UI_InputPrompt_C.EventKeyBindingChanged
	void EventKeyBindingChanged(FInputActionKeyMapping& OldKeyBinding, FInputActionKeyMapping& NewKeyBinding);               // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputPrompt.TBP_UI_InputPrompt_C.EventAxisBindingChanged
	void EventAxisBindingChanged(FInputAxisKeyMapping& OldKeyBinding, FInputAxisKeyMapping& NewKeyBinding);                  // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputPrompt.TBP_UI_InputPrompt_C.EventBindingsReset
	void EventBindingsReset(bool bInResetKeyboard, bool bInResetGamepad);                                                    // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputPrompt.TBP_UI_InputPrompt_C.Destruct
	void Destruct();                                                                                                         // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputPrompt.TBP_UI_InputPrompt_C.EventPresetChanged
	void EventPresetChanged();                                                                                               // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputPrompt.TBP_UI_InputPrompt_C.ExecuteUbergraph_TBP_UI_InputPrompt
	void ExecuteUbergraph_TBP_UI_InputPrompt(int32_t EntryPoint);                                                            // [0x197e4f0] Final|HasDefaults    
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputPrompt.TBP_UI_InputPrompt_C.UnHovered__DelegateSignature
	void UnHovered__DelegateSignature();                                                                                     // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputPrompt.TBP_UI_InputPrompt_C.Hovered__DelegateSignature
	void Hovered__DelegateSignature();                                                                                       // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_InputPrompt.TBP_UI_InputPrompt_C.Clicked__DelegateSignature
	void Clicked__DelegateSignature();                                                                                       // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/Widgets/Group/TBP_UI_MuteGroupInputPrompt.TBP_UI_MuteGroupInputPrompt_C
/// Size: 0x003D (0x000354 - 0x000391)
class UTBP_UI_MuteGroupInputPrompt_C : public UTBP_UI_InputPrompt_C
{ 
public:
	unsigned char                                      UnknownData00_2[0x4];                                       // 0x0354   (0x0004)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0358   (0x0008)  
	FText                                              MuteGroupText;                                              // 0x0360   (0x0018)  
	FText                                              UnmuteGroupText;                                            // 0x0378   (0x0018)  
	bool                                               bIsAnyGroupMemberUnmuted;                                   // 0x0390   (0x0001)  


	/// Functions
	// Function /Game/UI/Widgets/Group/TBP_UI_MuteGroupInputPrompt.TBP_UI_MuteGroupInputPrompt_C.MuteGroupMembers
	void MuteGroupMembers(bool bInMute);                                                                                     // [0x197e4f0] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Group/TBP_UI_MuteGroupInputPrompt.TBP_UI_MuteGroupInputPrompt_C.ToggleMute
	void ToggleMute();                                                                                                       // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Group/TBP_UI_MuteGroupInputPrompt.TBP_UI_MuteGroupInputPrompt_C.UnmutePlayer
	void UnmutePlayer(ATigerPlayerState* InPlayerState);                                                                     // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Group/TBP_UI_MuteGroupInputPrompt.TBP_UI_MuteGroupInputPrompt_C.MutePlayer
	void MutePlayer(ATigerPlayerState* InPlayerState);                                                                       // [0x197e4f0] Protected|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Group/TBP_UI_MuteGroupInputPrompt.TBP_UI_MuteGroupInputPrompt_C.EvaluateMuteStatus
	void EvaluateMuteStatus();                                                                                               // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Group/TBP_UI_MuteGroupInputPrompt.TBP_UI_MuteGroupInputPrompt_C.CheckMuteStatus
	void CheckMuteStatus(ATigerPlayerState* InPlayerState);                                                                  // [0x197e4f0] Protected|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Group/TBP_UI_MuteGroupInputPrompt.TBP_UI_MuteGroupInputPrompt_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Group/TBP_UI_MuteGroupInputPrompt.TBP_UI_MuteGroupInputPrompt_C.Enable
	void Enable();                                                                                                           // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Group/TBP_UI_MuteGroupInputPrompt.TBP_UI_MuteGroupInputPrompt_C.Disable
	void Disable();                                                                                                          // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Group/TBP_UI_MuteGroupInputPrompt.TBP_UI_MuteGroupInputPrompt_C.ExecuteUbergraph_TBP_UI_MuteGroupInputPrompt
	void ExecuteUbergraph_TBP_UI_MuteGroupInputPrompt(int32_t EntryPoint);                                                   // [0x197e4f0] Final                
};

/// Class /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularSeparator.TBP_UI_ModularSeparator_C
/// Size: 0x0049 (0x000280 - 0x0002C9)
class UTBP_UI_ModularSeparator_C : public UTigerWidget
{ 
public:
	UWidgetAnimation*                                  Hover;                                                      // 0x0280   (0x0008)  
	UImage*                                            ArrowLeft;                                                  // 0x0288   (0x0008)  
	UImage*                                            ArrowLeftHighlight;                                         // 0x0290   (0x0008)  
	UImage*                                            ArrowRight;                                                 // 0x0298   (0x0008)  
	UImage*                                            ArrowRightHighlight;                                        // 0x02A0   (0x0008)  
	UImage*                                            BrightMiddle;                                               // 0x02A8   (0x0008)  
	UImage*                                            Middle;                                                     // 0x02B0   (0x0008)  
	UImage*                                            MiddleHighlight;                                            // 0x02B8   (0x0008)  
	UImage*                                            Shine;                                                      // 0x02C0   (0x0008)  
	bool                                               bIsHovered;                                                 // 0x02C8   (0x0001)  


	/// Functions
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularSeparator.TBP_UI_ModularSeparator_C.DeactivateHover
	void DeactivateHover();                                                                                                  // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularSeparator.TBP_UI_ModularSeparator_C.ActivateHover
	void ActivateHover();                                                                                                    // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularSeparator.TBP_UI_ModularSeparator_C.PlayHoverAnimation
	void PlayHoverAnimation(bool InReverse);                                                                                 // [0x197e4f0] Private|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularListHeading.TBP_UI_ModularListHeading_C
/// Size: 0x0038 (0x000280 - 0x0002B8)
class UTBP_UI_ModularListHeading_C : public UTigerWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UWidgetAnimation*                                  HoverAbove;                                                 // 0x0288   (0x0008)  
	UWidgetAnimation*                                  HoverBelow;                                                 // 0x0290   (0x0008)  
	UTigerStyledRichTextBlock*                         TextBlock;                                                  // 0x0298   (0x0008)  
	FText                                              Text;                                                       // 0x02A0   (0x0018)  


	/// Functions
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularListHeading.TBP_UI_ModularListHeading_C.RemoveUpperPadding
	void RemoveUpperPadding();                                                                                               // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularListHeading.TBP_UI_ModularListHeading_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularListHeading.TBP_UI_ModularListHeading_C.ExecuteUbergraph_TBP_UI_ModularListHeading
	void ExecuteUbergraph_TBP_UI_ModularListHeading(int32_t EntryPoint);                                                     // [0x197e4f0] Final                
};

/// Class /Game/UI/Widgets/SystemMenu/TBP_UI_GamepadInputDiagram_Label.TBP_UI_GamepadInputDiagram_Label_C
/// Size: 0x0020 (0x0002E0 - 0x000300)
class UTBP_UI_GamepadInputDiagram_Label_C : public UTigerControllerDiagramLabel
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02E0   (0x0008)  
	UTigerStyledRichTextBlock*                         ActionNameTextBlock;                                        // 0x02E8   (0x0008)  
	UTBP_UI_GamepadIcon_C*                             GamepadIcon_Centre;                                         // 0x02F0   (0x0008)  
	UTBP_UI_GamepadIcon_C*                             GamepadIcon_LeftRight;                                      // 0x02F8   (0x0008)  


	/// Functions
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_GamepadInputDiagram_Label.TBP_UI_GamepadInputDiagram_Label_C.SetAlignment
	void SetAlignment(TEnumAsByte<EHorizontalAlignment> InAlignment);                                                        // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_GamepadInputDiagram_Label.TBP_UI_GamepadInputDiagram_Label_C.OnSetActionName
	void OnSetActionName();                                                                                                  // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_GamepadInputDiagram_Label.TBP_UI_GamepadInputDiagram_Label_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_GamepadInputDiagram_Label.TBP_UI_GamepadInputDiagram_Label_C.ExecuteUbergraph_TBP_UI_GamepadInputDiagram_Label
	void ExecuteUbergraph_TBP_UI_GamepadInputDiagram_Label(int32_t EntryPoint);                                              // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/UI/Widgets/SystemMenu/TBP_UI_TwoButtonDialog.TBP_UI_TwoButtonDialog_C
/// Size: 0x00C8 (0x000280 - 0x000348)
class UTBP_UI_TwoButtonDialog_C : public UTigerWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UTBP_UI_Button_CTA_C*                              DialogButton_One;                                           // 0x0288   (0x0008)  
	UTBP_UI_Button_CTA_C*                              DialogButton_Two;                                           // 0x0290   (0x0008)  
	UTigerStyledRichTextBlock*                         DialogDescription;                                          // 0x0298   (0x0008)  
	UTigerStyledRichTextBlock*                         DialogHeader;                                               // 0x02A0   (0x0008)  
	FText                                              HeaderText;                                                 // 0x02A8   (0x0018)  
	FText                                              DescriptionText;                                            // 0x02C0   (0x0018)  
	FMulticastInlineDelegate                           OnButtonOnePressed;                                         // 0x02D8   (0x0010)  
	FMulticastInlineDelegate                           OnButtonTwoPressed;                                         // 0x02E8   (0x0010)  
	FText                                              ButtonOneText;                                              // 0x02F8   (0x0018)  
	FText                                              ButtonTwoText;                                              // 0x0310   (0x0018)  
	FName                                              ButtonOneGamepadActionName;                                 // 0x0328   (0x0008)  
	FName                                              ButtonOneKeyboardActionName;                                // 0x0330   (0x0008)  
	FName                                              ButtonTwoGamepadActionName;                                 // 0x0338   (0x0008)  
	FName                                              ButtonTwoKeyboardActionName;                                // 0x0340   (0x0008)  


	/// Functions
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_TwoButtonDialog.TBP_UI_TwoButtonDialog_C.SetDialogDescription
	void SetDialogDescription(FText& InDescription);                                                                         // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_TwoButtonDialog.TBP_UI_TwoButtonDialog_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_TwoButtonDialog.TBP_UI_TwoButtonDialog_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_TwoButtonDialog.TBP_UI_TwoButtonDialog_C.CallButtonOne
	void CallButtonOne();                                                                                                    // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_TwoButtonDialog.TBP_UI_TwoButtonDialog_C.CallButtonTwo
	void CallButtonTwo();                                                                                                    // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_TwoButtonDialog.TBP_UI_TwoButtonDialog_C.ExecuteUbergraph_TBP_UI_TwoButtonDialog
	void ExecuteUbergraph_TBP_UI_TwoButtonDialog(int32_t EntryPoint);                                                        // [0x197e4f0] Final                
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_TwoButtonDialog.TBP_UI_TwoButtonDialog_C.OnButtonTwoPressed__DelegateSignature
	void OnButtonTwoPressed__DelegateSignature();                                                                            // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_TwoButtonDialog.TBP_UI_TwoButtonDialog_C.OnButtonOnePressed__DelegateSignature
	void OnButtonOnePressed__DelegateSignature();                                                                            // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/Widgets/SystemMenu/TBP_UI_GamepadInputDiagram.TBP_UI_GamepadInputDiagram_C
/// Size: 0x00B1 (0x000290 - 0x000341)
class UTBP_UI_GamepadInputDiagram_C : public UTigerControllerDiagram
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0290   (0x0008)  
	UTBP_UI_GamepadInputDiagram_Label_C*               CentralButton;                                              // 0x0298   (0x0008)  
	UImage*                                            ControllerLines;                                            // 0x02A0   (0x0008)  
	UTBP_UI_GamepadInputDiagram_Label_C*               DpadDown;                                                   // 0x02A8   (0x0008)  
	UTBP_UI_GamepadInputDiagram_Label_C*               DpadLeft;                                                   // 0x02B0   (0x0008)  
	UTBP_UI_GamepadInputDiagram_Label_C*               DpadRight;                                                  // 0x02B8   (0x0008)  
	UTBP_UI_GamepadInputDiagram_Label_C*               DpadUp;                                                     // 0x02C0   (0x0008)  
	UTBP_UI_GamepadInputDiagram_Label_C*               FaceButtonBottom;                                           // 0x02C8   (0x0008)  
	UTBP_UI_GamepadInputDiagram_Label_C*               FaceButtonLeft;                                             // 0x02D0   (0x0008)  
	UTBP_UI_GamepadInputDiagram_Label_C*               FaceButtonRight;                                            // 0x02D8   (0x0008)  
	UTBP_UI_GamepadInputDiagram_Label_C*               FaceButtonTop;                                              // 0x02E0   (0x0008)  
	UImage*                                            GamepadImage;                                               // 0x02E8   (0x0008)  
	UTBP_UI_GamepadInputDiagram_Label_C*               LeftShoulder;                                               // 0x02F0   (0x0008)  
	UTBP_UI_GamepadInputDiagram_Label_C*               LeftStickAxis;                                              // 0x02F8   (0x0008)  
	UTBP_UI_GamepadInputDiagram_Label_C*               LeftStickClickIn;                                           // 0x0300   (0x0008)  
	UTBP_UI_GamepadInputDiagram_Label_C*               LeftTrigger;                                                // 0x0308   (0x0008)  
	UTBP_UI_GamepadInputDiagram_Label_C*               RightShoulder;                                              // 0x0310   (0x0008)  
	UTBP_UI_GamepadInputDiagram_Label_C*               RightStickAxis;                                             // 0x0318   (0x0008)  
	UTBP_UI_GamepadInputDiagram_Label_C*               RightStickClickIn;                                          // 0x0320   (0x0008)  
	UTBP_UI_GamepadInputDiagram_Label_C*               RightTrigger;                                               // 0x0328   (0x0008)  
	UTBP_UI_GamepadInputDiagram_Label_C*               StartButton;                                                // 0x0330   (0x0008)  
	UTBP_UI_GamepadInputDiagram_Label_C*               HighlightedLabel;                                           // 0x0338   (0x0008)  
	bool                                               bShowPlayStationGamepad;                                    // 0x0340   (0x0001)  


	/// Functions
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_GamepadInputDiagram.TBP_UI_GamepadInputDiagram_C.UpdateGamepadImages
	void UpdateGamepadImages();                                                                                              // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_GamepadInputDiagram.TBP_UI_GamepadInputDiagram_C.UpdateLabels
	void UpdateLabels(TArray<FTigerActionKeyMappingInfo>& InKeyTextPairs);                                                   // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_GamepadInputDiagram.TBP_UI_GamepadInputDiagram_C.LockKeys
	void LockKeys(TArray<FKey>& InKeysToLock);                                                                               // [0x197e4f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_GamepadInputDiagram.TBP_UI_GamepadInputDiagram_C.SetHighlightedLabel
	void SetHighlightedLabel(UTBP_UI_GamepadInputDiagram_Label_C* InNewLabel);                                               // [0x197e4f0] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_GamepadInputDiagram.TBP_UI_GamepadInputDiagram_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_GamepadInputDiagram.TBP_UI_GamepadInputDiagram_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_GamepadInputDiagram.TBP_UI_GamepadInputDiagram_C.ExecuteUbergraph_TBP_UI_GamepadInputDiagram
	void ExecuteUbergraph_TBP_UI_GamepadInputDiagram(int32_t EntryPoint);                                                    // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularListItem.TBP_UI_ModularListItem_C
/// Size: 0x0100 (0x000370 - 0x000470)
class UTBP_UI_ModularListItem_C : public UTigerUIDPadNavNode
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0370   (0x0008)  
	UWidgetAnimation*                                  HoverAbove;                                                 // 0x0378   (0x0008)  
	UWidgetAnimation*                                  HoverBelow;                                                 // 0x0380   (0x0008)  
	UWidgetAnimation*                                  OnHover;                                                    // 0x0388   (0x0008)  
	UImage*                                            BackgroundHighlight;                                        // 0x0390   (0x0008)  
	UButton*                                           ClickButton;                                                // 0x0398   (0x0008)  
	UImage*                                            CompleteIcon;                                               // 0x03A0   (0x0008)  
	UNamedSlot*                                        CustomSlot;                                                 // 0x03A8   (0x0008)  
	UWidgetSwitcher*                                   IconSwitcher;                                               // 0x03B0   (0x0008)  
	UImage*                                            LockedIcon;                                                 // 0x03B8   (0x0008)  
	UTBP_UI_NewNotification_C*                         NewDot;                                                     // 0x03C0   (0x0008)  
	UTigerStyledRichTextBlock*                         ProgressionText;                                            // 0x03C8   (0x0008)  
	UTigerStyledRichTextBlock*                         TextBox;                                                    // 0x03D0   (0x0008)  
	UScaleBox*                                         TextScrollScaleBox;                                         // 0x03D8   (0x0008)  
	ETigerModularListItemType                          ItemType;                                                   // 0x03E0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x03E1   (0x0007)  MISSED
	FText                                              Text;                                                       // 0x03E8   (0x0018)  
	bool                                               IsLocked;                                                   // 0x0400   (0x0001)  
	bool                                               ShowProgressionCounter;                                     // 0x0401   (0x0001)  
	unsigned char                                      UnknownData01_5[0x2];                                       // 0x0402   (0x0002)  MISSED
	int32_t                                            CurrentProgression;                                         // 0x0404   (0x0004)  
	int32_t                                            MaxProgression;                                             // 0x0408   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x040C   (0x0004)  MISSED
	FMulticastInlineDelegate                           OnPressed;                                                  // 0x0410   (0x0010)  
	FMulticastInlineDelegate                           OnHovered;                                                  // 0x0420   (0x0010)  
	FMulticastInlineDelegate                           OnUnhovered;                                                // 0x0430   (0x0010)  
	bool                                               IsNew;                                                      // 0x0440   (0x0001)  
	unsigned char                                      UnknownData03_5[0x3];                                       // 0x0441   (0x0003)  MISSED
	int32_t                                            Index;                                                      // 0x0444   (0x0004)  
	UWidget*                                           CustomWidget;                                               // 0x0448   (0x0008)  
	FMulticastInlineDelegate                           OnDPadHighlighted;                                          // 0x0450   (0x0010)  
	FMulticastInlineDelegate                           OnDPadUnhighlighted;                                        // 0x0460   (0x0010)  


	/// Functions
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularListItem.TBP_UI_ModularListItem_C.GetAnimations
	void GetAnimations(UWidgetAnimation*& OutHover, UWidgetAnimation*& OutHoverAbove, UWidgetAnimation*& OutHoverBelow);     // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularListItem.TBP_UI_ModularListItem_C.RefreshProgressionDisplay
	void RefreshProgressionDisplay();                                                                                        // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularListItem.TBP_UI_ModularListItem_C.SetIsNew
	void SetIsNew(bool InIsNew);                                                                                             // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularListItem.TBP_UI_ModularListItem_C.ClearHighlight
	void ClearHighlight(bool InClearSelection);                                                                              // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularListItem.TBP_UI_ModularListItem_C.Highlight
	void Highlight(bool InSelected);                                                                                         // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularListItem.TBP_UI_ModularListItem_C.OnMouseEnter
	void OnMouseEnter(FGeometry MyGeometry, FPointerEvent& MouseEvent);                                                      // [0x197e4f0] BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularListItem.TBP_UI_ModularListItem_C.OnMouseLeave
	void OnMouseLeave(FPointerEvent& MouseEvent);                                                                            // [0x197e4f0] BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularListItem.TBP_UI_ModularListItem_C.OnHighlight
	void OnHighlight();                                                                                                      // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularListItem.TBP_UI_ModularListItem_C.OnUnHightlight
	void OnUnHightlight();                                                                                                   // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularListItem.TBP_UI_ModularListItem_C.OnInteraction
	void OnInteraction();                                                                                                    // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularListItem.TBP_UI_ModularListItem_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularListItem.TBP_UI_ModularListItem_C.BndEvt__TBP_UI_ModularListItem_Button_351_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	void BndEvt__TBP_UI_ModularListItem_Button_351_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();   // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularListItem.TBP_UI_ModularListItem_C.ExecuteUbergraph_TBP_UI_ModularListItem
	void ExecuteUbergraph_TBP_UI_ModularListItem(int32_t EntryPoint);                                                        // [0x197e4f0] Final|HasDefaults    
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularListItem.TBP_UI_ModularListItem_C.OnDPadUnhighlighted__DelegateSignature
	void OnDPadUnhighlighted__DelegateSignature(int32_t InIndex);                                                            // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularListItem.TBP_UI_ModularListItem_C.OnDPadHighlighted__DelegateSignature
	void OnDPadHighlighted__DelegateSignature(int32_t InIndex);                                                              // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularListItem.TBP_UI_ModularListItem_C.OnUnhovered__DelegateSignature
	void OnUnhovered__DelegateSignature(int32_t InIndex);                                                                    // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularListItem.TBP_UI_ModularListItem_C.OnHovered__DelegateSignature
	void OnHovered__DelegateSignature(int32_t InIndex);                                                                      // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularListItem.TBP_UI_ModularListItem_C.OnPressed__DelegateSignature
	void OnPressed__DelegateSignature(int32_t InIndex);                                                                      // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularList.TBP_UI_ModularList_C
/// Size: 0x00D1 (0x000370 - 0x000441)
class UTBP_UI_ModularList_C : public UTigerUIDPadNavNode
{ 
public:
	UWidgetAnimation*                                  FirstItemHovered;                                           // 0x0370   (0x0008)  
	UVerticalBox*                                      List;                                                       // 0x0378   (0x0008)  
	URetainerBox*                                      RetainerBox;                                                // 0x0380   (0x0008)  
	UTBP_UI_Scrollbox_C*                               TBP_UI_Scrollbox;                                           // 0x0388   (0x0008)  
	FMulticastInlineDelegate                           OnItemSelected;                                             // 0x0390   (0x0010)  
	TArray<UTBP_UI_ModularListItem_C*>                 Items;                                                      // 0x03A0   (0x0010)  
	int32_t                                            CurrentlyHoveredIndex;                                      // 0x03B0   (0x0004)  
	int32_t                                            CurrentlySelectedIndex;                                     // 0x03B4   (0x0004)  
	FMulticastInlineDelegate                           OnItemHover;                                                // 0x03B8   (0x0010)  
	TMap<int32_t, int32_t>                             ItemToListIndexMap;                                         // 0x03C8   (0x0050)  
	bool                                               ShouldHighlightOnHoverUsingDPad;                            // 0x0418   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0419   (0x0007)  MISSED
	FMulticastInlineDelegate                           OnChildDPadHighlighted;                                     // 0x0420   (0x0010)  
	FMulticastInlineDelegate                           OnChildDPadUnhighlighted;                                   // 0x0430   (0x0010)  
	bool                                               ShouldSkipNextPress;                                        // 0x0440   (0x0001)  


	/// Functions
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularList.TBP_UI_ModularList_C.CallOnChildDPadUnhighlighted
	void CallOnChildDPadUnhighlighted(int32_t InIndex);                                                                      // [0x197e4f0] Private|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularList.TBP_UI_ModularList_C.CallOnChildDPadHighlighted
	void CallOnChildDPadHighlighted(int32_t InIndex);                                                                        // [0x197e4f0] Private|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularList.TBP_UI_ModularList_C.OnDPadFocussedItem
	void OnDPadFocussedItem();                                                                                               // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularList.TBP_UI_ModularList_C.SetProgressionOfIndex
	void SetProgressionOfIndex(int32_t InIndex, int32_t InCurrentProgression, int32_t InMaxProgression);                     // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularList.TBP_UI_ModularList_C.SetNewStatusOfIndex
	void SetNewStatusOfIndex(int32_t InIndex, bool InIsNew);                                                                 // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularList.TBP_UI_ModularList_C.GetUpperAndLowerSeperatorsForIndex
	void GetUpperAndLowerSeperatorsForIndex(int32_t InIndex, UTBP_UI_ModularSeparator_C*& OutUpperSeparator, UTBP_UI_ModularSeparator_C*& OutLowerSeparator); // [0x197e4f0] Private|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularList.TBP_UI_ModularList_C.UnhoverCurrentItem
	void UnhoverCurrentItem(bool InMoveSeperatorsToSelected);                                                                // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularList.TBP_UI_ModularList_C.On Item Hovered
	void On Item Hovered(int32_t InIndex);                                                                                   // [0x197e4f0] Private|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularList.TBP_UI_ModularList_C.OnItemPressed
	void OnItemPressed(int32_t InIndex);                                                                                     // [0x197e4f0] Private|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularList.TBP_UI_ModularList_C.HoverItemAtIndex
	void HoverItemAtIndex(int32_t InIndex);                                                                                  // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularList.TBP_UI_ModularList_C.SelectItemAtIndex
	void SelectItemAtIndex(int32_t InIndex);                                                                                 // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularList.TBP_UI_ModularList_C.SelectCurrentItem
	void SelectCurrentItem();                                                                                                // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularList.TBP_UI_ModularList_C.ClearList
	void ClearList();                                                                                                        // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularList.TBP_UI_ModularList_C.AddItemToList
	void AddItemToList(FTigerModularListItemInfo InItemInfo);                                                                // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularList.TBP_UI_ModularList_C.FillList
	void FillList(TArray<FTigerModularListItemInfo>& InListItems);                                                           // [0x197e4f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularList.TBP_UI_ModularList_C.OnChildDPadUnhighlighted__DelegateSignature
	void OnChildDPadUnhighlighted__DelegateSignature(int32_t InIndex);                                                       // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularList.TBP_UI_ModularList_C.OnChildDPadHighlighted__DelegateSignature
	void OnChildDPadHighlighted__DelegateSignature(int32_t InIndex);                                                         // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularList.TBP_UI_ModularList_C.OnItemHover__DelegateSignature
	void OnItemHover__DelegateSignature(int32_t InIndex);                                                                    // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Modular/TBP_UI_ModularList.TBP_UI_ModularList_C.OnItemSelected__DelegateSignature
	void OnItemSelected__DelegateSignature(int32_t InIndex);                                                                 // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/Input/TBP_UI_ModularListItem_KeyRebinding.TBP_UI_ModularListItem_KeyRebinding_C
/// Size: 0x0040 (0x000470 - 0x0004B0)
class UTBP_UI_ModularListItem_KeyRebinding_C : public UTBP_UI_ModularListItem_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0470   (0x0008)  
	UWidgetAnimation*                                  HoverAbove_Child;                                           // 0x0478   (0x0008)  
	UWidgetAnimation*                                  HoverBelow_Child;                                           // 0x0480   (0x0008)  
	UWidgetAnimation*                                  OnHover_Child;                                              // 0x0488   (0x0008)  
	UImage*                                            BackgroundHighlight_Child;                                  // 0x0490   (0x0008)  
	UTBP_UI_InputBinding_PresetMenu_C*                 KeyRebinding;                                               // 0x0498   (0x0008)  
	FMulticastInlineDelegate                           OnNewKeySelected;                                           // 0x04A0   (0x0010)  


	/// Functions
	// Function /Game/UI/Input/TBP_UI_ModularListItem_KeyRebinding.TBP_UI_ModularListItem_KeyRebinding_C.ClearHighlight
	void ClearHighlight(bool InClearSelection);                                                                              // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Input/TBP_UI_ModularListItem_KeyRebinding.TBP_UI_ModularListItem_KeyRebinding_C.Highlight
	void Highlight(bool InSelected);                                                                                         // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Input/TBP_UI_ModularListItem_KeyRebinding.TBP_UI_ModularListItem_KeyRebinding_C.GetAnimations
	void GetAnimations(UWidgetAnimation*& OutHover, UWidgetAnimation*& OutHoverAbove, UWidgetAnimation*& OutHoverBelow);     // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Input/TBP_UI_ModularListItem_KeyRebinding.TBP_UI_ModularListItem_KeyRebinding_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Input/TBP_UI_ModularListItem_KeyRebinding.TBP_UI_ModularListItem_KeyRebinding_C.CallKeySelectedDispatcher
	void CallKeySelectedDispatcher(FInputChord SelectedKey);                                                                 // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Input/TBP_UI_ModularListItem_KeyRebinding.TBP_UI_ModularListItem_KeyRebinding_C.ExecuteUbergraph_TBP_UI_ModularListItem_KeyRebinding
	void ExecuteUbergraph_TBP_UI_ModularListItem_KeyRebinding(int32_t EntryPoint);                                           // [0x197e4f0] Final|HasDefaults    
	// Function /Game/UI/Input/TBP_UI_ModularListItem_KeyRebinding.TBP_UI_ModularListItem_KeyRebinding_C.OnNewKeySelected__DelegateSignature
	void OnNewKeySelected__DelegateSignature(int32_t InIndex, FInputChord InNewChord);                                       // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C
/// Size: 0x007C (0x000528 - 0x0005A4)
class UTBP_UI_ControllerPresetMenu_C : public UTigerControllerPresetMenu
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0528   (0x0008)  
	UTBP_UI_ModularList_C*                             ButtonsList;                                                // 0x0530   (0x0008)  
	UWidgetSwitcher*                                   DiagramSwitcher;                                            // 0x0538   (0x0008)  
	UTBP_UI_TwoButtonDialog_C*                         Dialog_UnassignedActions;                                   // 0x0540   (0x0008)  
	UWidgetSwitcher*                                   DialogSwitcher;                                             // 0x0548   (0x0008)  
	UTBP_UI_GamepadInputDiagram_C*                     DualSenseDiagram;                                           // 0x0550   (0x0008)  
	UWidgetSwitcher*                                   ListSwitcher;                                               // 0x0558   (0x0008)  
	UTBP_UI_ModularList_C*                             PresetList;                                                 // 0x0560   (0x0008)  
	UTBP_UI_GamepadInputDiagram_C*                     TBP_UI_GamepadInputDiagram;                                 // 0x0568   (0x0008)  
	UTBP_UI_GamepadInputDiagram_C*                     XBoxDiagram;                                                // 0x0570   (0x0008)  
	TArray<FTigerPresetListItemIdPair>                 ListItemIdPairs;                                            // 0x0578   (0x0010)  
	TArray<FTigerActionKeyMappingInfo>                 ButtonItemMappings;                                         // 0x0588   (0x0010)  
	ETigerControllerPresetMenuListTypes                CurrentSubscreen;                                           // 0x0598   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0599   (0x0003)  MISSED
	int32_t                                            PreviewedPresetId;                                          // 0x059C   (0x0004)  
	int32_t                                            PreviewedPresetIndex;                                       // 0x05A0   (0x0004)  


	/// Functions
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.HasUnappliedChanges
	void HasUnappliedChanges(bool& OutHasUnappliedChanges);                                                                  // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.ApplyChanges
	void ApplyChanges(bool& OutShouldShowRevertPrompt, bool& OutNeedsRestart);                                               // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.SetPreviewedPreset
	void SetPreviewedPreset(int32_t InPresetId);                                                                             // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.HideDialog
	void HideDialog();                                                                                                       // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.RevealDialog_UnassignedActions
	void RevealDialog_UnassignedActions();                                                                                   // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.SelectPresetListItemForUse
	void SelectPresetListItemForUse(int32_t InIndex);                                                                        // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.RefreshButtonsList
	void RefreshButtonsList();                                                                                               // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.OnResetActionImpl
	void OnResetActionImpl();                                                                                                // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.OnInputKeyChangedImpl
	void OnInputKeyChangedImpl(int32_t InIndex, FInputChord InNewChord);                                                     // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.GetPlatformDiagram
	void GetPlatformDiagram(UTBP_UI_GamepadInputDiagram_C*& OutDiagram);                                                     // [0x197e4f0] Protected|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.FillButtonsList
	void FillButtonsList();                                                                                                  // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.SelectPresetListItemForCustomization
	void SelectPresetListItemForCustomization(int32_t InIndex);                                                              // [0x197e4f0] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.SetListSubmenu
	void SetListSubmenu(ETigerControllerPresetMenuListTypes InListType);                                                     // [0x197e4f0] Protected|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.FillPresetList
	void FillPresetList();                                                                                                   // [0x197e4f0] Protected|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.OnInputKeyChanged
	void OnInputKeyChanged(int32_t InIndex, FInputChord InNewChord);                                                         // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.OnPresetListItemHovered
	void OnPresetListItemHovered(int32_t InIndex);                                                                           // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.BndEvt__TBP_UI_ControllerPresetMenu_Dialog_UnassignedActions_K2Node_ComponentBoundEvent_6_OnButtonOnePressed__DelegateSignature
	void BndEvt__TBP_UI_ControllerPresetMenu_Dialog_UnassignedActions_K2Node_ComponentBoundEvent_6_OnButtonOnePressed__DelegateSignature(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.BndEvt__TBP_UI_ControllerPresetMenu_Dialog_UnassignedActions_K2Node_ComponentBoundEvent_9_OnButtonTwoPressed__DelegateSignature
	void BndEvt__TBP_UI_ControllerPresetMenu_Dialog_UnassignedActions_K2Node_ComponentBoundEvent_9_OnButtonTwoPressed__DelegateSignature(); // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.BindPresetsMenuBindings
	void BindPresetsMenuBindings();                                                                                          // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.UnbindPresetsMenuBindings
	void UnbindPresetsMenuBindings();                                                                                        // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.BindButtonsMenuBindings
	void BindButtonsMenuBindings();                                                                                          // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.UnbindButtonsMenuBindings
	void UnbindButtonsMenuBindings();                                                                                        // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.GoToPresetsMenu
	void GoToPresetsMenu();                                                                                                  // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.GiveBackDpad
	void GiveBackDpad();                                                                                                     // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.ResetSettings
	void ResetSettings();                                                                                                    // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.RevertChanges
	void RevertChanges();                                                                                                    // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.DiscardChanges
	void DiscardChanges();                                                                                                   // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.SecondaryClicked
	void SecondaryClicked();                                                                                                 // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.TertiaryClicked
	void TertiaryClicked();                                                                                                  // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.Customize
	void Customize();                                                                                                        // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.CloseMenu
	void CloseMenu();                                                                                                        // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.ResetToDefaults
	void ResetToDefaults();                                                                                                  // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.ConfirmApply
	void ConfirmApply();                                                                                                     // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.CloseCategory
	void CloseCategory();                                                                                                    // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.OpenCategory
	void OpenCategory();                                                                                                     // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.OpenMenu
	void OpenMenu();                                                                                                         // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/SystemMenu/TBP_UI_ControllerPresetMenu.TBP_UI_ControllerPresetMenu_C.ExecuteUbergraph_TBP_UI_ControllerPresetMenu
	void ExecuteUbergraph_TBP_UI_ControllerPresetMenu(int32_t EntryPoint);                                                   // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/UI/Input/TBP_UI_InputConflict.TBP_UI_InputConflict_C
/// Size: 0x0008 (0x000260 - 0x000268)
class UTBP_UI_InputConflict_C : public UUserWidget
{ 
public:
	UTigerStyledRichTextBlock*                         ActionName_Text;                                            // 0x0260   (0x0008)  
};

/// Class /Game/UI/Input/TBP_UI_InputBindingCollection.TBP_UI_InputBindingCollection_C
/// Size: 0x0020 (0x000280 - 0x0002A0)
class UTBP_UI_InputBindingCollection_C : public UTigerWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UScrollBox*                                        BindingCollection;                                          // 0x0288   (0x0008)  
	UTBP_UI_Scrollbox_C*                               TBP_UI_Scrollbox;                                           // 0x0290   (0x0008)  
	UTBP_UI_InputBinding_KeyRebindScreen_C*            CurrentlyActiveChild;                                       // 0x0298   (0x0008)  


	/// Functions
	// Function /Game/UI/Input/TBP_UI_InputBindingCollection.TBP_UI_InputBindingCollection_C.DeactiveCurrentChild
	void DeactiveCurrentChild();                                                                                             // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Input/TBP_UI_InputBindingCollection.TBP_UI_InputBindingCollection_C.SetActiveChild
	void SetActiveChild(UTBP_UI_InputBinding_KeyRebindScreen_C* Input Binding);                                              // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Input/TBP_UI_InputBindingCollection.TBP_UI_InputBindingCollection_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Input/TBP_UI_InputBindingCollection.TBP_UI_InputBindingCollection_C.ExecuteUbergraph_TBP_UI_InputBindingCollection
	void ExecuteUbergraph_TBP_UI_InputBindingCollection(int32_t EntryPoint);                                                 // [0x197e4f0] Final                
};

/// Class /Game/UI/BlueprintFunctionLibraries/TBFL_UI_Text.TBFL_UI_Text_C
/// Size: 0x0000 (0x000028 - 0x000028)
class UTBFL_UI_Text_C : public UBlueprintFunctionLibrary
{ 
public:
};

/// Class /Game/UI/Widgets/Elysium/GameMenu/Social/PlayerCards/TBP_UI_Social_ActionMenuItem.TBP_UI_Social_ActionMenuItem_C
/// Size: 0x0078 (0x000280 - 0x0002F8)
class UTBP_UI_Social_ActionMenuItem_C : public UTigerWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UTigerStyledRichTextBlock*                         CooldownText;                                               // 0x0288   (0x0008)  
	UTigerStyledRichTextBlock*                         LabelText;                                                  // 0x0290   (0x0008)  
	UButton*                                           MenuButton;                                                 // 0x0298   (0x0008)  
	FText                                              Label;                                                      // 0x02A0   (0x0018)  
	FMulticastInlineDelegate                           MenuClicked;                                                // 0x02B8   (0x0010)  
	UAkAudioEvent*                                     MenuItemClickedAudioEvent;                                  // 0x02C8   (0x0008)  
	FDataTableRowHandle                                NeutralTextSyle;                                            // 0x02D0   (0x0010)  
	FDataTableRowHandle                                HoverdTextSyle;                                             // 0x02E0   (0x0010)  
	bool                                               bIsEnabledFromStart;                                        // 0x02F0   (0x0001)  
	bool                                               bIsOnCooldown;                                              // 0x02F1   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x02F2   (0x0002)  MISSED
	float                                              Cooldown;                                                   // 0x02F4   (0x0004)  


	/// Functions
	// Function /Game/UI/Widgets/Elysium/GameMenu/Social/PlayerCards/TBP_UI_Social_ActionMenuItem.TBP_UI_Social_ActionMenuItem_C.SetCooldown
	void SetCooldown(float InCooldown);                                                                                      // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Social/PlayerCards/TBP_UI_Social_ActionMenuItem.TBP_UI_Social_ActionMenuItem_C.BndEvt__MenuButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	void BndEvt__MenuButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();                          // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Elysium/GameMenu/Social/PlayerCards/TBP_UI_Social_ActionMenuItem.TBP_UI_Social_ActionMenuItem_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Social/PlayerCards/TBP_UI_Social_ActionMenuItem.TBP_UI_Social_ActionMenuItem_C.BndEvt__MenuButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
	void BndEvt__MenuButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();                            // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Elysium/GameMenu/Social/PlayerCards/TBP_UI_Social_ActionMenuItem.TBP_UI_Social_ActionMenuItem_C.BndEvt__MenuButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature
	void BndEvt__MenuButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();                            // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Elysium/GameMenu/Social/PlayerCards/TBP_UI_Social_ActionMenuItem.TBP_UI_Social_ActionMenuItem_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Social/PlayerCards/TBP_UI_Social_ActionMenuItem.TBP_UI_Social_ActionMenuItem_C.Tick
	void Tick(FGeometry MyGeometry, float InDeltaTime);                                                                      // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/Social/PlayerCards/TBP_UI_Social_ActionMenuItem.TBP_UI_Social_ActionMenuItem_C.ExecuteUbergraph_TBP_UI_Social_ActionMenuItem
	void ExecuteUbergraph_TBP_UI_Social_ActionMenuItem(int32_t EntryPoint);                                                  // [0x197e4f0] Final|HasDefaults    
	// Function /Game/UI/Widgets/Elysium/GameMenu/Social/PlayerCards/TBP_UI_Social_ActionMenuItem.TBP_UI_Social_ActionMenuItem_C.MenuClicked__DelegateSignature
	void MenuClicked__DelegateSignature();                                                                                   // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/Widgets/Chat/TBP_UI_ChatWindowMessage.TBP_UI_ChatWindowMessage_C
/// Size: 0x0088 (0x000280 - 0x000308)
class UTBP_UI_ChatWindowMessage_C : public UTigerWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UTextBlock*                                        MessageTextBlock;                                           // 0x0288   (0x0008)  
	UOverlay*                                          NameContainer;                                              // 0x0290   (0x0008)  
	UButton*                                           NameMenuButton;                                             // 0x0298   (0x0008)  
	UTextBlock*                                        PlayerNameTextBlock;                                        // 0x02A0   (0x0008)  
	FTigerChatMessage                                  ChatMessageData;                                            // 0x02A8   (0x0058)  
	UUserWidget*                                       ChatWindow;                                                 // 0x0300   (0x0008)  


	/// Functions
	// Function /Game/UI/Widgets/Chat/TBP_UI_ChatWindowMessage.TBP_UI_ChatWindowMessage_C.Get Sender Name
	void Get Sender Name(FText& OutText);                                                                                    // [0x197e4f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Widgets/Chat/TBP_UI_ChatWindowMessage.TBP_UI_ChatWindowMessage_C.SetUIPadding
	void SetUIPadding();                                                                                                     // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Chat/TBP_UI_ChatWindowMessage.TBP_UI_ChatWindowMessage_C.SetUIVisibilities
	void SetUIVisibilities();                                                                                                // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Chat/TBP_UI_ChatWindowMessage.TBP_UI_ChatWindowMessage_C.Is Another Player
	void Is Another Player(bool& bIsAnotherPlayer);                                                                          // [0x197e4f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Widgets/Chat/TBP_UI_ChatWindowMessage.TBP_UI_ChatWindowMessage_C.RecycleMessage
	void RecycleMessage(FTigerChatMessage InChatMessage);                                                                    // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Chat/TBP_UI_ChatWindowMessage.TBP_UI_ChatWindowMessage_C.BndEvt__NameMenuButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
	void BndEvt__NameMenuButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();                        // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Chat/TBP_UI_ChatWindowMessage.TBP_UI_ChatWindowMessage_C.BndEvt__NameMenuButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature
	void BndEvt__NameMenuButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();                        // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Chat/TBP_UI_ChatWindowMessage.TBP_UI_ChatWindowMessage_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Chat/TBP_UI_ChatWindowMessage.TBP_UI_ChatWindowMessage_C.ExecuteUbergraph_TBP_UI_ChatWindowMessage
	void ExecuteUbergraph_TBP_UI_ChatWindowMessage(int32_t EntryPoint);                                                      // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/UI/Widgets/Chat/BPI_UI_ChatWindow.BPI_UI_ChatWindow_C
/// Size: 0x0000 (0x000028 - 0x000028)
class UBPI_UI_ChatWindow_C : public UInterface
{ 
public:
};

/// Class /Game/UI/Widgets/Chat/BPI_ChatWIndow_Owner.BPI_ChatWIndow_Owner_C
/// Size: 0x0000 (0x000028 - 0x000028)
class UBPI_ChatWIndow_Owner_C : public UInterface
{ 
public:
};

/// Class /Game/UI/Widgets/InputInstructions/TBP_UI_GamepadIcon.TBP_UI_GamepadIcon_C
/// Size: 0x0020 (0x000280 - 0x0002A0)
class UTBP_UI_GamepadIcon_C : public UTigerInputIcon
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UImage*                                            IconImage;                                                  // 0x0288   (0x0008)  
	UTigerKeyTextureMapping*                           KeyTextureMapping;                                          // 0x0290   (0x0008)  
	UTigerKeyTextureMapping*                           KeyTextureMappingXbox;                                      // 0x0298   (0x0008)  


	/// Functions
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_GamepadIcon.TBP_UI_GamepadIcon_C.SetIconFromKey
	void SetIconFromKey(FKey& Key);                                                                                          // [0x197e4f0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_GamepadIcon.TBP_UI_GamepadIcon_C.ExecuteUbergraph_TBP_UI_GamepadIcon
	void ExecuteUbergraph_TBP_UI_GamepadIcon(int32_t EntryPoint);                                                            // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/UI/Widgets/InputInstructions/TBP_UI_KeyboardIcon.TBP_UI_KeyboardIcon_C
/// Size: 0x0019 (0x000280 - 0x000299)
class UTBP_UI_KeyboardIcon_C : public UTigerInputIcon
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UImage*                                            IconImage;                                                  // 0x0288   (0x0008)  
	UTigerKeyTextureMapping*                           KeyTextureMapping;                                          // 0x0290   (0x0008)  
	bool                                               MatchSize;                                                  // 0x0298   (0x0001)  


	/// Functions
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_KeyboardIcon.TBP_UI_KeyboardIcon_C.SetIconFromKey
	void SetIconFromKey(FKey& Key);                                                                                          // [0x197e4f0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InputInstructions/TBP_UI_KeyboardIcon.TBP_UI_KeyboardIcon_C.ExecuteUbergraph_TBP_UI_KeyboardIcon
	void ExecuteUbergraph_TBP_UI_KeyboardIcon(int32_t EntryPoint);                                                           // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/UI/Widgets/Crosshairs/TBP_Melee_Crosshair.TBP_Melee_Crosshair_C
/// Size: 0x0010 (0x0002C8 - 0x0002D8)
class UTBP_Melee_Crosshair_C : public UTigerMeleeCrosshairWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02C8   (0x0008)  
	UImage*                                            Crosshair;                                                  // 0x02D0   (0x0008)  


	/// Functions
	// Function /Game/UI/Widgets/Crosshairs/TBP_Melee_Crosshair.TBP_Melee_Crosshair_C.Tick
	void Tick(FGeometry MyGeometry, float InDeltaTime);                                                                      // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Crosshairs/TBP_Melee_Crosshair.TBP_Melee_Crosshair_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Crosshairs/TBP_Melee_Crosshair.TBP_Melee_Crosshair_C.ExecuteUbergraph_TBP_Melee_Crosshair
	void ExecuteUbergraph_TBP_Melee_Crosshair(int32_t EntryPoint);                                                           // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/UI/Widgets/TBP_UI_IMage.TBP_UI_Image_C
/// Size: 0x0008 (0x000280 - 0x000288)
class UTBP_UI_Image_C : public UTigerImageUI
{ 
public:
	UImage*                                            WrappedImage;                                               // 0x0280   (0x0008)  


	/// Functions
	// Function /Game/UI/Widgets/TBP_UI_IMage.TBP_UI_Image_C.GetImage
	UImage* GetImage();                                                                                                      // [0x197e4f0] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
};

/// Class /Game/UI/Widgets/Crosshairs/RangedCrosshairs/TBP_UI_BaseRangedCrosshair.TBP_UI_BaseRangedCrosshair_C
/// Size: 0x00C8 (0x0002B8 - 0x000380)
class UTBP_UI_BaseRangedCrosshair_C : public UTigerWeaponCrosshairWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02B8   (0x0008)  
	UCanvasPanel*                                      CanvasParent;                                               // 0x02C0   (0x0008)  
	UImage*                                            ScopeVignetteImage;                                         // 0x02C8   (0x0008)  
	TArray<UTBP_UI_Image_C*>                           Crosshairs;                                                 // 0x02D0   (0x0010)  
	FSlateBrush                                        ScopeVignette;                                              // 0x02E0   (0x0088)  
	bool                                               bShouldShowScopeVignette;                                   // 0x0368   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0369   (0x0007)  MISSED
	TArray<UTBP_UI_Image_C*>                           ScalingCrosshairs;                                          // 0x0370   (0x0010)  


	/// Functions
	// Function /Game/UI/Widgets/Crosshairs/RangedCrosshairs/TBP_UI_BaseRangedCrosshair.TBP_UI_BaseRangedCrosshair_C.GetBrushAspect
	float GetBrushAspect(FSlateBrush& SlateBrush);                                                                           // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Widgets/Crosshairs/RangedCrosshairs/TBP_UI_BaseRangedCrosshair.TBP_UI_BaseRangedCrosshair_C.GetFov
	void GetFov(float& OutFov);                                                                                              // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Widgets/Crosshairs/RangedCrosshairs/TBP_UI_BaseRangedCrosshair.TBP_UI_BaseRangedCrosshair_C.SetupScalingCrosshairImage
	void SetupScalingCrosshairImage(FTigerWeaponScalingCrosshairSlot ScalingCrosshairSlot);                                  // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Crosshairs/RangedCrosshairs/TBP_UI_BaseRangedCrosshair.TBP_UI_BaseRangedCrosshair_C.SetupCrosshairImage
	void SetupCrosshairImage(FTigerWeaponCrosshairSlot& TigerWeaponCrosshairSlot);                                           // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Crosshairs/RangedCrosshairs/TBP_UI_BaseRangedCrosshair.TBP_UI_BaseRangedCrosshair_C.SetupScopeVignette
	void SetupScopeVignette();                                                                                               // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Crosshairs/RangedCrosshairs/TBP_UI_BaseRangedCrosshair.TBP_UI_BaseRangedCrosshair_C.GetAspectRatio
	float GetAspectRatio();                                                                                                  // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Widgets/Crosshairs/RangedCrosshairs/TBP_UI_BaseRangedCrosshair.TBP_UI_BaseRangedCrosshair_C.GetCrosshairScale
	void GetCrosshairScale(float InScreenSpaceSpread, float InAspectRatio, FVector2D& Scale);                                // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Widgets/Crosshairs/RangedCrosshairs/TBP_UI_BaseRangedCrosshair.TBP_UI_BaseRangedCrosshair_C.UpdateCrosshairPositions
	void UpdateCrosshairPositions();                                                                                         // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Crosshairs/RangedCrosshairs/TBP_UI_BaseRangedCrosshair.TBP_UI_BaseRangedCrosshair_C.Tick
	void Tick(FGeometry MyGeometry, float InDeltaTime);                                                                      // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Crosshairs/RangedCrosshairs/TBP_UI_BaseRangedCrosshair.TBP_UI_BaseRangedCrosshair_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Crosshairs/RangedCrosshairs/TBP_UI_BaseRangedCrosshair.TBP_UI_BaseRangedCrosshair_C.OnInitialized
	void OnInitialized();                                                                                                    // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Crosshairs/RangedCrosshairs/TBP_UI_BaseRangedCrosshair.TBP_UI_BaseRangedCrosshair_C.ExecuteUbergraph_TBP_UI_BaseRangedCrosshair
	void ExecuteUbergraph_TBP_UI_BaseRangedCrosshair(int32_t EntryPoint);                                                    // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/UI/Widgets/Crosshairs/RangedCrosshairs/TBP_UI_AssaultCrosshair.TBP_UI_AssaultCrosshair_C
/// Size: 0x0008 (0x000380 - 0x000388)
class UTBP_UI_AssaultCrosshair_C : public UTBP_UI_BaseRangedCrosshair_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0380   (0x0008)  


	/// Functions
	// Function /Game/UI/Widgets/Crosshairs/RangedCrosshairs/TBP_UI_AssaultCrosshair.TBP_UI_AssaultCrosshair_C.Tick
	void Tick(FGeometry MyGeometry, float InDeltaTime);                                                                      // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Crosshairs/RangedCrosshairs/TBP_UI_AssaultCrosshair.TBP_UI_AssaultCrosshair_C.ExecuteUbergraph_TBP_UI_AssaultCrosshair
	void ExecuteUbergraph_TBP_UI_AssaultCrosshair(int32_t EntryPoint);                                                       // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/UI/Widgets/Crosshairs/RangedCrosshairs/TBP_UI_ScopedCrosshair.TBP_UI_ScopedCrosshair_C
/// Size: 0x0048 (0x000380 - 0x0003C8)
class UTBP_UI_ScopedCrosshair_C : public UTBP_UI_BaseRangedCrosshair_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0380   (0x0008)  
	UImage*                                            Image;                                                      // 0x0388   (0x0008)  
	UImage*                                            Image;                                                      // 0x0390   (0x0008)  
	UImage*                                            Image;                                                      // 0x0398   (0x0008)  
	UImage*                                            Image;                                                      // 0x03A0   (0x0008)  
	UImage*                                            Image;                                                      // 0x03A8   (0x0008)  
	UImage*                                            Image;                                                      // 0x03B0   (0x0008)  
	UImage*                                            Image;                                                      // 0x03B8   (0x0008)  
	UImage*                                            Image;                                                      // 0x03C0   (0x0008)  


	/// Functions
	// Function /Game/UI/Widgets/Crosshairs/RangedCrosshairs/TBP_UI_ScopedCrosshair.TBP_UI_ScopedCrosshair_C.Tick
	void Tick(FGeometry MyGeometry, float InDeltaTime);                                                                      // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Crosshairs/RangedCrosshairs/TBP_UI_ScopedCrosshair.TBP_UI_ScopedCrosshair_C.ExecuteUbergraph_TBP_UI_ScopedCrosshair
	void ExecuteUbergraph_TBP_UI_ScopedCrosshair(int32_t EntryPoint);                                                        // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/UI/Widgets/Crosshairs/RangedCrosshairs/TBP_UI_Crosshair_SingleShort.TBP_UI_Crosshair_SingleShort_C
/// Size: 0x0008 (0x000380 - 0x000388)
class UTBP_UI_Crosshair_SingleShort_C : public UTBP_UI_BaseRangedCrosshair_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0380   (0x0008)  


	/// Functions
	// Function /Game/UI/Widgets/Crosshairs/RangedCrosshairs/TBP_UI_Crosshair_SingleShort.TBP_UI_Crosshair_SingleShort_C.Tick
	void Tick(FGeometry MyGeometry, float InDeltaTime);                                                                      // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Crosshairs/RangedCrosshairs/TBP_UI_Crosshair_SingleShort.TBP_UI_Crosshair_SingleShort_C.ExecuteUbergraph_TBP_UI_Crosshair_SingleShort
	void ExecuteUbergraph_TBP_UI_Crosshair_SingleShort(int32_t EntryPoint);                                                  // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/UI/Widgets/Subwidgets/TBP_UI_Line.TBP_UI_Line_C
/// Size: 0x0052 (0x000260 - 0x0002B2)
class UTBP_UI_Line_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	UImage*                                            Left;                                                       // 0x0268   (0x0008)  
	UImage*                                            Middle;                                                     // 0x0270   (0x0008)  
	UImage*                                            Right;                                                      // 0x0278   (0x0008)  
	USizeBox*                                          SizeContainer;                                              // 0x0280   (0x0008)  
	UTexture2D*                                        LeftTexture;                                                // 0x0288   (0x0008)  
	UTexture2D*                                        RightTexture;                                               // 0x0290   (0x0008)  
	UTexture2D*                                        Texture;                                                    // 0x0298   (0x0008)  
	FVector2D                                          MarginPixels;                                               // 0x02A0   (0x0008)  
	float                                              OverrideMiddleWidth;                                        // 0x02A8   (0x0004)  
	float                                              OverrideMiddleHeight;                                       // 0x02AC   (0x0004)  
	bool                                               FlipRight;                                                  // 0x02B0   (0x0001)  
	bool                                               FlipLeft;                                                   // 0x02B1   (0x0001)  


	/// Functions
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_Line.TBP_UI_Line_C.CalculateMargin
	void CalculateMargin();                                                                                                  // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_Line.TBP_UI_Line_C.SetupLine
	void SetupLine();                                                                                                        // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_Line.TBP_UI_Line_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_Line.TBP_UI_Line_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_Line.TBP_UI_Line_C.ExecuteUbergraph_TBP_UI_Line
	void ExecuteUbergraph_TBP_UI_Line(int32_t EntryPoint);                                                                   // [0x197e4f0] Final                
};

/// Class /Game/UI/Widgets/InWorld/TBP_UI_DamageNumber.TBP_UI_DamageNumber_C
/// Size: 0x00A8 (0x000280 - 0x000328)
class UTBP_UI_DamageNumber_C : public UTigerWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UWidgetAnimation*                                  ExtraHealthBreak;                                           // 0x0288   (0x0008)  
	UWidgetAnimation*                                  FadeOut;                                                    // 0x0290   (0x0008)  
	UImage*                                            Background;                                                 // 0x0298   (0x0008)  
	UOverlay*                                          DamageBackgroundContainer;                                  // 0x02A0   (0x0008)  
	UOverlay*                                          DamageNumberContainer;                                      // 0x02A8   (0x0008)  
	UTigerStyledRichTextBlock*                         DamageNumberText;                                           // 0x02B0   (0x0008)  
	UImage*                                            ShieldImage;                                                // 0x02B8   (0x0008)  
	UOverlay*                                          ShieldImageContainer;                                       // 0x02C0   (0x0008)  
	int32_t                                            DamageNumberValue;                                          // 0x02C8   (0x0004)  
	FVector2D                                          MoveDirection;                                              // 0x02CC   (0x0008)  
	FVector2D                                          CurrentOffsetFromSpawnPos;                                  // 0x02D4   (0x0008)  
	FVector                                            WorldSpawnPosition;                                         // 0x02DC   (0x000C)  
	FLinearColor                                       ExtraHealthBracketColor;                                    // 0x02E8   (0x0010)  
	FLinearColor                                       ShieldBracketColor;                                         // 0x02F8   (0x0010)  
	bool                                               bIsEnemy;                                                   // 0x0308   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x0309   (0x0007)  MISSED
	FText                                              ImmuneText;                                                 // 0x0310   (0x0018)  


	/// Functions
	// Function /Game/UI/Widgets/InWorld/TBP_UI_DamageNumber.TBP_UI_DamageNumber_C.ResetDamageNumberOpacity
	void ResetDamageNumberOpacity();                                                                                         // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_DamageNumber.TBP_UI_DamageNumber_C.OnShieldBreakUI
	void OnShieldBreakUI();                                                                                                  // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_DamageNumber.TBP_UI_DamageNumber_C.OnExtraHelathBreakUI
	void OnExtraHelathBreakUI();                                                                                             // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_DamageNumber.TBP_UI_DamageNumber_C.UpdateFontSize
	void UpdateFontSize();                                                                                                   // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_DamageNumber.TBP_UI_DamageNumber_C.StartMoving
	void StartMoving();                                                                                                      // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_DamageNumber.TBP_UI_DamageNumber_C.UpdatePosition
	void UpdatePosition(float InDeltaSeconds, bool& IsOnScreen);                                                             // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_DamageNumber.TBP_UI_DamageNumber_C.UpdateNumber
	void UpdateNumber(FVector InWorldSpawnPosition, FVector2D InStartOffset, int32_t InDamageAmount, FLinearColor InDamageColor, float InHealthLeft, bool InHasExtraHealth, bool InHasShield, float InRangedDamageFalloffPercent, bool InBelowLowHealthThreshold); // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_DamageNumber.TBP_UI_DamageNumber_C.Tick
	void Tick(FGeometry MyGeometry, float InDeltaTime);                                                                      // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_DamageNumber.TBP_UI_DamageNumber_C.OnAnimationFinished
	void OnAnimationFinished(UWidgetAnimation* Animation);                                                                   // [0x197e4f0] BlueprintCosmetic|Event|Protected|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_DamageNumber.TBP_UI_DamageNumber_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_DamageNumber.TBP_UI_DamageNumber_C.Destruct
	void Destruct();                                                                                                         // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_DamageNumber.TBP_UI_DamageNumber_C.Event Visbility Changed
	void Event Visbility Changed(ESlateVisibility InVisibility);                                                             // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_DamageNumber.TBP_UI_DamageNumber_C.ExecuteUbergraph_TBP_UI_DamageNumber
	void ExecuteUbergraph_TBP_UI_DamageNumber(int32_t EntryPoint);                                                           // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/UI/Widgets/Subwidgets/TBP_UI_ResourceBarSegment.TBP_UI_ResourceBarSegment_C
/// Size: 0x0010 (0x000298 - 0x0002A8)
class UTBP_UI_ResourceBarSegment_C : public UTigerResourceBarSegmentUI
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0298   (0x0008)  
	UImage*                                            SegmentImage;                                               // 0x02A0   (0x0008)  


	/// Functions
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ResourceBarSegment.TBP_UI_ResourceBarSegment_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ResourceBarSegment.TBP_UI_ResourceBarSegment_C.ExecuteUbergraph_TBP_UI_ResourceBarSegment
	void ExecuteUbergraph_TBP_UI_ResourceBarSegment(int32_t EntryPoint);                                                     // [0x197e4f0] Final                
};

/// Class /Game/UI/Widgets/TBP_UI_FlashEffect.TBP_UI_FlashEffect_C
/// Size: 0x0028 (0x000260 - 0x000288)
class UTBP_UI_FlashEffect_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	UWidgetAnimation*                                  Flash;                                                      // 0x0268   (0x0008)  
	UImage*                                            FlashImage;                                                 // 0x0270   (0x0008)  
	FMulticastInlineDelegate                           Flash_Finished;                                             // 0x0278   (0x0010)  


	/// Functions
	// Function /Game/UI/Widgets/TBP_UI_FlashEffect.TBP_UI_FlashEffect_C.PlayFlashEffect
	void PlayFlashEffect();                                                                                                  // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_FlashEffect.TBP_UI_FlashEffect_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_FlashEffect.TBP_UI_FlashEffect_C.WidgetAnimationEvt_Flash_K2Node_WidgetAnimationEvent
	void WidgetAnimationEvt_Flash_K2Node_WidgetAnimationEvent();                                                             // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/TBP_UI_FlashEffect.TBP_UI_FlashEffect_C.ExecuteUbergraph_TBP_UI_FlashEffect
	void ExecuteUbergraph_TBP_UI_FlashEffect(int32_t EntryPoint);                                                            // [0x197e4f0] Final                
	// Function /Game/UI/Widgets/TBP_UI_FlashEffect.TBP_UI_FlashEffect_C.Flash Finished__DelegateSignature
	void Flash Finished__DelegateSignature(UTBP_UI_FlashEffect_C* Finished Effect);                                          // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/Widgets/Subwidgets/TBP_UI_Gradient.TBP_UI_Gradient_C
/// Size: 0x0034 (0x000260 - 0x000294)
class UTBP_UI_Gradient_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	UImage*                                            Gradient_image;                                             // 0x0268   (0x0008)  
	UMaterialInstanceDynamic*                          Gradient_Material_Instance;                                 // 0x0270   (0x0008)  
	bool                                               Is_Horizontal;                                              // 0x0278   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x0279   (0x0003)  MISSED
	float                                              GradientMultiplier;                                         // 0x027C   (0x0004)  
	float                                              GradientRotation;                                           // 0x0280   (0x0004)  
	unsigned char                                      UnknownData01_5[0x4];                                       // 0x0284   (0x0004)  MISSED
	UTexture2D*                                        Horizontal_Gradient_Texture;                                // 0x0288   (0x0008)  
	float                                              Gradient_Scale;                                             // 0x0290   (0x0004)  


	/// Functions
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_Gradient.TBP_UI_Gradient_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_Gradient.TBP_UI_Gradient_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_Gradient.TBP_UI_Gradient_C.ExecuteUbergraph_TBP_UI_Gradient
	void ExecuteUbergraph_TBP_UI_Gradient(int32_t EntryPoint);                                                               // [0x197e4f0] Final                
};

/// Class /Game/UI/Widgets/Subwidgets/TBP_UI_ResourceBar.TBP_UI_ResourceBar_C
/// Size: 0x003C (0x000398 - 0x0003D4)
class UTBP_UI_ResourceBar_C : public UTigerResourceBarUI
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0398   (0x0008)  
	UWidgetAnimation*                                  DamageBackgroundAnimation;                                  // 0x03A0   (0x0008)  
	UCanvasPanel*                                      CanvasPanel;                                                // 0x03A8   (0x0008)  
	UImage*                                            DamageBackground;                                           // 0x03B0   (0x0008)  
	UHorizontalBox*                                    SegmentPanel;                                               // 0x03B8   (0x0008)  
	TArray<UTBP_UI_FlashEffect_C*>                     Recycled_Flash_Effects;                                     // 0x03C0   (0x0010)  
	bool                                               Enable_Flash_Effect;                                        // 0x03D0   (0x0001)  
	bool                                               Enable_Damaged_Background;                                  // 0x03D1   (0x0001)  
	bool                                               BaseBar;                                                    // 0x03D2   (0x0001)  
	bool                                               EmptyBar;                                                   // 0x03D3   (0x0001)  


	/// Functions
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ResourceBar.TBP_UI_ResourceBar_C.OnSegmentAdded
	void OnSegmentAdded(int32_t InIndex, UTBP_UI_ResourceBarSegment_C* InSegment, UHorizontalBoxSlot* InHorizontalBoxSlot);  // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ResourceBar.TBP_UI_ResourceBar_C.ClearSegments
	void ClearSegments();                                                                                                    // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ResourceBar.TBP_UI_ResourceBar_C.CreateFlashEffect
	void CreateFlashEffect(UTBP_UI_FlashEffect_C*& Output_Get);                                                              // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ResourceBar.TBP_UI_ResourceBar_C.OnHealthLost
	void OnHealthLost();                                                                                                     // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ResourceBar.TBP_UI_ResourceBar_C.OnSegmentEmptied
	void OnSegmentEmptied(float HorizontalProgress);                                                                         // [0x197e4f0] Event|Protected|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ResourceBar.TBP_UI_ResourceBar_C.RecycleFlashEffect
	void RecycleFlashEffect(UTBP_UI_FlashEffect_C* Finished Effect);                                                         // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ResourceBar.TBP_UI_ResourceBar_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ResourceBar.TBP_UI_ResourceBar_C.ExecuteUbergraph_TBP_UI_ResourceBar
	void ExecuteUbergraph_TBP_UI_ResourceBar(int32_t EntryPoint);                                                            // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/UI/Widgets/Subwidgets/TBP_UI_ResourceBar_Shield.TBP_UI_ResourceBar_Shield_C
/// Size: 0x000C (0x0003D4 - 0x0003E0)
class UTBP_UI_ResourceBar_Shield_C : public UTBP_UI_ResourceBar_C
{ 
public:
	unsigned char                                      UnknownData00_2[0x4];                                       // 0x03D4   (0x0004)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x03D8   (0x0008)  


	/// Functions
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ResourceBar_Shield.TBP_UI_ResourceBar_Shield_C.OnInitialized
	void OnInitialized();                                                                                                    // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ResourceBar_Shield.TBP_UI_ResourceBar_Shield_C.OnShieldChanged
	void OnShieldChanged(float InNewHealth, float InNewHealthPercentage);                                                    // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_ResourceBar_Shield.TBP_UI_ResourceBar_Shield_C.ExecuteUbergraph_TBP_UI_ResourceBar_Shield
	void ExecuteUbergraph_TBP_UI_ResourceBar_Shield(int32_t EntryPoint);                                                     // [0x197e4f0] Final                
};

/// Class /Game/UI/Widgets/Subwidgets/TBP_UI_ResourceBar_Health.TBP_UI_ResourceBar_Health_C
/// Size: 0x0000 (0x0003D4 - 0x0003D4)
class UTBP_UI_ResourceBar_Health_C : public UTBP_UI_ResourceBar_C
{ 
public:
};

/// Class /Game/UI/Widgets/TBP_UI_StatusIcon.TBP_UI_StatusIcon_C
/// Size: 0x0080 (0x000280 - 0x000300)
class UTBP_UI_StatusIcon_C : public UTigerWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UWidgetAnimation*                                  Animation_Flash;                                            // 0x0288   (0x0008)  
	UWidgetAnimation*                                  Animation_BloodHunt;                                        // 0x0290   (0x0008)  
	UImage*                                            BloodHunt;                                                  // 0x0298   (0x0008)  
	UTBP_UI_Gradient_C*                                FlashImage;                                                 // 0x02A0   (0x0008)  
	UOverlay*                                          Overlay;                                                    // 0x02A8   (0x0008)  
	UTBP_UI_Gradient_C*                                shadow;                                                     // 0x02B0   (0x0008)  
	UImage*                                            StatusIconImage;                                            // 0x02B8   (0x0008)  
	ATigerPlayer*                                      Group_Member;                                               // 0x02C0   (0x0008)  
	TEnumAsByte<TBE_StatusIcon>                        ActiveStatus;                                               // 0x02C8   (0x0001)  
	unsigned char                                      UnknownData00_5[0x7];                                       // 0x02C9   (0x0007)  MISSED
	TArray<bool>                                       CurrentStatuses;                                            // 0x02D0   (0x0010)  
	TArray<TEnumAsByte>                                StatusPriority;                                             // 0x02E0   (0x0010)  
	FMulticastInlineDelegate                           OnStatusIconChanged;                                        // 0x02F0   (0x0010)  


	/// Functions
	// Function /Game/UI/Widgets/TBP_UI_StatusIcon.TBP_UI_StatusIcon_C.OnMasqueradeStateUpdated
	void OnMasqueradeStateUpdated(bool InMasqueradeBroken, ETigerAIPlayerAction InPlayerAction);                             // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_StatusIcon.TBP_UI_StatusIcon_C.SetStatusIcon
	void SetStatusIcon(TEnumAsByte<TBE_StatusIcon> InStatusIcon);                                                            // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_StatusIcon.TBP_UI_StatusIcon_C.UpdateActiveStatus
	void UpdateActiveStatus();                                                                                               // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_StatusIcon.TBP_UI_StatusIcon_C.OnReviveStateChanged
	void OnReviveStateChanged(bool InReviveActive, bool InIsTarget);                                                         // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_StatusIcon.TBP_UI_StatusIcon_C.OnDiablerizeStateChanged
	void OnDiablerizeStateChanged(bool InDiablerizeActive, bool InIsTarget);                                                 // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_StatusIcon.TBP_UI_StatusIcon_C.OnMasqueradeStateChanged
	void OnMasqueradeStateChanged(bool InMasqueradeBroken, ETigerAIPlayerAction InPlayerAction);                             // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_StatusIcon.TBP_UI_StatusIcon_C.SetPawn
	void SetPawn(APawn* InPawn);                                                                                             // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_StatusIcon.TBP_UI_StatusIcon_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_StatusIcon.TBP_UI_StatusIcon_C.ExecuteUbergraph_TBP_UI_StatusIcon
	void ExecuteUbergraph_TBP_UI_StatusIcon(int32_t EntryPoint);                                                             // [0x197e4f0] Final                
	// Function /Game/UI/Widgets/TBP_UI_StatusIcon.TBP_UI_StatusIcon_C.OnStatusIconChanged__DelegateSignature
	void OnStatusIconChanged__DelegateSignature(TEnumAsByte<TBE_StatusIcon> InNewStatusIcon);                                // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBarDamageOnly.TBP_UI_EnemyHealthBarDamageOnly_C
/// Size: 0x0030 (0x000280 - 0x0002B0)
class UTBP_UI_EnemyHealthBarDamageOnly_C : public UTigerUIEnemyHealthBar
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	float                                              LastDamageTime;                                             // 0x0288   (0x0004)  
	unsigned char                                      UnknownData00_5[0x4];                                       // 0x028C   (0x0004)  MISSED
	UTBP_UI_DamageNumber_C*                            CurrentDamageNumberUI;                                      // 0x0290   (0x0008)  
	bool                                               bIsGroupMember;                                             // 0x0298   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0299   (0x0003)  MISSED
	float                                              DamageNumberUpdateTime;                                     // 0x029C   (0x0004)  
	float                                              DamageNumberUpdateGraceTime;                                // 0x02A0   (0x0004)  
	unsigned char                                      UnknownData02_5[0x4];                                       // 0x02A4   (0x0004)  MISSED
	ATigerCharacter*                                   TigerCharacterOwner;                                        // 0x02A8   (0x0008)  


	/// Functions
	// Function /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBarDamageOnly.TBP_UI_EnemyHealthBarDamageOnly_C.SetTigerCharacter
	void SetTigerCharacter(ATigerCharacter* TigerCharacter);                                                                 // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBarDamageOnly.TBP_UI_EnemyHealthBarDamageOnly_C.Set Damage Amount
	void Set Damage Amount(FVector InHitLocation, FLinearColor InDamageColor, int32_t InTotalDamageAmount, int32_t InHealthDamageAmount, bool InHasExtraHealth, bool InHasShield, float InRangedDamageFalloffPercent, bool InBelowLowHealthThreshold); // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBarDamageOnly.TBP_UI_EnemyHealthBarDamageOnly_C.UpdateCurrentDamageNumber
	void UpdateCurrentDamageNumber();                                                                                        // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBarDamageOnly.TBP_UI_EnemyHealthBarDamageOnly_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBarDamageOnly.TBP_UI_EnemyHealthBarDamageOnly_C.Tick
	void Tick(FGeometry MyGeometry, float InDeltaTime);                                                                      // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBarDamageOnly.TBP_UI_EnemyHealthBarDamageOnly_C.ExecuteUbergraph_TBP_UI_EnemyHealthBarDamageOnly
	void ExecuteUbergraph_TBP_UI_EnemyHealthBarDamageOnly(int32_t EntryPoint);                                               // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/UI/Widgets/TBP_UI_Tooltip.TBP_UI_Tooltip_C
/// Size: 0x0080 (0x000280 - 0x000300)
class UTBP_UI_Tooltip_C : public UTigerWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UTigerRichTextBlock*                               Description;                                                // 0x0288   (0x0008)  
	UTBP_UI_Box_C*                                     TBP_UI_Box;                                                 // 0x0290   (0x0008)  
	UTBP_UI_Line_C*                                    TBP_UI_Line;                                                // 0x0298   (0x0008)  
	UTextBlock*                                        TextBlock;                                                  // 0x02A0   (0x0008)  
	float                                              Time_Since_Set;                                             // 0x02A8   (0x0004)  
	float                                              Current_Opacity;                                            // 0x02AC   (0x0004)  
	UTigerItemAsset*                                   Item;                                                       // 0x02B0   (0x0008)  
	FText                                              AttachedElementName;                                        // 0x02B8   (0x0018)  
	UUserWidget*                                       AttachedElement;                                            // 0x02D0   (0x0008)  
	FText                                              AttachedElementDescription;                                 // 0x02D8   (0x0018)  
	FLinearColor                                       AttachedElementNameColor;                                   // 0x02F0   (0x0010)  


	/// Functions
	// Function /Game/UI/Widgets/TBP_UI_Tooltip.TBP_UI_Tooltip_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_Tooltip.TBP_UI_Tooltip_C.Destruct
	void Destruct();                                                                                                         // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_Tooltip.TBP_UI_Tooltip_C.ExecuteUbergraph_TBP_UI_Tooltip
	void ExecuteUbergraph_TBP_UI_Tooltip(int32_t EntryPoint);                                                                // [0x197e4f0] Final                
};

/// Class /Game/UI/BlueprintFunctionLibraries/TBFL_TypeAndRarity.TBFL_TypeAndRarity_C
/// Size: 0x0000 (0x000028 - 0x000028)
class UTBFL_TypeAndRarity_C : public UBlueprintFunctionLibrary
{ 
public:
};

/// Class /Game/UI/Widgets/TBP_UI_DamageBase.TBP_UI_DamageBase_C
/// Size: 0x0011 (0x000280 - 0x000291)
class UTBP_UI_DamageBase_C : public UTigerWidget
{ 
public:
	FVector                                            EnemyLocation;                                              // 0x0280   (0x000C)  
	float                                              CanHandleAngle;                                             // 0x028C   (0x0004)  
	bool                                               bIsVisible;                                                 // 0x0290   (0x0001)  


	/// Functions
	// Function /Game/UI/Widgets/TBP_UI_DamageBase.TBP_UI_DamageBase_C.HasExtraHealth
	void HasExtraHealth(ATigerPlayer* Player, bool& HasExtraHealth);                                                         // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Widgets/TBP_UI_DamageBase.TBP_UI_DamageBase_C.GetWidgetColor
	void GetWidgetColor(ATBP_Player_C* Player, FLinearColor& Color);                                                         // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Widgets/TBP_UI_DamageBase.TBP_UI_DamageBase_C.CanHandleDirection
	void CanHandleDirection(FVector DamageLocation, bool& IsHandled);                                                        // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_DamageBase.TBP_UI_DamageBase_C.OnDamage
	void OnDamage(FVector DamageLocation, float DamageAmount, float NewHealthAmount, bool& IsHandled);                       // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_DamageBase.TBP_UI_DamageBase_C.IsAlive
	void IsAlive(bool& IsAlive);                                                                                             // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
};

/// Class /Game/UI/Widgets/TBP_UI_LowHealth.TBP_UI_LowHealth_C
/// Size: 0x009F (0x000291 - 0x000330)
class UTBP_UI_LowHealth_C : public UTBP_UI_DamageBase_C
{ 
public:
	unsigned char                                      UnknownData00_2[0x7];                                       // 0x0291   (0x0007)  MISSED
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0298   (0x0008)  
	UWidgetAnimation*                                  ShieldDepleted;                                             // 0x02A0   (0x0008)  
	UWidgetAnimation*                                  ExtraHealthDepleted;                                        // 0x02A8   (0x0008)  
	UWidgetAnimation*                                  TakeDamage;                                                 // 0x02B0   (0x0008)  
	UImage*                                            BorderDamageIndicator;                                      // 0x02B8   (0x0008)  
	UCanvasPanel*                                      CP_BloodSplatter;                                           // 0x02C0   (0x0008)  
	UImage*                                            ExtraHealthDepletedWidget;                                  // 0x02C8   (0x0008)  
	UImage*                                            LowHealthWidget;                                            // 0x02D0   (0x0008)  
	UImage*                                            ShieldDepletedWidget;                                       // 0x02D8   (0x0008)  
	UImage*                                            texture_HighDmg;                                            // 0x02E0   (0x0008)  
	UImage*                                            texture_LowDmg;                                             // 0x02E8   (0x0008)  
	float                                              CurrentDamageIndicator;                                     // 0x02F0   (0x0004)  
	float                                              MaxDamageIndicator;                                         // 0x02F4   (0x0004)  
	float                                              DesiredDamageIndicator;                                     // 0x02F8   (0x0004)  
	float                                              LowHealthIndicatorPower;                                    // 0x02FC   (0x0004)  
	float                                              DamageIndicatorSpeed;                                       // 0x0300   (0x0004)  
	float                                              Pulse;                                                      // 0x0304   (0x0004)  
	float                                              CurrentPulse;                                               // 0x0308   (0x0004)  
	FVector                                            DamageLocation;                                             // 0x030C   (0x000C)  
	bool                                               CanSetLowHealthPower;                                       // 0x0318   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0319   (0x0003)  MISSED
	int32_t                                            PlayerLowHealthAkEventID;                                   // 0x031C   (0x0004)  
	ATBP_Player_C*                                     Player;                                                     // 0x0320   (0x0008)  
	float                                              PreviousHealthPercentage;                                   // 0x0328   (0x0004)  
	float                                              PreviousLowHealthPercentage;                                // 0x032C   (0x0004)  


	/// Functions
	// Function /Game/UI/Widgets/TBP_UI_LowHealth.TBP_UI_LowHealth_C.UpdateBloodSplatter
	void UpdateBloodSplatter();                                                                                              // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_LowHealth.TBP_UI_LowHealth_C.IsLowHealth
	bool IsLowHealth();                                                                                                      // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Widgets/TBP_UI_LowHealth.TBP_UI_LowHealth_C.StopLowHealthAudio
	void StopLowHealthAudio();                                                                                               // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_LowHealth.TBP_UI_LowHealth_C.GetHitDirection
	void GetHitDirection(ATBP_Player_C* Player, FVector DamageLocation, FVector& Output);                                    // [0x197e4f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_LowHealth.TBP_UI_LowHealth_C.OnDamage
	void OnDamage(FVector DamageLocation, float DamageAmount, float NewHealthAmount, bool& IsHandled);                       // [0x197e4f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_LowHealth.TBP_UI_LowHealth_C.UpdatePulse
	void UpdatePulse(float Delta Seconds);                                                                                   // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_LowHealth.TBP_UI_LowHealth_C.Update Low Health Overlay
	void Update Low Health Overlay(float Delta Seconds);                                                                     // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_LowHealth.TBP_UI_LowHealth_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_LowHealth.TBP_UI_LowHealth_C.Tick
	void Tick(FGeometry MyGeometry, float InDeltaTime);                                                                      // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_LowHealth.TBP_UI_LowHealth_C.OnExtraHealthDepleted
	void OnExtraHealthDepleted();                                                                                            // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_LowHealth.TBP_UI_LowHealth_C.ExtraHealthAnimationFinished
	void ExtraHealthAnimationFinished();                                                                                     // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_LowHealth.TBP_UI_LowHealth_C.ExtraHealthAnimationStarted
	void ExtraHealthAnimationStarted();                                                                                      // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_LowHealth.TBP_UI_LowHealth_C.TakeDamageAnimationFinished
	void TakeDamageAnimationFinished();                                                                                      // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_LowHealth.TBP_UI_LowHealth_C.TakeDamageAnimationStarted
	void TakeDamageAnimationStarted();                                                                                       // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_LowHealth.TBP_UI_LowHealth_C.OnShieldDepleted
	void OnShieldDepleted();                                                                                                 // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_LowHealth.TBP_UI_LowHealth_C.ShieldDepletedAnimationFinished
	void ShieldDepletedAnimationFinished();                                                                                  // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_LowHealth.TBP_UI_LowHealth_C.ShieldDepletedAnimationStarted
	void ShieldDepletedAnimationStarted();                                                                                   // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_LowHealth.TBP_UI_LowHealth_C.PlayLowHealthOneShot
	void PlayLowHealthOneShot(float NewHealth);                                                                              // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_LowHealth.TBP_UI_LowHealth_C.ExecuteUbergraph_TBP_UI_LowHealth
	void ExecuteUbergraph_TBP_UI_LowHealth(int32_t EntryPoint);                                                              // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/UI/Widgets/Map/MapMarkers/TBP_UI_ScoutedPlayerMarker.TBP_UI_ScoutedPlayerMarker_C
/// Size: 0x0010 (0x0002D0 - 0x0002E0)
class UTBP_UI_ScoutedPlayerMarker_C : public UTBP_UI_MapMarker_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02D0   (0x0008)  
	UImage*                                            Image;                                                      // 0x02D8   (0x0008)  


	/// Functions
	// Function /Game/UI/Widgets/Map/MapMarkers/TBP_UI_ScoutedPlayerMarker.TBP_UI_ScoutedPlayerMarker_C.GetToolTipWidget
	UWidget* GetToolTipWidget();                                                                                             // [0x197e4f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Widgets/Map/MapMarkers/TBP_UI_ScoutedPlayerMarker.TBP_UI_ScoutedPlayerMarker_C.GetColorAndOpacity
	FLinearColor GetColorAndOpacity();                                                                                       // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Widgets/Map/MapMarkers/TBP_UI_ScoutedPlayerMarker.TBP_UI_ScoutedPlayerMarker_C.Tick
	void Tick(FGeometry MyGeometry, float InDeltaTime);                                                                      // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Map/MapMarkers/TBP_UI_ScoutedPlayerMarker.TBP_UI_ScoutedPlayerMarker_C.OnIsOnMinimapIsSet
	void OnIsOnMinimapIsSet(bool bInIsOnMinimap);                                                                            // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Map/MapMarkers/TBP_UI_ScoutedPlayerMarker.TBP_UI_ScoutedPlayerMarker_C.ExecuteUbergraph_TBP_UI_ScoutedPlayerMarker
	void ExecuteUbergraph_TBP_UI_ScoutedPlayerMarker(int32_t EntryPoint);                                                    // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/UI/Widgets/Map/MapMarkers/TBP_UI_ScoutedNpcMarker.TBP_UI_ScoutedNpcMarker_C
/// Size: 0x0010 (0x0002D0 - 0x0002E0)
class UTBP_UI_ScoutedNpcMarker_C : public UTBP_UI_MapMarker_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02D0   (0x0008)  
	UImage*                                            Image;                                                      // 0x02D8   (0x0008)  


	/// Functions
	// Function /Game/UI/Widgets/Map/MapMarkers/TBP_UI_ScoutedNpcMarker.TBP_UI_ScoutedNpcMarker_C.GetToolTipWidget
	UWidget* GetToolTipWidget();                                                                                             // [0x197e4f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Widgets/Map/MapMarkers/TBP_UI_ScoutedNpcMarker.TBP_UI_ScoutedNpcMarker_C.GetColorAndOpacity
	FLinearColor GetColorAndOpacity();                                                                                       // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Widgets/Map/MapMarkers/TBP_UI_ScoutedNpcMarker.TBP_UI_ScoutedNpcMarker_C.Tick
	void Tick(FGeometry MyGeometry, float InDeltaTime);                                                                      // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Map/MapMarkers/TBP_UI_ScoutedNpcMarker.TBP_UI_ScoutedNpcMarker_C.OnIsOnMinimapIsSet
	void OnIsOnMinimapIsSet(bool bInIsOnMinimap);                                                                            // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Map/MapMarkers/TBP_UI_ScoutedNpcMarker.TBP_UI_ScoutedNpcMarker_C.ExecuteUbergraph_TBP_UI_ScoutedNpcMarker
	void ExecuteUbergraph_TBP_UI_ScoutedNpcMarker(int32_t EntryPoint);                                                       // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBar.TBP_UI_EnemyHealthBar_C
/// Size: 0x00D2 (0x0002B0 - 0x000382)
class UTBP_UI_EnemyHealthBar_C : public UTBP_UI_EnemyHealthBarDamageOnly_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02B0   (0x0008)  
	UOverlay*                                          BarContainer;                                               // 0x02B8   (0x0008)  
	UImage*                                            ClanIcon;                                                   // 0x02C0   (0x0008)  
	UCanvasPanel*                                      IconRootCanvas;                                             // 0x02C8   (0x0008)  
	UImage*                                            PlatfromIndicator;                                          // 0x02D0   (0x0008)  
	UImage*                                            PlayerColorBox;                                             // 0x02D8   (0x0008)  
	UTigerStyledRichTextBlock*                         PlayerNameplate;                                            // 0x02E0   (0x0008)  
	UOverlay*                                          ReviveDiaberieOverlay;                                      // 0x02E8   (0x0008)  
	UTigerStyledRichTextBlock*                         ReviveDiablerieLabel;                                       // 0x02F0   (0x0008)  
	UCanvasPanel*                                      RootPanel;                                                  // 0x02F8   (0x0008)  
	UTBP_UI_HorizontalFadeSlot_C*                      TBP_UI_HorizontalFadeSlot;                                  // 0x0300   (0x0008)  
	UTBP_UI_ResourceBar_Health_C*                      TBP_UI_ResourceBar_Health;                                  // 0x0308   (0x0008)  
	UTBP_UI_ResourceBar_Health_C*                      TBP_UI_ResourceBar_Health_;                                 // 0x0310   (0x0008)  
	UTBP_UI_ResourceBar_Health_C*                      TBP_UI_ResourceBar_HealthEmpty;                             // 0x0318   (0x0008)  
	UTBP_UI_ResourceBar_Shield_C*                      TBP_UI_ResourceBar_Shield;                                  // 0x0320   (0x0008)  
	UTBP_UI_ResourceBar_Shield_C*                      TBP_UI_ResourceBar_Shield_;                                 // 0x0328   (0x0008)  
	UTBP_UI_ResourceBar_Shield_C*                      TBP_UI_ResourceBar_ShieldBase;                              // 0x0330   (0x0008)  
	UTBP_UI_StatusIcon_C*                              TBP_UI_StatusIcon;                                          // 0x0338   (0x0008)  
	bool                                               bIsVisible;                                                 // 0x0340   (0x0001)  
	bool                                               bIsNameplateVisible;                                        // 0x0341   (0x0001)  
	unsigned char                                      UnknownData00_5[0x2];                                       // 0x0342   (0x0002)  MISSED
	float                                              CurrentOpacity;                                             // 0x0344   (0x0004)  
	float                                              TimeLeftUntilFade;                                          // 0x0348   (0x0004)  
	float                                              CONST_AlwaysVisibleDistance;                                // 0x034C   (0x0004)  
	float                                              CONST_FriendlyVisibleDistance;                              // 0x0350   (0x0004)  
	float                                              CONST_FadeOutSpeedOnDeath;                                  // 0x0354   (0x0004)  
	float                                              CONST_FadeOutDelayOnDeath;                                  // 0x0358   (0x0004)  
	float                                              CONST_FadeOutDelay;                                         // 0x035C   (0x0004)  
	float                                              CONST_FadeSpeedInOut;                                       // 0x0360   (0x0004)  
	float                                              CONST_DisplayTimeAfterDamage;                               // 0x0364   (0x0004)  
	ATigerPlayer*                                      TigerPlayer;                                                // 0x0368   (0x0008)  
	ATigerPlayer*                                      GroupMember;                                                // 0x0370   (0x0008)  
	ATigerPlayerState*                                 GroupMemberState;                                           // 0x0378   (0x0008)  
	bool                                               bCanSetIsGroupMember;                                       // 0x0380   (0x0001)  
	bool                                               bCanSetIsNotGroupMember;                                    // 0x0381   (0x0001)  


	/// Functions
	// Function /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBar.TBP_UI_EnemyHealthBar_C.GetDistanceToLocalPlayer
	void GetDistanceToLocalPlayer(ATigerCharacter* InCharacter, float& Distance);                                            // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBar.TBP_UI_EnemyHealthBar_C.SetTigerCharacter
	void SetTigerCharacter(ATigerCharacter* TigerCharacter);                                                                 // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBar.TBP_UI_EnemyHealthBar_C.UpdateHealthBar
	void UpdateHealthBar(float CurrentShield, float CurrentHealth, float MaxHealth);                                         // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBar.TBP_UI_EnemyHealthBar_C.OnPowerKitChanged
	void OnPowerKitChanged();                                                                                                // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBar.TBP_UI_EnemyHealthBar_C.GetClanIcon
	FSlateBrush GetClanIcon();                                                                                               // [0x197e4f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBar.TBP_UI_EnemyHealthBar_C.OnPlayerStatusChanged
	void OnPlayerStatusChanged(TEnumAsByte<TBE_StatusIcon> InNewState);                                                      // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBar.TBP_UI_EnemyHealthBar_C.UpdateIsGroupMember
	void UpdateIsGroupMember(bool bInIsGroupmember);                                                                         // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBar.TBP_UI_EnemyHealthBar_C.IsSpectatedByLocalPlayer
	bool IsSpectatedByLocalPlayer(ATigerCharacter* TigerCharacter);                                                          // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBar.TBP_UI_EnemyHealthBar_C.IsGroupedWithLocalPlayer
	bool IsGroupedWithLocalPlayer(ATigerCharacter* TigerCharacter);                                                          // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBar.TBP_UI_EnemyHealthBar_C.IsAlliedWithLocalPlayer
	bool IsAlliedWithLocalPlayer(ATigerCharacter* TigerCharacter);                                                           // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBar.TBP_UI_EnemyHealthBar_C.ShieldBreak
	void ShieldBreak();                                                                                                      // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBar.TBP_UI_EnemyHealthBar_C.ExtraHealthBreak
	void ExtraHealthBreak();                                                                                                 // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBar.TBP_UI_EnemyHealthBar_C.OldShouldBeVisible
	void OldShouldBeVisible(bool& bVisible, bool& bIsAlive);                                                                 // [0x197e4f0] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBar.TBP_UI_EnemyHealthBar_C.UpdateDownedTimer
	void UpdateDownedTimer();                                                                                                // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBar.TBP_UI_EnemyHealthBar_C.OnUpdatedPlayerState
	void OnUpdatedPlayerState(APlayerState* PlayerState);                                                                    // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBar.TBP_UI_EnemyHealthBar_C.RemoveMarkingAsGroupMember
	void RemoveMarkingAsGroupMember();                                                                                       // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBar.TBP_UI_EnemyHealthBar_C.MarkAsGroupMember
	void MarkAsGroupMember();                                                                                                // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBar.TBP_UI_EnemyHealthBar_C.IsPlayerInElysim
	void IsPlayerInElysim(bool& IsPlayerInElyusium);                                                                         // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBar.TBP_UI_EnemyHealthBar_C.UpdateVisibility
	void UpdateVisibility(bool InIsVisible, bool bIsAlive, float DeltaSeconds);                                              // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBar.TBP_UI_EnemyHealthBar_C.ShouldBeVisible
	void ShouldBeVisible(bool& bVisible, bool& bIsAlive);                                                                    // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBar.TBP_UI_EnemyHealthBar_C.OnPlayerNameChanged
	void OnPlayerNameChanged();                                                                                              // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBar.TBP_UI_EnemyHealthBar_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBar.TBP_UI_EnemyHealthBar_C.AddHealAmount
	void AddHealAmount(int32_t InHealAmount);                                                                                // [0x197e4f0] Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBar.TBP_UI_EnemyHealthBar_C.NewOwner
	void NewOwner();                                                                                                         // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBar.TBP_UI_EnemyHealthBar_C.Tick
	void Tick(FGeometry MyGeometry, float InDeltaTime);                                                                      // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/InWorld/TBP_UI_EnemyHealthBar.TBP_UI_EnemyHealthBar_C.ExecuteUbergraph_TBP_UI_EnemyHealthBar
	void ExecuteUbergraph_TBP_UI_EnemyHealthBar(int32_t EntryPoint);                                                         // [0x197e4f0] Final|HasDefaults    
};

/// Class /Game/UI/Widgets/Subwidgets/TBP_UI_Box.TBP_UI_Box_C
/// Size: 0x0148 (0x000260 - 0x0003A8)
class UTBP_UI_Box_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	UImage*                                            Background;                                                 // 0x0268   (0x0008)  
	UImage*                                            Bottom;                                                     // 0x0270   (0x0008)  
	UImage*                                            BottomLeft;                                                 // 0x0278   (0x0008)  
	UImage*                                            BottomRight;                                                // 0x0280   (0x0008)  
	UNamedSlot*                                        Content;                                                    // 0x0288   (0x0008)  
	UCanvasPanel*                                      ContentCanvas;                                              // 0x0290   (0x0008)  
	UImage*                                            Left;                                                       // 0x0298   (0x0008)  
	UImage*                                            Right;                                                      // 0x02A0   (0x0008)  
	UImage*                                            Top;                                                        // 0x02A8   (0x0008)  
	UImage*                                            TopLeft;                                                    // 0x02B0   (0x0008)  
	UImage*                                            TopRight;                                                   // 0x02B8   (0x0008)  
	UTexture2D*                                        TopLeftTexture;                                             // 0x02C0   (0x0008)  
	UTexture2D*                                        TopRightTexture;                                            // 0x02C8   (0x0008)  
	UTexture2D*                                        TopTexture;                                                 // 0x02D0   (0x0008)  
	UTexture2D*                                        LeftTexture;                                                // 0x02D8   (0x0008)  
	UTexture2D*                                        RightTexture;                                               // 0x02E0   (0x0008)  
	UTexture2D*                                        BottomLeftTexture;                                          // 0x02E8   (0x0008)  
	UTexture2D*                                        BottomRightTexture;                                         // 0x02F0   (0x0008)  
	UTexture2D*                                        BottomTexture;                                              // 0x02F8   (0x0008)  
	FMargin                                            MarginPixels;                                               // 0x0300   (0x0010)  
	FVector2D                                          PaddingPercent;                                             // 0x0310   (0x0008)  
	FSlateBrush                                        BackgroundBrush;                                            // 0x0318   (0x0088)  
	FVector2D                                          OverrideSize;                                               // 0x03A0   (0x0008)  


	/// Functions
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_Box.TBP_UI_Box_C.ShouldSetSize
	void ShouldSetSize(bool& ShouldSetSize);                                                                                 // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_Box.TBP_UI_Box_C.SetBorderOpacity
	void SetBorderOpacity(float InOpacity);                                                                                  // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_Box.TBP_UI_Box_C.SetBorderTexture
	void SetBorderTexture(UImage* ImageToSet, UTexture2D* TextureToUse);                                                     // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_Box.TBP_UI_Box_C.CalculateMargin
	void CalculateMargin();                                                                                                  // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_Box.TBP_UI_Box_C.SetupBorder
	void SetupBorder();                                                                                                      // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_Box.TBP_UI_Box_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_Box.TBP_UI_Box_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Subwidgets/TBP_UI_Box.TBP_UI_Box_C.ExecuteUbergraph_TBP_UI_Box
	void ExecuteUbergraph_TBP_UI_Box(int32_t EntryPoint);                                                                    // [0x197e4f0] Final                
};

/// Class /Game/UI/Widgets/Effects/TBP_UI_TransitionMenuButton.TBP_UI_TransitionMenuButton_C
/// Size: 0x0128 (0x000260 - 0x000388)
class UTBP_UI_TransitionMenuButton_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	UWidgetAnimation*                                  Deselected;                                                 // 0x0268   (0x0008)  
	UWidgetAnimation*                                  Pressed;                                                    // 0x0270   (0x0008)  
	UWidgetAnimation*                                  Hover;                                                      // 0x0278   (0x0008)  
	UWidgetAnimation*                                  FadeIn;                                                     // 0x0280   (0x0008)  
	UImage*                                            BG_Solid;                                                   // 0x0288   (0x0008)  
	UBorder*                                           Border_Outline;                                             // 0x0290   (0x0008)  
	UButton*                                           Button;                                                     // 0x0298   (0x0008)  
	UTBP_UI_Box_C*                                     ButtonSelectionBorder;                                      // 0x02A0   (0x0008)  
	UImage*                                            CloudWidget;                                                // 0x02A8   (0x0008)  
	UNamedSlot*                                        ContentOverride;                                            // 0x02B0   (0x0008)  
	UImage*                                            FadedBgWidget;                                              // 0x02B8   (0x0008)  
	UImage*                                            FlashOverlay;                                               // 0x02C0   (0x0008)  
	UTBP_UI_TransitionWidget_C*                        InnerTransitionWidget;                                      // 0x02C8   (0x0008)  
	FMulticastInlineDelegate                           OnClicked;                                                  // 0x02D0   (0x0010)  
	FMulticastInlineDelegate                           OnHovered;                                                  // 0x02E0   (0x0010)  
	FMulticastInlineDelegate                           OnUnhovered;                                                // 0x02F0   (0x0010)  
	float                                              AnimationDelay;                                             // 0x0300   (0x0004)  
	float                                              BorderOpacityTarget;                                        // 0x0304   (0x0004)  
	float                                              BorderOpacity;                                              // 0x0308   (0x0004)  
	float                                              BorderOpacitySpeed;                                         // 0x030C   (0x0004)  
	bool                                               bBoldBorder;                                                // 0x0310   (0x0001)  
	TEnumAsByte<EUMGSequencePlayMode>                  LastPressedPlayMode;                                        // 0x0311   (0x0001)  
	bool                                               IsSelectable;                                               // 0x0312   (0x0001)  
	unsigned char                                      UnknownData00_5[0x5];                                       // 0x0313   (0x0005)  MISSED
	UMaterialInstanceDynamic*                          BorderMaterial;                                             // 0x0318   (0x0008)  
	bool                                               bShowHoverBorder;                                           // 0x0320   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x0321   (0x0003)  MISSED
	FLinearColor                                       BackgroundColor;                                            // 0x0324   (0x0010)  
	FLinearColor                                       UnhoveredBorderColor;                                       // 0x0334   (0x0010)  
	FLinearColor                                       HoveredBorderColor;                                         // 0x0344   (0x0010)  
	bool                                               bEnableClouds;                                              // 0x0354   (0x0001)  
	unsigned char                                      UnknownData02_5[0x3];                                       // 0x0355   (0x0003)  MISSED
	float                                              ContentFadeInDelay;                                         // 0x0358   (0x0004)  
	bool                                               bIsSelected;                                                // 0x035C   (0x0001)  
	bool                                               bIsWaitingForFadeIn;                                        // 0x035D   (0x0001)  
	unsigned char                                      UnknownData03_5[0x2];                                       // 0x035E   (0x0002)  MISSED
	FSlateColor                                        CloudTintColor;                                             // 0x0360   (0x0028)  


	/// Functions
	// Function /Game/UI/Widgets/Effects/TBP_UI_TransitionMenuButton.TBP_UI_TransitionMenuButton_C.SetBackgroundColor
	void SetBackgroundColor(FLinearColor InBackgroundColor);                                                                 // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Effects/TBP_UI_TransitionMenuButton.TBP_UI_TransitionMenuButton_C.IsSelected
	void IsSelected(bool& IsSelected);                                                                                       // [0x197e4f0] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/UI/Widgets/Effects/TBP_UI_TransitionMenuButton.TBP_UI_TransitionMenuButton_C.SetIsDeselected
	void SetIsDeselected();                                                                                                  // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Effects/TBP_UI_TransitionMenuButton.TBP_UI_TransitionMenuButton_C.SetIsSelected
	void SetIsSelected();                                                                                                    // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Effects/TBP_UI_TransitionMenuButton.TBP_UI_TransitionMenuButton_C.CreateCloudBackground
	void CreateCloudBackground();                                                                                            // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Effects/TBP_UI_TransitionMenuButton.TBP_UI_TransitionMenuButton_C.PlayPressedOverlayAnimation
	void PlayPressedOverlayAnimation(TEnumAsByte<EUMGSequencePlayMode> PlayMode);                                            // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Effects/TBP_UI_TransitionMenuButton.TBP_UI_TransitionMenuButton_C.PlayAnimationFromCurrentPosition
	void PlayAnimationFromCurrentPosition(UWidgetAnimation* InAnimation, TEnumAsByte<EUMGSequencePlayMode> InPlayMode);      // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Effects/TBP_UI_TransitionMenuButton.TBP_UI_TransitionMenuButton_C.CreateBorderMaterial
	void CreateBorderMaterial();                                                                                             // [0x197e4f0] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Effects/TBP_UI_TransitionMenuButton.TBP_UI_TransitionMenuButton_C.UpdateBorderOpacity
	void UpdateBorderOpacity(float InDeltaTime);                                                                             // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Effects/TBP_UI_TransitionMenuButton.TBP_UI_TransitionMenuButton_C.Tick
	void Tick(FGeometry MyGeometry, float InDeltaTime);                                                                      // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Effects/TBP_UI_TransitionMenuButton.TBP_UI_TransitionMenuButton_C.OnRemovedFromFocusPath
	void OnRemovedFromFocusPath(FFocusEvent InFocusEvent);                                                                   // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Effects/TBP_UI_TransitionMenuButton.TBP_UI_TransitionMenuButton_C.OnInitialized
	void OnInitialized();                                                                                                    // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Effects/TBP_UI_TransitionMenuButton.TBP_UI_TransitionMenuButton_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Effects/TBP_UI_TransitionMenuButton.TBP_UI_TransitionMenuButton_C.BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
	void BndEvt__Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();                                // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Effects/TBP_UI_TransitionMenuButton.TBP_UI_TransitionMenuButton_C.BndEvt__Button_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature
	void BndEvt__Button_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();                                // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Effects/TBP_UI_TransitionMenuButton.TBP_UI_TransitionMenuButton_C.BndEvt__Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	void BndEvt__Button_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();                              // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Effects/TBP_UI_TransitionMenuButton.TBP_UI_TransitionMenuButton_C.BndEvt__Button_K2Node_ComponentBoundEvent_5_OnButtonPressedEvent__DelegateSignature
	void BndEvt__Button_K2Node_ComponentBoundEvent_5_OnButtonPressedEvent__DelegateSignature();                              // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Effects/TBP_UI_TransitionMenuButton.TBP_UI_TransitionMenuButton_C.BndEvt__Button_K2Node_ComponentBoundEvent_6_OnButtonReleasedEvent__DelegateSignature
	void BndEvt__Button_K2Node_ComponentBoundEvent_6_OnButtonReleasedEvent__DelegateSignature();                             // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Effects/TBP_UI_TransitionMenuButton.TBP_UI_TransitionMenuButton_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Effects/TBP_UI_TransitionMenuButton.TBP_UI_TransitionMenuButton_C.OnTransitionStarted
	void OnTransitionStarted();                                                                                              // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Effects/TBP_UI_TransitionMenuButton.TBP_UI_TransitionMenuButton_C.RestartAnimation
	void RestartAnimation();                                                                                                 // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Effects/TBP_UI_TransitionMenuButton.TBP_UI_TransitionMenuButton_C.WidgetAnimationEvt_Pressed_K2Node_WidgetAnimationEvent
	void WidgetAnimationEvt_Pressed_K2Node_WidgetAnimationEvent();                                                           // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Effects/TBP_UI_TransitionMenuButton.TBP_UI_TransitionMenuButton_C.DisableInput
	void DisableInput();                                                                                                     // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Effects/TBP_UI_TransitionMenuButton.TBP_UI_TransitionMenuButton_C.ExecuteUbergraph_TBP_UI_TransitionMenuButton
	void ExecuteUbergraph_TBP_UI_TransitionMenuButton(int32_t EntryPoint);                                                   // [0x197e4f0] Final|HasDefaults    
	// Function /Game/UI/Widgets/Effects/TBP_UI_TransitionMenuButton.TBP_UI_TransitionMenuButton_C.OnUnhovered__DelegateSignature
	void OnUnhovered__DelegateSignature();                                                                                   // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Effects/TBP_UI_TransitionMenuButton.TBP_UI_TransitionMenuButton_C.OnHovered__DelegateSignature
	void OnHovered__DelegateSignature();                                                                                     // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Effects/TBP_UI_TransitionMenuButton.TBP_UI_TransitionMenuButton_C.OnClicked__DelegateSignature
	void OnClicked__DelegateSignature();                                                                                     // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/Widgets/GameModeSelection/TBP_UI_Scrollbox_Ornament.TBP_UI_Scrollbox_Ornament_C
/// Size: 0x0030 (0x000260 - 0x000290)
class UTBP_UI_Scrollbox_Ornament_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	UImage*                                            Line;                                                       // 0x0268   (0x0008)  
	UHorizontalBox*                                    ModesHorizontalBox;                                         // 0x0270   (0x0008)  
	UImage*                                            OrnamentLeft;                                               // 0x0278   (0x0008)  
	UImage*                                            OrnamentRight;                                              // 0x0280   (0x0008)  
	UScrollBox*                                        ScrollBox;                                                  // 0x0288   (0x0008)  


	/// Functions
	// Function /Game/UI/Widgets/GameModeSelection/TBP_UI_Scrollbox_Ornament.TBP_UI_Scrollbox_Ornament_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/GameModeSelection/TBP_UI_Scrollbox_Ornament.TBP_UI_Scrollbox_Ornament_C.ExecuteUbergraph_TBP_UI_Scrollbox_Ornament
	void ExecuteUbergraph_TBP_UI_Scrollbox_Ornament(int32_t EntryPoint);                                                     // [0x197e4f0] Final                
};

/// Class /Game/UI/Widgets/Elysium/GameMenu/TBP_UI_NewNotification.TBP_UI_NewNotification_C
/// Size: 0x004A (0x000280 - 0x0002CA)
class UTBP_UI_NewNotification_C : public UTigerWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UWidgetAnimation*                                  FadeOut;                                                    // 0x0288   (0x0008)  
	UWidgetAnimation*                                  PulseAnimation;                                             // 0x0290   (0x0008)  
	UImage*                                            NewNotificationIcon;                                        // 0x0298   (0x0008)  
	UImage*                                            NewNotificationIconGlow;                                    // 0x02A0   (0x0008)  
	UOverlay*                                          NotificationDotContainer;                                   // 0x02A8   (0x0008)  
	UImage*                                            PulseRing1;                                                 // 0x02B0   (0x0008)  
	UImage*                                            PulseRing2;                                                 // 0x02B8   (0x0008)  
	UImage*                                            SmokeVFX;                                                   // 0x02C0   (0x0008)  
	ETigerNewNotificationMenuOptions                   NewNotificationMenuType;                                    // 0x02C8   (0x0001)  
	bool                                               bIsSetUp;                                                   // 0x02C9   (0x0001)  


	/// Functions
	// Function /Game/UI/Widgets/Elysium/GameMenu/TBP_UI_NewNotification.TBP_UI_NewNotification_C.SetVisible
	void SetVisible(bool InVisible);                                                                                         // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/TBP_UI_NewNotification.TBP_UI_NewNotification_C.Initialize
	void Initialize();                                                                                                       // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/TBP_UI_NewNotification.TBP_UI_NewNotification_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/TBP_UI_NewNotification.TBP_UI_NewNotification_C.Destruct
	void Destruct();                                                                                                         // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/TBP_UI_NewNotification.TBP_UI_NewNotification_C.CheckShouldBeActive
	void CheckShouldBeActive();                                                                                              // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/TBP_UI_NewNotification.TBP_UI_NewNotification_C.BindNewsUpdateEvent
	void BindNewsUpdateEvent();                                                                                              // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/TBP_UI_NewNotification.TBP_UI_NewNotification_C.OnHide
	void OnHide(float DelayTime);                                                                                            // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/GameMenu/TBP_UI_NewNotification.TBP_UI_NewNotification_C.ExecuteUbergraph_TBP_UI_NewNotification
	void ExecuteUbergraph_TBP_UI_NewNotification(int32_t EntryPoint);                                                        // [0x197e4f0] Final                
};

/// Class /Game/UI/Widgets/TBP_UI_Spacer.TBP_UI_Spacer_C
/// Size: 0x0008 (0x000260 - 0x000268)
class UTBP_UI_Spacer_C : public UUserWidget
{ 
public:
	USpacer*                                           Spacer1;                                                    // 0x0260   (0x0008)  


	/// Functions
	// Function /Game/UI/Widgets/TBP_UI_Spacer.TBP_UI_Spacer_C.SetHeight
	void SetHeight(float Height);                                                                                            // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_Spacer.TBP_UI_Spacer_C.SetWidth
	void SetWidth(float Width);                                                                                              // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_Spacer.TBP_UI_Spacer_C.Set Size
	void Set Size(float Width, float Height);                                                                                // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/Widgets/Elysium/Vendors/Matchmaker/TBP_UI_MatchMaker_TabButton.TBP_UI_MatchMaker_TabButton_C
/// Size: 0x00E1 (0x000280 - 0x000361)
class UTBP_UI_MatchMaker_TabButton_C : public UTigerWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UWidgetAnimation*                                  Deselected;                                                 // 0x0288   (0x0008)  
	UWidgetAnimation*                                  Selected;                                                   // 0x0290   (0x0008)  
	UBorder*                                           Background;                                                 // 0x0298   (0x0008)  
	USizeBox*                                          ButtonSizeBox;                                              // 0x02A0   (0x0008)  
	UImage*                                            IconImage;                                                  // 0x02A8   (0x0008)  
	UButton*                                           MenuItemButton;                                             // 0x02B0   (0x0008)  
	UTigerStyledRichTextBlock*                         MenuItemText;                                               // 0x02B8   (0x0008)  
	UTBP_UI_NewNotification_C*                         TBP_UI_NewNotification;                                     // 0x02C0   (0x0008)  
	FText                                              ButtonText;                                                 // 0x02C8   (0x0018)  
	FMulticastInlineDelegate                           OnButtonPressed;                                            // 0x02E0   (0x0010)  
	bool                                               bIsSelected;                                                // 0x02F0   (0x0001)  
	unsigned char                                      UnknownData00_5[0x3];                                       // 0x02F1   (0x0003)  MISSED
	FMargin                                            LinePadding;                                                // 0x02F4   (0x0010)  
	int32_t                                            OverrideFontSize;                                           // 0x0304   (0x0004)  
	float                                              OverrideWidth;                                              // 0x0308   (0x0004)  
	bool                                               bHasBackground;                                             // 0x030C   (0x0001)  
	unsigned char                                      UnknownData01_5[0x3];                                       // 0x030D   (0x0003)  MISSED
	UTexture2D*                                        IconTexture;                                                // 0x0310   (0x0008)  
	FMulticastInlineDelegate                           OnButtonPressedCaller;                                      // 0x0318   (0x0010)  
	FMulticastInlineDelegate                           OnButtonHovered;                                            // 0x0328   (0x0010)  
	FMulticastInlineDelegate                           OnButtonUnhovered;                                          // 0x0338   (0x0010)  
	bool                                               bCallSiblingDeselect;                                       // 0x0348   (0x0001)  
	unsigned char                                      UnknownData02_5[0x7];                                       // 0x0349   (0x0007)  MISSED
	FDataTableRowHandle                                RichTextFont;                                               // 0x0350   (0x0010)  
	ETigerNewNotificationMenuOptions                   NewNotificationMenuType;                                    // 0x0360   (0x0001)  


	/// Functions
	// Function /Game/UI/Widgets/Elysium/Vendors/Matchmaker/TBP_UI_MatchMaker_TabButton.TBP_UI_MatchMaker_TabButton_C.AnimateTabSelection
	void AnimateTabSelection();                                                                                              // [0x197e4f0] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/Vendors/Matchmaker/TBP_UI_MatchMaker_TabButton.TBP_UI_MatchMaker_TabButton_C.Deselect
	void Deselect();                                                                                                         // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/Vendors/Matchmaker/TBP_UI_MatchMaker_TabButton.TBP_UI_MatchMaker_TabButton_C.Construct
	void Construct();                                                                                                        // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/Vendors/Matchmaker/TBP_UI_MatchMaker_TabButton.TBP_UI_MatchMaker_TabButton_C.BndEvt__MenuItemButton_K2Node_ComponentBoundEvent_0_OnButtonReleasedEvent__DelegateSignature
	void BndEvt__MenuItemButton_K2Node_ComponentBoundEvent_0_OnButtonReleasedEvent__DelegateSignature();                     // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Elysium/Vendors/Matchmaker/TBP_UI_MatchMaker_TabButton.TBP_UI_MatchMaker_TabButton_C.BndEvt__MenuItemButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
	void BndEvt__MenuItemButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();                        // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Elysium/Vendors/Matchmaker/TBP_UI_MatchMaker_TabButton.TBP_UI_MatchMaker_TabButton_C.Select
	void Select();                                                                                                           // [0x197e4f0] BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/Vendors/Matchmaker/TBP_UI_MatchMaker_TabButton.TBP_UI_MatchMaker_TabButton_C.PreConstruct
	void PreConstruct(bool IsDesignTime);                                                                                    // [0x197e4f0] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/Vendors/Matchmaker/TBP_UI_MatchMaker_TabButton.TBP_UI_MatchMaker_TabButton_C.BndEvt__MenuItemButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature
	void BndEvt__MenuItemButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();                        // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Elysium/Vendors/Matchmaker/TBP_UI_MatchMaker_TabButton.TBP_UI_MatchMaker_TabButton_C.BndEvt__MenuItemButton_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature
	void BndEvt__MenuItemButton_K2Node_ComponentBoundEvent_3_OnButtonClickedEvent__DelegateSignature();                      // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/Elysium/Vendors/Matchmaker/TBP_UI_MatchMaker_TabButton.TBP_UI_MatchMaker_TabButton_C.SetText
	void SetText(FText& InText);                                                                                             // [0x197e4f0] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/Vendors/Matchmaker/TBP_UI_MatchMaker_TabButton.TBP_UI_MatchMaker_TabButton_C.ExecuteUbergraph_TBP_UI_MatchMaker_TabButton
	void ExecuteUbergraph_TBP_UI_MatchMaker_TabButton(int32_t EntryPoint);                                                   // [0x197e4f0] Final|HasDefaults    
	// Function /Game/UI/Widgets/Elysium/Vendors/Matchmaker/TBP_UI_MatchMaker_TabButton.TBP_UI_MatchMaker_TabButton_C.OnButtonUnhovered__DelegateSignature
	void OnButtonUnhovered__DelegateSignature();                                                                             // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/Vendors/Matchmaker/TBP_UI_MatchMaker_TabButton.TBP_UI_MatchMaker_TabButton_C.OnButtonHovered__DelegateSignature
	void OnButtonHovered__DelegateSignature();                                                                               // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/Vendors/Matchmaker/TBP_UI_MatchMaker_TabButton.TBP_UI_MatchMaker_TabButton_C.OnButtonPressedCaller__DelegateSignature
	void OnButtonPressedCaller__DelegateSignature(UTBP_UI_MatchMaker_TabButton_C* Caller);                                   // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/Elysium/Vendors/Matchmaker/TBP_UI_MatchMaker_TabButton.TBP_UI_MatchMaker_TabButton_C.OnButtonPressed__DelegateSignature
	void OnButtonPressed__DelegateSignature();                                                                               // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/Widgets/TBP_UI_Button_ClosePopup.TBP_UI_Button_ClosePopup_C
/// Size: 0x0050 (0x000260 - 0x0002B0)
class UTBP_UI_Button_ClosePopup_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	UButton*                                           CloseButton;                                                // 0x0268   (0x0008)  
	UImage*                                            CloseButtonBG;                                              // 0x0270   (0x0008)  
	UImage*                                            ClosebuttonCross;                                           // 0x0278   (0x0008)  
	FMulticastInlineDelegate                           On_Pressed;                                                 // 0x0280   (0x0010)  
	FMulticastInlineDelegate                           On_Hover;                                                   // 0x0290   (0x0010)  
	FMulticastInlineDelegate                           On_Unhover;                                                 // 0x02A0   (0x0010)  


	/// Functions
	// Function /Game/UI/Widgets/TBP_UI_Button_ClosePopup.TBP_UI_Button_ClosePopup_C.BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_OnButtonReleasedEvent__DelegateSignature
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_0_OnButtonReleasedEvent__DelegateSignature();                        // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/TBP_UI_Button_ClosePopup.TBP_UI_Button_ClosePopup_C.BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();                           // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/TBP_UI_Button_ClosePopup.TBP_UI_Button_ClosePopup_C.BndEvt__CloseButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();                           // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/TBP_UI_Button_ClosePopup.TBP_UI_Button_ClosePopup_C.BndEvt__CloseButton_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature
	void BndEvt__CloseButton_K2Node_ComponentBoundEvent_3_OnButtonPressedEvent__DelegateSignature();                         // [0x197e4f0] BlueprintEvent       
	// Function /Game/UI/Widgets/TBP_UI_Button_ClosePopup.TBP_UI_Button_ClosePopup_C.ExecuteUbergraph_TBP_UI_Button_ClosePopup
	void ExecuteUbergraph_TBP_UI_Button_ClosePopup(int32_t EntryPoint);                                                      // [0x197e4f0] Final|HasDefaults    
	// Function /Game/UI/Widgets/TBP_UI_Button_ClosePopup.TBP_UI_Button_ClosePopup_C.On Unhover__DelegateSignature
	void On Unhover__DelegateSignature();                                                                                    // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_Button_ClosePopup.TBP_UI_Button_ClosePopup_C.On Hover__DelegateSignature
	void On Hover__DelegateSignature();                                                                                      // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/UI/Widgets/TBP_UI_Button_ClosePopup.TBP_UI_Button_ClosePopup_C.On Pressed__DelegateSignature
	void On Pressed__DelegateSignature();                                                                                    // [0x197e4f0] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/UI/Widgets/SystemMenu/TBP_UI_SystemMenuGamepadCurveDrawer.TBP_UI_SystemMenuGamepadCurveDrawer_C
/// Size: 0x01DC (0x000280 - 0x00045C)
class UTBP_UI_SystemMenuGamepadCurveDrawer_C : public UTigerWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	UImage*                                            BackgroundImage;                                            // 0x0288   (0x0008)  
	UImage*                                            BoostEndDot;                                                // 0x0290   (0x0008)  
	UImage*                                            BoostLine;                                                  // 0x0298   (0x0008)  
	UTigerStyledRichTextBlock*                         BoostText;                                                  // 0x02A0   (0x0008)  
	UImage*                                            DampenEndDot;                                               // 0x02A8   (0x0008)  
	UImage*                                            DampenStartDot;                                             // 0x02B0   (0x0008)  
	UTigerStyledRichTextBlock*                         DampenText;                                                 // 0x02B8   (0x0008)  
	UImage*                                            DampenToSenseLine;                                          // 0x02C0   (0x0008)  
	UTigerStyledRichTextBlock*                         DefaultSenseText;                                           // 0x02C8   (0x0008)  
	UImage*                                            DelayEndDot;                                                // 0x02D0   (0x0008)  
	UImage*                                            GraphImage;                                                 // 0x02D8   (0x0008)  
	UImage*                                            IconSensitivityImage;                                       // 0x02E0   (0x0008)  
	UImage*                                            IconTimeImage;                                              // 0x02E8   (0x0008)  
	UImage*                                            RampDelayLine;                                              // 0x02F0   (0x0008)  
	UImage*                                            RampEndDot;                                                 // 0x02F8   (0x0008)  
	UImage*                                            RampTimeLine;                                               // 0x0300   (0x0008)  
	UTigerStyledRichTextBlock*                         SecondsText;                                                // 0x0308   (0x0008)  
	UTigerStyledRichTextBlock*                         SecondsText2;                                               // 0x0310   (0x0008)  
